
//&ИзменениеИКонтроль("НадписьЭтапыОплатыНажатие")
//Процедура Расш1_НадписьЭтапыОплатыНажатие(Форма, Элемент, СтандартнаяОбработка, Оповещение)

//	Попытка
//		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
//	Исключение
//		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
//		Возврат;
//	КонецПопытки;

//	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
//	СистемныеНастройки = ПараметрыМеханизма.СистемныеНастройки;
//	СтандартнаяОбработка = Ложь;
//	СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, Элемент.Имя);

//	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
//		ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров, "ДатаПлатежа");
//	КонецЕсли;

//	ПорядокРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов);
//	ЭтоЗаказ        = СтруктураПараметров.ЭтоЗаказ;

//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("ТолькоПросмотр",                          Форма.ТолькоПросмотр ИЛИ СтруктураПараметров.ЭтапыОплатыТолькоПросмотр);

//	Если ЗначениеЗаполнено(СтруктураПараметров.СуммаЗалогаЗаТаруФорма) Тогда
//		СуммаЗалоговойТары = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаЗалогаЗаТаруФорма);
//	Иначе
//		СуммаЗалоговойТары = 0;
//	КонецЕсли;

//	ПараметрыОткрытия.Вставить("СуммаЗалогаПоДокументу",                  СуммаЗалоговойТары);
//	СуммаВсего = ВзаиморасчетыКлиентСервер.СуммаКОплате(Форма, СтруктураПараметров);
//	ПараметрыОткрытия.Вставить("СуммаОплатыПоДокументу",                  СуммаВсего - СуммаЗалоговойТары);

//	Если (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным")
//		ИЛИ ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным"))
//		И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
//		СуммаРасшифровкиПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа).Итог("СуммаВзаиморасчетов");
//		ПараметрыОткрытия.Вставить("СуммаОбязательнойПредоплаты", СуммаРасшифровкиПлатежа);
//	Иначе
//		ПараметрыОткрытия.Вставить("СуммаОбязательнойПредоплаты", 0);
//	КонецЕсли;

//	ПараметрыОткрытия.Вставить("ТребуетсяЗалогЗаТару",                    СуммаЗалоговойТары <> 0);

//	ЭтапыОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
//	ЕстьСуммаОтклоненияМерныхТоваров = СистемныеНастройки.ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров
//	И ЭтапыОплаты <> Неопределено
//	И ЭтапыОплаты.Количество() > 0
//	И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"СуммаОтклоненияМерныхТоваров");
//	Если ЕстьСуммаОтклоненияМерныхТоваров Тогда
//		СуммаОтклоненияМерныхТоваров = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты).Итог("СуммаОтклоненияМерныхТоваров");
//	Иначе
//		СуммаОтклоненияМерныхТоваров = 0;
//	КонецЕсли;
//	ПараметрыОткрытия.Вставить("СуммаОтклоненияПоДокументу",                 СуммаОтклоненияМерныхТоваров);

//	//реквизиты формы
//	ПараметрыОткрытия.Вставить("УникальныйИдентификатор",                 Форма.УникальныйИдентификатор);
//	ПараметрыОткрытия.Вставить("Ключ",                                    Форма.Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПараметрыВыбораРеквизитов",               СтруктураПараметров.ПараметрыВыбораРеквизитов);

//	//реквизиты объекта
//	ПараметрыОткрытия.Вставить("Партнер",                                 ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Партнер));
//	ПараметрыОткрытия.Вставить("Соглашение",                              ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Соглашение));
//	ПараметрыОткрытия.Вставить("Договор",                                 ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Договор));
//	ПараметрыОткрытия.Вставить("Дата",                                    ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата));
//	ПараметрыОткрытия.Вставить("Валюта",                                  ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента));
//	ПараметрыОткрытия.Вставить("ГрафикОплаты",                            ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ГрафикОплаты));
//	ПараметрыОткрытия.Вставить("ФормаОплаты",                             ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ФормаОплаты));
//	ПараметрыОткрытия.Вставить("Касса",                                   ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Касса));
//	ПараметрыОткрытия.Вставить("БанковскийСчет",                          ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.БанковскийСчетОрганизации));
//	ПараметрыОткрытия.Вставить("Организация",                             ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация));
//	ПараметрыОткрытия.Вставить("ИдентификаторПлатежа",                    ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ИдентификаторПлатежа));

//	ПараметрыОткрытия.Вставить("ПорядокРасчетов",                         ПорядокРасчетов);
//	ПараметрыОткрытия.Вставить("НаправлениеДеятельности",                 ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НаправлениеДеятельности));
//	ПараметрыОткрытия.Вставить("ОплатаВВалюте",                           ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ОплатаВВалюте));
//	ПараметрыОткрытия.Вставить("ДатаПлатежа",                             ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаПлатежа));
//	#Вставка
//	Если СтруктураПараметров.ДокументРасчетовСПоставщиками
//		И ЗначениеЗаполнено(СтруктураПараметров.ИдентификаторПлатежа) Тогда
//		ПараметрыОткрытия.Вставить("РазрешеноИзменятьУИП", Истина);
//	КонецЕсли;
//	#КонецВставки

//	ПутьКДаннымВалютаВзаиморасчетов = ?(СтруктураПараметров.ВалютаВзаиморасчетов = "", СтруктураПараметров.ВалютаДокумента, СтруктураПараметров.ВалютаВзаиморасчетов);
//	ПараметрыОткрытия.Вставить("ВалютаВзаиморасчетов",                    ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, ПутьКДаннымВалютаВзаиморасчетов));

//	//настройки
//	НакладнаяПоЗаказам = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НакладнаяПоЗаказам,, Ложь);
//	ПараметрыОткрытия.Вставить("НакладнаяПоЗаказам",                      НакладнаяПоЗаказам);

//	ПараметрыОткрытия.Вставить("ЭтоЗаказ",                                ЭтоЗаказ);
//	ПараметрыОткрытия.Вставить("ИмяПоляЗаказ",                            СтруктураПараметров.ИмяРеквизитаТЧЗаказ);
//	ПараметрыОткрытия.Вставить("ЗаказКакСчет",                            СтруктураПараметров.ЗаказКакСчет);

//	Если ЭтоЗаказ Тогда
//		ПараметрыОткрытия.Вставить("ДатаСогласования",                    ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаСогласования));
//		ПараметрыОткрытия.Вставить("ДатаЗаказа",                          ПараметрыОткрытия.Дата);
//	КонецЕсли;

//	Если СтруктураПараметров.ДокументРасчетовСКлиентами
//		И СтруктураПараметров.ЭтоПродажаЗакупка Тогда
//		ПараметрыОткрытия.Вставить("ДатаОтгрузки",                        ПараметрыОткрытия.Дата);
//		ПараметрыОткрытия.Вставить("НесколькоДатОтгрузки",                Ложь);
//	ИначеЕсли СтрЧислоВхождений(СтруктураПараметров.ДатаОтгрузки, ".") > 1 Тогда
//		ПараметрыОткрытия.Вставить("ДатаОтгрузки",                        Дата(1,1,1));
//		ПараметрыОткрытия.Вставить("НесколькоДатОтгрузки",                Истина);
//	Иначе
//		ПараметрыОткрытия.Вставить("ДатаОтгрузки",                        ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаОтгрузки));
//		ПараметрыОткрытия.Вставить("НесколькоДатОтгрузки",                Ложь);
//	КонецЕсли;

//	Если СтруктураПараметров.ДокументРасчетовСПоставщиками Тогда
//		ПараметрыОткрытия.Вставить(
//		"ОтключитьЗаполнениеПоПредыдущимЗаказам",
//		//++ НЕ УТ
//		ТипЗнч(Форма.Объект.Ссылка) <> Тип("ДокументСсылка.ЗаказПереработчику2_5") И
//		//-- НЕ УТ
//		ТипЗнч(Форма.Объект.Ссылка) <> Тип("ДокументСсылка.ЗаказПоставщику"));
//	КонецЕсли;

//	ПараметрыОткрытия.Вставить("ДатаПереходаПраваСобственности",          ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаПереходаПраваСобственности));
//	ПараметрыОткрытия.Вставить("РежимСамообслуживания",                   ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь());
//	ПараметрыОткрытия.Вставить("АдресВоВременномХранилище",               СтруктураПараметров.АдресЭтапыОплаты);
//	ПараметрыОткрытия.Вставить("АдресСуммПоЗаказам",                      ВзаиморасчетыВызовСервера.ПоместитьСуммыПоЗаказамВоВременноеХранилище(Форма.Объект, СтруктураПараметров));
//	ПараметрыОткрытия.Вставить("ЗаданГрафикИсполнения",                   СтруктураПараметров.ЗаданГрафикИсполнения);
//	ПараметрыОткрытия.Вставить("ГрафикИсполненияДоговора",                СтруктураПараметров.ГрафикИсполненияДоговора);
//	ПараметрыОткрытия.Вставить("СпециальныеЗаголовкиЭтаповДляВозврата", ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента"));
//	ПараметрыОткрытия.Вставить("НетКонтроляПредоплаты",                   СтруктураПараметров.НетКонтроляПредоплаты);
//	ПараметрыОткрытия.Вставить("ЕстьДатаПереходаПраваСобственности",      СтруктураПараметров.ЕстьДатаПереходаПраваСобственности);
//	ПараметрыОткрытия.Вставить("ЕстьРучныеИзмененияГрафикаОплат",         СтруктураПараметров.ЕстьРучныеИзмененияГрафикаОплат);
//	ПараметрыОткрытия.Вставить("НеУказыватьИсточникиОплаты",              СтруктураПараметров.НеУказыватьИсточникиОплаты);

//	Если  ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации")
//		ИЛИ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
//		ПараметрыОткрытия.Вставить("ДоступныеПорядкиРасчетов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОткрытия.ПорядокРасчетов));
//		ПараметрыОткрытия.Вставить("ЭтоКорректировка", Истина);
//	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ОтчетКомиссионера")
//		И ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДоговорКомиссионера)) Тогда
//		СписокПорядков = Новый СписокЗначений;
//		СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов"));
//		СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказам"), НСтр("ru = 'По отчетам комиссионера/реализациям через комиссионера';
//		|en = 'By consignment issue notifications/sales via consignee'"));
//		ПараметрыОткрытия.Вставить("ДоступныеПорядкиРасчетов", СписокПорядков);
//	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
//		И ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДоговорКомиссионера)) Тогда
//		СписокПорядков = Новый СписокЗначений;
//		Если СтруктураПараметров.ВестиРасчетыЧерезКонечныхПокупателей Тогда
//			СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов"));
//		Иначе
//			СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов"));
//			СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным"), НСтр("ru = 'Аванс по договорам, долг по накладным (только реализация)';
//			|en = 'Invoice for debt, Contract for prepayment (sales only)'"));
//			СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказам"), НСтр("ru = 'По отчетам комиссионера/реализациям через комиссионера';
//			|en = 'By consignment issue notifications/sales via consignee'"));
//		КонецЕсли;
//		ПараметрыОткрытия.Вставить("ДоступныеПорядкиРасчетов", СписокПорядков);

//	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
//		Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями")
//		Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями")
//		Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациямиОСписании") Тогда

//		Если Форма.Объект.РасчетыЧерезОтдельногоКонтрагента Тогда

//			ПараметрыОткрытия.Вставить(
//			"ДоступныеПорядкиРасчетов",
//			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОткрытия.ПорядокРасчетов));

//		КонецЕсли;

//	КонецЕсли;

//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("Форма", Форма);
//	ДополнительныеПараметры.Вставить("Элемент", Элемент);
//	ДополнительныеПараметры.Вставить("СтруктураПараметров", СтруктураПараметров);
//	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", Оповещение);
//	ДополнительныеПараметры.Вставить("ПараметрыМеханизма", ПараметрыМеханизма);

//	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НадписьЭтапыОплатыНажатиеЗавершение", ЭтотОбъект, ДополнительныеПараметры);

//	Если СтруктураПараметров.ДокументРасчетовСКлиентами Тогда
//		ОткрытьФорму("ОбщаяФорма.ЭтапыОплатыКлиентом", 
//		ПараметрыОткрытия,
//		Форма,,,,
//		ОповещениеОЗакрытии,
//		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Иначе
//		ОткрытьФорму("ОбщаяФорма.ЭтапыОплатыПоставщику", 
//		ПараметрыОткрытия,
//		Форма,,,,
//		ОповещениеОЗакрытии,
//		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	КонецЕсли;
//КонецПроцедуры

