
&НаКлиенте
Процедура Склад1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	//СтандартнаяОбработка = Ложь;
	Список.Параметры.УстановитьЗначениеПараметра("Склад", ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата(); 
	//Склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ТекущаяДата()));
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	#Если МобильныйКлиент Тогда
		ЭтаФорма.Элементы.НовыйПересчет.Видимость = Истина;		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Дата1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)  
	//СтандартнаяОбработка = Ложь;
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ВыбранноеЗначение));
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ВыбранноеЗначение));

КонецПроцедуры

&НаСервере
Процедура ПриПовторномОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриПовторномОткрытииНаСервере();
КонецПроцедуры





