
Процедура ПередЗаписью(Отказ)
	  Если ЭтоНовый() Тогда
       Запрос = Новый Запрос("ВЫБРАТЬ Наименование ИЗ Справочник.СХК_ШтрихкодСотрудника ГДЕ Сотрудник = &Сотрудник");
       Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
       Результат = Запрос.Выполнить();
       Если НЕ Результат.Пустой() Тогда
           Сообщение = Новый СообщениеПользователю;
           Сообщение.Текст = "Уже есть!";
           Сообщение.Сообщить();
           Отказ = Истина;
       КонецЕсли;
   КонецЕсли;

КонецПроцедуры
