
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Параметры.ЗначенияЗаполнения;
	
	Если СтруктураПараметров.Количество() >=1 Тогда  
		ЭтаФорма.ВидНоменклатуры  = СтруктураПараметров.ВидНоменклатуры;
		ЭтаФорма.СерияНоменклатуры  = СтруктураПараметров.Ссылка;
		ЭтаФорма.Номенклатура  = СтруктураПараметров.Номенклатура;
		ЗаполнитьПоля(СтруктураПараметров);
	КонецЕсли;   
	

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоля(СтруктураПараметров) 
	Если СерияНоменклатуры.Пустая() = Истина Тогда
		ЭтотОбъект.ДатаПроизводства = ТекущаяДата();
		ЭтотОбъект.ГоденДо = ДобавитьМесяц(ТекущаяДата(),Номенклатура.СрокГодности);  
		ЭтаФорма.СХК_СрокГодности = Номенклатура.СрокГодности;
		ВидимостьПрефикс();
		СформироватьПолучитьНомер();	
		
	Иначе 
		ЭтаФорма.ДатаПроизводства = ЭтаФорма.СерияНоменклатуры.ДатаПроизводства;	
		ЭтаФорма.ГоденДо = ЭтаФорма.СерияНоменклатуры.ГоденДо;	
		ЭтаФорма.Упаковка = ЭтаФорма.СерияНоменклатуры.СХК_Упаковка;
		ЭтаФорма.Номер = ЭтаФорма.СерияНоменклатуры.Номер;
		Если ЭтаФорма.СерияНоменклатуры.СХК_СрокГодности <> 0 Тогда 
			ЭтаФорма.СХК_СрокГодности = ЭтаФорма.СерияНоменклатуры.СХК_СрокГодности;
		Иначе
			ЭтаФорма.СХК_СрокГодности = Номенклатура.СрокГодности;
		КонецЕсли;  
		
		ЭтаФорма.Элементы.ГруппаЭлемента.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.Сохранить.Доступность = Ложь;
		
	КонецЕсли;

	ЗаполнитьУпаковки();
	
КонецПроцедуры 


&НаСервере
Процедура ВидимостьПрефикс()
	ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","СХК_ИспользоватьЛицензию");
	Значение=УправлениеСвойствами.ЗначениеСвойства(ЭтаФорма.Номенклатура,ДопСвойство);
	Если Значение = Истина Тогда
		ЭтаФорма.Элементы.ГруппаПрефикс.Видимость = Истина;  
	Иначе
		ЭтаФорма.Элементы.ГруппаПрефикс.Видимость = Ложь;  
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУпаковки()
		ЗапросУп = Новый Запрос;
		ЗапросУп.Текст = "ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.ПометкаУдаления = &ПометкаУдаления
		|	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец"; 
		ЗапросУп.УстановитьПараметр("ПометкаУдаления",Ложь);
		ЗапросУп.УстановитьПараметр("Владелец",Номенклатура);
		РезультатЗапросаУп = ЗапросУп.Выполнить();
				
		СписокУпаковок = Новый СписокЗначений; 
		СписокУпаковок.Очистить();
		СписокУпаковок.ЗагрузитьЗначения(РезультатЗапросаУп.Выгрузить().ВыгрузитьКолонку("Ссылка"));		
		ЭтаФорма.Элементы.ВыборУпаковки.СписокВыбора.ЗагрузитьЗначения(СписокУпаковок.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПолучитьНомер() 
	
	Если Не Упаковка.Пустая() Тогда
		Уп = "по " +Строка(Упаковка.Числитель) + "";
	Иначе
		Уп = "";
	КонецЕсли;
	
	Преф  = ?(ЗначениеЗаполнено(ЭтаФорма.Префикс),"("+Строка(ЭтаФорма.Префикс)+")" , "");
	ЭтотОбъект.Номер = Преф +Строка(Номенклатура.Артикул) + " от " + 
					   Строка(Формат(ЭтотОбъект.ДатаПроизводства,"ДФ=dd.MM.yy"))+ " (" + 
					   Строка(Уп)+ " шт) до " + Строка(Формат(ЭтотОбъект.ГоденДо,"ДФ=dd.MM.yy"));
КонецПроцедуры

&НаКлиенте
Процедура ВыборУпаковкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СЗУпаковкиПриИзмененииНаСервере(ВыбранноеЗначение);

КонецПроцедуры


&НаСервере
Процедура СЗУпаковкиПриИзмененииНаСервере(Эл)  
	ЭтаФорма.Упаковка = Эл;  
	СформироватьПолучитьНомер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваПриИзменении(Элемент)
	ДатаПроизводстваПриИзмененииНаСервере();
	СформироватьПолучитьНомер();
КонецПроцедуры

&НаСервере
Процедура ДатаПроизводстваПриИзмененииНаСервере()  
	ЭтотОбъект.ГоденДо = ДобавитьМесяц(ЭтотОбъект.ДатаПроизводства,Номенклатура.СрокГодности);
КонецПроцедуры


&НаКлиенте
Процедура ГоденДоПриИзменении(Элемент) 
	//ГоденДоПриИзмененииНаСервере();
	СформироватьПолучитьНомер();
КонецПроцедуры


&НаСервере
Функция СохранитьНаСервере()
	Если ЭтотОбъект.ДатаПроизводства = Дата(1,1,1) ИЛИ
		ЭтотОбъект.ГоденДо = Дата(1,1,1) ИЛИ
		ЭтотОбъект.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		ош = "Заполните все поля"; 
		
		Возврат ош;

	КонецЕсли;		
	
	спр = Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер",ЭтаФорма.Номер);
	
	Если СерияНоменклатуры.Пустая() = Истина Тогда 
		Если спр.Пустая() = Истина Тогда
			спр = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Иначе
			спр = спр.Ссылка.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		спр = СерияНоменклатуры.ПолучитьОбъект();
	КонецЕсли;   
	
	спр.ДатаПроизводства = ЭтаФорма.ДатаПроизводства;
	спр.ГоденДо = ЭтаФорма.ГоденДо;
	спр.СХК_Упаковка = ЭтаФорма.Упаковка;   
	спр.ВидНоменклатуры = ЭтаФорма.ВидНоменклатуры;
	спр.Наименование =  ЭтаФорма.Номер;
	спр.Номер =  ЭтаФорма.Номер;   
	спр.СХК_СрокГодности =  ЭтаФорма.СХК_СрокГодности;   
	спр.СХК_Префикс =  ЭтаФорма.Префикс;   
	
	Попытка
		спр.Записать(); 
		ЭтаФорма.СерияНоменклатуры = спр.Ссылка;
		ош =  Истина;
	Исключение
		ош =  Ложь;
	КонецПопытки; 
	
	Возврат ош;
		
КонецФункции


&НаКлиенте
Процедура Сохранить(Команда) 
	Ош = СохранитьНаСервере();
	Если ош = Истина Тогда
		ЭтаФорма.Закрыть();  
	Иначе

		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения() Экспорт
	ЭтаФорма.Закрыть();	
КонецПроцедуры



&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	СписокПараметров = Новый Структура;  
    СписокПараметров.Вставить("Номер", ЭтаФорма.СерияНоменклатуры);  
    ОповеститьОВыборе(СписокПараметров);    

КонецПроцедуры

&НаСервере
Процедура СХК_СрокГодностиПриИзмененииНаСервере()
	ЭтотОбъект.ГоденДо = ДобавитьМесяц(ЭтотОбъект.ДатаПроизводства,ЭтотОбъект.СХК_СрокГодности);
КонецПроцедуры

&НаКлиенте
Процедура СХК_СрокГодностиПриИзменении(Элемент)
	СХК_СрокГодностиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрефиксПриИзменении(Элемент)
	Если ИспользоватьПрефикс = Истина Тогда
		ЭтаФорма.Элементы.Префикс.Видимость = Истина;
		ЗаполнитьПрефиксы();
	Иначе
		ЭтаФорма.Элементы.Префикс.Видимость = Ложь; 
		ОчиститьПрефиксы();
	КонецЕсли;		
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьПрефиксы()
	ЭтаФорма.Префикс = "СМФ";	
	СформироватьПолучитьНомер();
КонецПроцедуры  

&НаСервере
Процедура ОчиститьПрефиксы()
	ЭтаФорма.Префикс = "";	    
	СформироватьПолучитьНомер();
КонецПроцедуры

