Функция ПоискНоменклатурыПоШК(Штрихкод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";  
	Запрос.УстановитьПараметр("Штрихкод",Штрихкод); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Номенклатура;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции  

 Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура,СерииНоменклатуры) Экспорт
	 СЗ = Новый Структура;
	 СЗ.Вставить("ЕдиницаИзмерения",Номенклатура.ЕдиницаИзмерения); 
	 Если ЗначениеЗаполнено(СерииНоменклатуры.СХК_Упаковка) Тогда
	 	СЗ.Вставить("Числитель",СерииНоменклатуры.СХК_Упаковка.Числитель); 
	Иначе
	 	СЗ.Вставить("Числитель",Номенклатура.ЕдиницаИзмерения.Числитель); 
	КонецЕсли;
	
	Возврат СЗ;
	
 КонецФункции

