Функция ТабельСкудСервер(ДатаНачала,ДатаОкончания) Экспорт
			ЗапросБПЗО = Новый Запрос;
		ЗапросБПЗО.Текст = "ВЫБРАТЬ
		|	СУММА(СХК_ВыпускПоЭтапу.Количество) КАК КоличествоФакт,
		|	ПРЕДСТАВЛЕНИЕ(СХК_ВыпускПоЭтапу.Линия) КАК Линия,
		|	СХК_ВыпускПоЭтапу.Период КАК Период,
		|	СХК_ПланПроизводства.Количество КАК КоличествоПлан,
		|	ВложенныйЗапрос.ТабНомер КАК ТабНомер,
		|	ВложенныйЗапрос.Часы КАК Часы,
		|	ВЫБОР
		|		КОГДА СУММА(СХК_ВыпускПоЭтапу.Количество) * 100 / СХК_ПланПроизводства.Количество > 90
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Выполнено
		|ИЗ
		|	РегистрСведений.СХК_ПланПроизводства КАК СХК_ПланПроизводства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СХК_ВыпускПоЭтапу КАК СХК_ВыпускПоЭтапу
		|		ПО СХК_ПланПроизводства.Период = СХК_ВыпускПоЭтапу.Период
		|			И СХК_ПланПроизводства.Линия = СХК_ВыпускПоЭтапу.Линия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СХКТруд_КТУ.Период КАК Период,
		|			СХКТруд_КТУ.ТабНомер КАК ТабНомер,
		|			СХКТруд_КТУ.Линия КАК Линия,
		|			СХКТруд_КТУ.Часы КАК Часы
		|		ИЗ
		|			РегистрСведений.СХКТруд_КТУ КАК СХКТруд_КТУ) КАК ВложенныйЗапрос
		|		ПО СХК_ПланПроизводства.Период = ВложенныйЗапрос.Период
		|			И СХК_ПланПроизводства.Линия = ВложенныйЗапрос.Линия
		|ГДЕ
		|	СХК_ВыпускПоЭтапу.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	СХК_ВыпускПоЭтапу.Линия,
		|	СХК_ВыпускПоЭтапу.Период,
		|	СХК_ПланПроизводства.Количество,
		|	ВложенныйЗапрос.ТабНомер,
		|	ВложенныйЗапрос.Часы";
		ЗапросБПЗО.УстановитьПараметр("ДатаНачала",НачалоДня(ДатаНачала));   
		ЗапросБПЗО.УстановитьПараметр("ДатаОкончания",КонецДня(ДатаОкончания));   
		
	Результат = ЗапросБПЗО.Выполнить();
	Выборка = Результат.Выбрать();
		Мас = Новый Массив;
		Пока Выборка.Следующий() Цикл 
			Структура = Новый Структура("Период, ТабНомер,Часы,Выполнено,Линия,КоличествоПлан,КоличествоФакт");
			ЗаполнитьЗначенияСвойств(Структура, Выборка);  
			Мас.Добавить(Структура);
		КонецЦикла;
		
		Возврат Мас;
		
	КонецФункции
		