&НаКлиенте
&Вместо("СоздатьОрдера")
Процедура СХК_СоздатьОрдера(Команда)
	Если ПроверитьПользователяДату() Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Расходные ордера можно создавать не ранее чем за 2 дня",10,"Внимание!!!");
		
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	ПроверитьСкладПомещение(Отказ);
		
	СоздатьОрдераФрагмент(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
		
КонецПроцедуры


&НаКлиенте
Функция ПроверитьПользователяДату()  
	Для Каждого ВыделеннаяСтрока Из Элементы.РаспоряженияНаОтгрузку.ВыделенныеСтроки Цикл
		Возврат ПроверитьПользователяДатуНаСервере(Элементы.РаспоряженияНаОтгрузку.ДанныеСтроки(ВыделеннаяСтрока).Распоряжение);
		Прервать;
	КонецЦикла;
					
КонецФункции                             
 
&НаСервере 
Функция ПроверитьПользователяДатуНаСервере(ЗаказСсылка)
	Ош = Ложь;
	Попытка
    ДатаОтгрузки = КонецДня(ЗаказСсылка.ЖелаемаяДатаОтгрузки) - 172800;

    ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	
	СкладГруппы = Справочники.ГруппыПользователей.НайтиПоНаименованию("Отдел складского учета"); 
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь",ТекПользователь);
	Строка = СкладГруппы.Состав.НайтиСтроки(Отбор);                               
	
		Если Строка.Количество()>=1 И ДатаОтгрузки > КонецДня(ТекущаяДата())Тогда
			Ош = Истина;						
		КонецЕсли; 
	Исключение
		
	КонецПопытки;

	
	Возврат Ош;
	
КонецФункции

