&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЗаполнитьПомещения(); 
	СтатусПриИзмененииПослеНаСервере();
КонецПроцедуры



Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(а,б) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ЗаданиеЭтикеткиПосле(Команда)
	С = ПроверитьСтроку(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Номенклатура,ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Расш1_Серия);
	Если С = Ложь Тогда
		Предупреждение("Не заполнена номенклатура или серия, или не проведен документ"); 
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Номенклатура);
		ПараметрыФормы.Вставить("Серия",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Расш1_Серия);
		ПараметрыФормы.Вставить("Ссылка",С);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормы,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("РегистрСведений.СХК_ЗаданиеНаПечатьЭтикеток.Форма.ФормаЗаписи", _Параметры,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры




&НаСервере
Функция ПроверитьСтроку(Номенклатура,Расш1_Серия)
	Если Номенклатура.Пустая() = Истина ИЛИ Расш1_Серия.Пустая() ИЛИ Объект.Проведен = Ложь Тогда
		Возврат Ложь;
	Иначе
		Возврат Объект.Ссылка; 
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура Расш1_ПродукцияНоменклатураПриИзмененииПосле(Элемент)
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Склад = ПолучитьСклад();
КонецПроцедуры                                                       

&НаСервере
Функция ПолучитьСклад()
	
	Возврат Справочники.Склады.НайтиПоНаименованию("ЦМ Цех Мюсли");
	
КонецФункции  

/////////////////////////
&НаСервере
Процедура ЗаполнитьПомещения() 
	Объект.СХК_Склад = ПолучитьСклад();
	Если Объект.СХК_Этаж.Пустая() = Истина Тогда
		УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("СХК_Склад,СХК_Этаж",Объект.СХК_Склад,Объект.СХК_Этаж));
	КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СХК_СкладПриИзмененииПосле(Элемент)
	СкладПриИзмененииСервер();
КонецПроцедуры    

&НаСервере
Процедура СкладПриИзмененииСервер() 
	Элементы.СХК_Этаж.Видимость = СкладыСервер.ИспользоватьСкладскиеПомещения(Объект.СХК_Склад,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтатусПриИзмененииПосле(Элемент)
	СтатусПриИзмененииПослеНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СтатусПриИзмененииПослеНаСервере()
	//Если Объект.Статус <> Перечисления.СтатусыЗаказовНаПроизводство2_2.Формируется Тогда
	//	ЭтаФорма.Элементы.Продукция.Доступность = Ложь;
	//КонецЕсли;		
КонецПроцедуры



&НаСервере
Функция ПолучитьВидНоменклатуры(Номенклатура) 
	
	Возврат Номенклатура.ВидНоменклатуры;
КонецФункции


&НаКлиенте
Процедура Расш1_СоздатьСерииПосле(Команда)
	
	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);	
	
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНомен,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура,"");
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйСерия", ЭтаФорма);
	
	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйСерия(Значение, ДопПараметры) Экспорт  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия = ПолучитьСериюПоНомеру(Строка(Значение.Номер),ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);		
	КонецЕсли;
КонецПроцедуры     

// при выборе из списка
&НаКлиенте
Процедура СХК_СерияНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);	
	
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура", ВидНомен,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерииИзСписка", ЭтаФорма);
	
	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСписка", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерииИзСписка(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия = ПолучитьСериюПоНомеру(Значение.Номер,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);		
	КонецЕсли;
	
 	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры     

 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерии(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия = ПолучитьСериюПоНомеру(Значение.Номер,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);		
	КонецЕсли;

КонецПроцедуры     

&НаКлиенте
Процедура Расш1_ПродукцияРасш1_СерияОткрытиеПосле(Элемент, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;

	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);	

	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНомен,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерии", ЭтаФорма);

	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПродукцияРасш1_СерияОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПродукцияРасш1_СерияНачалоВыбораИзСпискаПосле(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры











