&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ЗаполнитьТЧ();	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЧ()
	ТЧ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураКонтрагентов.Идентификатор КАК Идентификатор,
	               |	НоменклатураКонтрагентов.Штрихкод КАК Штрихкод,
	               |	НоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
	               |	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	               |ГДЕ
	               |	НоменклатураКонтрагентов.ПометкаУдаления = &ПометкаУдаления
	               |	И НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);   
	Запрос.УстановитьПараметр("ВладелецНоменклатуры",Объект.Партнер);
	Рез = Запрос.Выполнить().Выбрать(); 
	
	
	
	Пока Рез.Следующий() Цикл
		Т = ТЧ.Добавить();
		Т.Номенклатура = Рез.Ссылка;
		Т.SKU = Рез.Идентификатор;
		Т.Штрихкод = Рез.Штрихкод;
		ТекущийПлан = ОстокФакт(Объект.Партнер,Рез.Ссылка); 
		Если ТекущийПлан <> "" Тогда
			Т.ТекущийПлан = ТекущийПлан;   
		Иначе
			Т.ТекущийПлан = 0 ;			
		КонецЕсли;	
	КонецЦикла;
	
	
КонецФункции


&НаСервере
Функция ОстокФакт(Партнер,Номен)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Расш1_ПланОстатокЕкомСрезПоследних.НоменклатураКонтрагента КАК Номенклатура,
	               |	Расш1_ПланОстатокЕкомСрезПоследних.ПланОстаток КАК ПланОстаток,
	               |	Расш1_ПланОстатокЕкомСрезПоследних.ДатаПлана КАК ДатаПлана
	               |ИЗ
	               |	РегистрСведений.Расш1_ПланОстатокЕком.СрезПоследних КАК Расш1_ПланОстатокЕкомСрезПоследних
	               |ГДЕ
	               |	Расш1_ПланОстатокЕкомСрезПоследних.Партнер = &Партнер
	               |	И Расш1_ПланОстатокЕкомСрезПоследних.ДатаПлана <= &Период
	               |	И Расш1_ПланОстатокЕкомСрезПоследних.НоменклатураКонтрагента = &НоменклатураКонтрагента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПлана УБЫВ";
	
	Запрос.УстановитьПараметр("Партнер",Партнер);   
	Запрос.УстановитьПараметр("Период",КонецДня(Дата));   
	Запрос.УстановитьПараметр("НоменклатураКонтрагента",Номен);
	Рез = Запрос.Выполнить().Выбрать();
	ПланОстаток = 0;
	Пока Рез.Следующий() Цикл
		ПланОстаток = Рез.ПланОстаток;
		Прервать;	
	КонецЦикла;
 	
	Возврат ПланОстаток;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	Для Каждого стр из ТЧ цикл
		НоваяЗапись = РегистрыСведений.Расш1_ПланОстатокЕком.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = Дата; 
		НоваяЗапись.ДатаПлана = Дата;
		НоваяЗапись.Партнер = Объект.Партнер;  
		НоваяЗапись.НоменклатураКонтрагента = стр.Номенклатура; 
		Если стр.План <> "" Тогда 
			НоваяЗапись.ПланОстаток = стр.План; 
		Иначе
			НоваяЗапись.ПланОстаток = стр.ТекущийПлан; 
		КонецЕсли;			
		Попытка
			НоваяЗапись.Записать(Истина);		
		Исключение 
			Сообщить(стр.Номенклатура);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере(); 
	ЗаполнитьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьТЧ();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	ТЧ.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры




