Процедура СХК_РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Объект, ПараметрыРаспределенияЗатрат, Группировки) Экспорт
	
	Если Не ПараметрыРаспределенияЗатрат.РассчитыватьПолеДоляСтоимостиПроцент Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = Объект[ПараметрыРаспределенияЗатрат.ИмяТЧ];
	
	Если ТабличнаяЧасть.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИтогиПоГруппировкам = ИтогиДолейСтоимостиПоГруппировкам(ТабличнаяЧасть, ПараметрыРаспределенияЗатрат, Группировки);
	
	Для каждого Строка Из ТабличнаяЧасть Цикл
		
		Отменено = (ПараметрыРаспределенияЗатрат.ЕстьПолеОтменено И Строка.Отменено);
		
		Если ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат <> "" Тогда
			Группировка = Строка[ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат];
		Иначе
			Группировка = "";
		КонецЕсли;
		
		Если ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат <> ""
			И Группировки <> Неопределено
			И Группировки.Найти(Группировка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Итоги = ИтогиПоГруппировкам[Группировка];
		
		Если Итоги = Неопределено Тогда
			Строка.ДоляСтоимостиПроцент = 0;
			Строка.ДоляСтоимостиОбязательна = Ложь;
			Строка.ЕстьОшибкиЗаполненияДолиСтоимости = Ложь;
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = ?(Итоги.ДоляСтоимостиОбязательна, "ДоляСтоимости", "Количество");
		
		Если НЕ Отменено Тогда
			Строка.ДоляСтоимостиПроцент = (Строка["Количество"] / Итоги["Количество"]) * 100;
			Если Строка.ДоляСтоимостиПроцент = 100 И Строка[ИмяПоля] <> Итоги[ИмяПоля] Тогда
				Строка.ДоляСтоимостиПроцент = 99.99;
			КонецЕсли;
		Иначе
			Строка.ДоляСтоимостиПроцент =
				?(Не Итоги.ДоляСтоимостиОбязательна И Итоги.КоличествоСтрокВГруппировке = 1 И НЕ Отменено, 100, 0);
		КонецЕсли;
		
		Если ПараметрыРаспределенияЗатрат.РассчитыватьПризнакДоляСтоимостиОбязательна Тогда
			Строка.ДоляСтоимостиОбязательна = Итоги.ДоляСтоимостиОбязательна И НЕ Отменено;
		КонецЕсли;
		
		Если ПараметрыРаспределенияЗатрат.РассчитыватьПризнакЕстьОшибкиЗаполнения Тогда
			ЗаполнитьПризнакЕстьОшибкиЗаполненияДолиСтоимости(Строка, Итоги, Отменено, ПараметрыРаспределенияЗатрат);
		КонецЕсли;
		
		Если ПараметрыРаспределенияЗатрат.ЕстьПараметризацияРесурснойСпецификации Тогда
			Строка.ДоляСтоимостиНедоступна = Итоги.ИспользуетсяПараметризация И Итоги.ДоляСтоимостиРассчитывается;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
