
Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.ДействуетС = Дата(1,1,1)  Тогда
		Сообщить("Не заполнена дата действия");
		Отказ = Истина;	
	КонецЕсли;  
	
	СтруктураОтбора = Новый Структура("Семья", "");// задаем условия
	МассивСтрок = ЭтотОбъект.ТЧКомиссии.НайтиСтроки(СтруктураОтбора);
	Для Каждого ЭлементМассив Из МассивСтрок Цикл
		ЭтотОбъект.ТЧКомиссии.Удалить(ЭлементМассив); //удаляем строки
	КонецЦикла;
	СтруктураОтбора = Новый Структура("Семья", "");// задаем условия
	МассивСтрок = ЭтотОбъект.ТЧПоследняяМиля.НайтиСтроки(СтруктураОтбора);
	Для Каждого ЭлементМассив Из МассивСтрок Цикл
		ЭтотОбъект.ТЧПоследняяМиля.Удалить(ЭлементМассив); //удаляем строки
	КонецЦикла;
    ЭтотОбъект.ТЧОбъем.Сортировать("ОбъемОт Возр");
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

