
Функция ЕстьОригиналДокумента()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СтатусыДокументов.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |ГДЕ
	               |	СтатусыДокументов.Организация = &Организация
	               |	И СтатусыДокументов.Документ = &Документ";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Документ", объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен Тогда
			Возврат истина;
		Иначе Возврат ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
		
КонецФункции

&НаСервере
Процедура Расш1_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.Организация = ТекущийОбъект.Организация;
	Запись.Документ = ТекущийОбъект.Ссылка;
	Если ПолученОригинал Тогда
		Запись.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
	Иначе
		Запись.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;
	КонецЕсли;
	НаборЗаписей.Записать(1);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	ПолученОригинал = ЕстьОригиналДокумента();

КонецПроцедуры



