&НаСервере
Процедура ПриОткрытииНаСервере()
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_ПолныеСклад") Тогда
		Если РольДоступна("СХК_ПолныеСклад") И НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДата()) Тогда
			ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Истина; 
		    ЭтаФорма.Элементы.ТЧТовары.ТолькоПросмотр = Истина;
		Иначе
			ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Ложь; 
		КонецЕсли;
	Иначе
    	ЭтаФорма.Элементы.ТЧТовары.ТолькоПросмотр = Истина;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
