&НаСервере
Процедура ПриОткрытииНаСервере()
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_ПолныеСклад") Тогда
		
		Если РольДоступна("СХК_ПолныеСклад") И НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДата()) Тогда
			ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Истина; 
		    ЭтаФорма.Элементы.ТЧТовары.ТолькоПросмотр = Истина;
		Иначе
			ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Ложь;
			ЭтаФорма.Элементы.Автор.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе
    	ЭтаФорма.Элементы.ТЧТовары.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.ФормаСписатьБуфер.Видимость = Истина;	
		Элементы.Сторно.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписатьБуферНаСервере()
	Буфер = Справочники.СХК_СкладЯчейки.НайтиПоКоду("000000372");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОстатка, Ячейка = &Ячейка) КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток < 0";
	Запрос.УстановитьПараметр("ДатаОстатка",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ячейка",Буфер);
	
	Рез = Запрос.Выполнить().Выбрать();
	Объект.ТЧТовары.Очистить();
	Пока Рез.Следующий() Цикл
		Т = Объект.ТЧТовары.Добавить();
		Т.Номенклатура = Рез.Номенклатура;
		Т.Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Рез.Серия);
		Т.ТекЯчейка = Буфер;
		Т.НЯчейка = Буфер; 
		Т.Количество = Рез.Количество;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьБуфер(Команда)
	СписатьБуферНаСервере();
КонецПроцедуры
