
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Расш1_БюджетДС 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(Расш1_БюджетДС.Сумма) КАК Сумма
	               |ИЗ
	               |	РегистрСведений.Расш1_БюджетДС КАК Расш1_БюджетДС
	               |ГДЕ
	               |	Расш1_БюджетДС.СтатьяДДС = &СтатьяДДС
	               |	И Расш1_БюджетДС.Регистратор <> &Регистратор
	               |	И Расш1_БюджетДС.ПериодБюджета МЕЖДУ &НачДата И &КонДата";
	Движения.Расш1_БюджетДС.Очистить();
	Движения.Расш1_БюджетДС.Записывать = Истина;
	Для Каждого ТекСтрокаСтатьиДвиженияДС Из СтатьиДвиженияДС Цикл
		    Если ТекСтрокаСтатьиДвиженияДС.СтатьяДДС.ЭтоГруппа Тогда Продолжить; КонецЕсли;
			Движение = Движения.Расш1_БюджетДС.Добавить();
			Движение.Регистратор = Ссылка;
			Движение.ПериодБюджета = Период;
			Движение.СтатьяДДС = ТекСтрокаСтатьиДвиженияДС.СтатьяДДС;
			Движение.Сумма = ТекСтрокаСтатьиДвиженияДС.Сумма;
			Если ТипДокумента = Перечисления.Расш1_ТипыДокументовБюджетаДДС.Замещающий Тогда
				Запрос.УстановитьПараметр("Регистратор", Ссылка);
				ЗАпрос.УстановитьПараметр("СтатьяДДС", ТекСтрокаСтатьиДвиженияДС.СтатьяДДС);
				Запрос.УстановитьПараметр("Начдата", НачалоМесяца(Период));
				Запрос.УстановитьПараметр("КонДата", КонецМесяца(Период));
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Движение = Движения.Расш1_БюджетДС.Добавить();
					Движение.Регистратор = Ссылка;
					Движение.ПериодБюджета = Период;
					Движение.СтатьяДДС = ТекСтрокаСтатьиДвиженияДС.СтатьяДДС;
					Движение.Сумма = -Выборка.Сумма;
				КонецЕсли;
			КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
