&НаСервере
Функция Расш1_ПроверкаСтатуса()
 	Возврат Объект.Статус <> Перечисления.СтатусыПриходныхОрдеров.принят	
КонецФункции

&НаКлиенте
Процедура Расш1_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если  Расш1_ПроверкаСтатуса() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Не забудьте установить статус Принят!",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	
	
КонецПроцедуры


&НаКлиенте
Процедура Расш1_ОтправительПриИзмененииПеред(Элемент)
	ВидимостьКнопкиСерии();
КонецПроцедуры


&НаКлиенте
Процедура Расш1_СкладПриИзмененииПеред(Элемент)
	ВидимостьКнопкиСерии();
КонецПроцедуры


&НаСервере
Процедура ВидимостьКнопкиСерии()
	
	Если Объект.Отправитель = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции") И Объект.Склад = Справочники.Склады.НайтиПоНаименованию("ЦК Цех Комплектации") Тогда
		ЭтаФорма.Элементы.ТоварыУказатьСерии.Видимость = Ложь;
		ЭтаФорма.Элементы.ТоварыСоздатьСерии.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ТоварыУказатьСерии.Видимость = Истина;
		ЭтаФорма.Элементы.ТоварыСоздатьСерии.Видимость = Ложь;
	КонецЕсли;
	
		
КонецПроцедуры


&НаКлиенте
Процедура Расш1_СоздатьСерииПосле(Команда)
	
	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);	
	
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНомен,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура,"");
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйСерия", ЭтаФорма);
	
	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйСерия(Значение, ДопПараметры) Экспорт  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия = ПолучитьСериюПоНомеру(Строка(Значение.Номер),ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);		
	КонецЕсли;
КонецПроцедуры     



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерииИзСписка(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Товары.ТекущиеДанные.Серия = ПолучитьСериюПоНомеру(Значение.Номер,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);		
	КонецЕсли;
	
 	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры     

 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерии(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия = ПолучитьСериюПоНомеру(Значение.Номер,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);		
	КонецЕсли;

КонецПроцедуры     



&НаСервере
Функция ПолучитьВидНоменклатуры(Номенклатура) 
	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Готовая продукция: Батончики") Тогда
		Возврат Номенклатура.ВидНоменклатуры;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	ВидимостьКнопкиСерии();
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ТоварыСерияНачалоВыбораИзСпискаПеред(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);	

	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНомен,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Товары,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерии", ЭтаФорма);

	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры

&НаКлиенте
Процедура Расш1_ТоварыСерияНачалоВыбораВместо(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);	
	
	Если ВидНомен = Ложь Тогда 
		ОткрытьПодборСерий(Элемент.ТекстРедактирования);
	Иначе
		
		ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура", ВидНомен,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерииИзСписка", ЭтаФорма);
		
		ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСписка", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры




