//
//&НаКлиенте
//Процедура Сборка(Команда)
//
//	ПараметрыФормыОстатки = Новый Структура;
//	//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
//	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
//	//Создаем структуру с параметрами, которые передадим во вторую форму
//	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
//	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.СписокОрдеров", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
//
//КонецПроцедуры 
//
&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры


&НаКлиенте
Процедура Приемка(Команда)
	ПараметрыФормыОстатки = Новый Структура;
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ЖурналЗаказыПоставщику", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры


&НаКлиенте
Процедура Выход(Команда)
	ЗавершитьРаботуСистемы(ложь);
КонецПроцедуры

