
&НаСервере
Процедура ЗаполнитьНаСервере() 
	склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");
	
	Для сч = 1 по 18 Цикл
		 
		спр	= Справочники.СХК_СкладЯчейки.СоздатьЭлемент();
		спр.Ряд = ЭтаФорма.Ряд;
		спр.Секция = "A";
		спр.Ячейка = сч;
		спр.ВМестимость = ЭтаФорма.Вместимость;
		Наименование = "Ряд " + Строка(ЭтаФорма.Ряд) + " / " + Строка("A") + " / " + Строка(сч);
		Если Справочники.СХК_СкладЯчейки.НайтиПоНаименованию(Наименование).Пустая() Тогда
			спр.Наименование = Наименование;
			Попытка
				спр.Записать();
			Исключение 
			КонецПопытки;
		КонецЕсли;
//
		спр	= Справочники.СХК_СкладЯчейки.СоздатьЭлемент();
		спр.Ряд = ЭтаФорма.Ряд;
		спр.Секция = "B";
		спр.Ячейка = сч;
		спр.ВМестимость = ЭтаФорма.Вместимость;
		Наименование = "Ряд " + Строка(ЭтаФорма.Ряд) + " / " + Строка("B") + " / " + Строка(сч);
		Если Справочники.СХК_СкладЯчейки.НайтиПоНаименованию(Наименование).Пустая() Тогда
			спр.Наименование = Наименование;
			Попытка
				спр.Записать();
			Исключение 
			КонецПопытки;
		КонецЕсли;     
		
		спр	= Справочники.СХК_СкладЯчейки.СоздатьЭлемент();
		спр.Ряд = ЭтаФорма.Ряд;
		спр.Секция = "C";
		спр.Ячейка = сч;
		спр.ВМестимость = ЭтаФорма.Вместимость;
		Наименование = "Ряд " + Строка(ЭтаФорма.Ряд) + " / " + Строка("C") + " / " + Строка(сч);
		Если Справочники.СХК_СкладЯчейки.НайтиПоНаименованию(Наименование).Пустая() Тогда
			спр.Наименование = Наименование;
			Попытка
				спр.Записать();
			Исключение 
			КонецПопытки;
		КонецЕсли;  
		
		спр	= Справочники.СХК_СкладЯчейки.СоздатьЭлемент();
		спр.Ряд = ЭтаФорма.Ряд;
		спр.Секция = "D";
		спр.Ячейка = сч;
		спр.ВМестимость = ЭтаФорма.Вместимость;
		Наименование = "Ряд " + Строка(ЭтаФорма.Ряд) + " / " + Строка("D") + " / " + Строка(сч);
		Если Справочники.СХК_СкладЯчейки.НайтиПоНаименованию(Наименование).Пустая() Тогда
			спр.Наименование = Наименование;
			Попытка
				спр.Записать();
			Исключение 
			КонецПопытки;
		КонецЕсли;
		
		

	КонецЦикла;
	
		
КонецПроцедуры

Функция ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода) Экспорт

	Штрихкод = Строка(Диапазон) + ПрефиксУзлаШтрихкода + Формат(Код, "ЧЦ=9; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;

КонецФункции 

Функция ПрефиксУзлаШтрихкода() Экспорт
	
	Возврат Формат(Константы.ПрефиксШтрихкодовУзлаРИБ.Получить(),"ЧЦ=1; ЧН=; ЧВН=");
	
КонецФункции

Функция СформироватьШтрихкодEAN13(Код) Экспорт

	ПрефиксУзлаШтрихкода = ПрефиксУзлаШтрихкода();
	
	Возврат ПолучитьШтрихкодПоКоду(Код, Код, ПрефиксУзлаШтрихкода);

КонецФункции
Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции  

&НаСервере
Процедура ЗаполнитьШК()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_СкладЯчейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки"; 
	
	Рез = Запрос.Выполнить().Выбрать();
		Склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");
	Пока Рез.Следующий() Цикл
		спр = Рез.ССылка.ПолучитьОбъект(); 
		спр.ШтрихКод = СформироватьШтрихкодEAN13(спр.Код);
        спр.Склад = Склад;
		Попытка 
			спр.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	
КонецПроцедуры



&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(); 
	ЗаполнитьШК();
КонецПроцедуры
