
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если ЗначениеЗаполнено(СтруктураПараметров.ЗаказПоставщику) Тогда
		ДокументЗаказПоставщику = СтруктураПараметров.ЗаказПоставщику;
		ДатаУПД =  ДокументЗаказПоставщику.Ссылка.ЖелаемаяДатаПоступления;
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.НомерУПД.РедактированиеТекста = Истина;
	АктивироватьПолеНомерУПД();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПолеНомерУПД() 
	ОчиститьПолеНомерУПД(); 
	Элементы.НомерУПД.ОбновитьТекстРедактирования();
	Элементы.НомерУПД.Видимость = Ложь;
	Элементы.НомерУПД.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.НомерУПД; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьПолеНомерУПД()
	НомерУПД = "";
КонецПроцедуры

&НаКлиенте
Процедура Поступление(Команда)
	Ош = ПроверитьПоля();
	Если Ош = Ложь Тогда   
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Значение) Экспорт 
					
КонецПроцедуры




&НаСервере
Функция ПроверитьПоля()
	Если СтрДлина(СокрЛП(НомерУПД)) = 0 Тогда
		Возврат "Заполните номер УПД";
	Иначе
		Если Не ПроверитьУПД(НомерУПД) Тогда
			Возврат "Такой номер уже существует";
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция ПроверитьУПД(Номер)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	               |ГДЕ
	               |	ПриобретениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
	               |	И ПриобретениеТоваровУслуг.ЗаказПоставщику = &ЗаказПоставщику
	               |	И ПриобретениеТоваровУслуг.ПометкаУдаления = Ложь"; 
	Запрос.УстановитьПараметр("ЗаказПоставщику",ДокументЗаказПоставщику.Ссылка);
	Запрос.УстановитьПараметр("НомерВходящегоДокумента",Номер);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() ТОгда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	//СписокЗаказПоставщикуНаСервере();	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("ДатаУПД",ЭтаФорма.ДатаУПД);
	СтуктураВозврат.Вставить("НомерУПД",ЭтаФорма.НомерУПД);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры

