
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СЗ.Параметры.УстановитьЗначениеПараметра("СтатусПромоДокумента",Перечисления.Промо_СтатусПромо.НаСогласование);
	СЗ.Параметры.УстановитьЗначениеПараметра("Пользователь",Пользователи.ТекущийПользователь());
	СЗ.Параметры.УстановитьЗначениеПараметра("ПометкаУдаления",Ложь);
	СЗ.Параметры.УстановитьЗначениеПараметра("Проведен",Истина);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЭтаФорма.Элементы.СЗ.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СЗВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СЗОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
