&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	Объект.Наименование = Строка(ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(Объект.Сотрудник.Наименование));
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НовыйШК(Команда)
	Объект.ШтрихКод = СформироватьШтрихкодEAN13();
КонецПроцедуры

Функция СформироватьШтрихкодEAN13() Экспорт
	
	ПрефиксУзлаШтрихкода = ПрефиксУзлаШтрихкода();
	
	Возврат ПолучитьШтрихкодПоКоду(Объект.Код, Объект.Код, ПрефиксУзлаШтрихкода);
	
КонецФункции

Функция ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода) Экспорт
	
	Штрихкод = Строка(Диапазон) + ПрефиксУзлаШтрихкода + Формат(Код, "ЧЦ=9; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
	
	Возврат Штрихкод;
	
КонецФункции  

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции  

Функция ПрефиксУзлаШтрихкода() Экспорт
	
	Возврат Формат(Константы.ПрефиксШтрихкодовУзлаРИБ.Получить(),"ЧЦ=1; ЧН=; ЧВН=");
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Элементы.Сотрудник.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Наименование.ТолькоПросмотр = Ложь;
	КонецЕсли;
	

	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьШК(Команда)
	
	ТаблДокум = ПечатьШКНаСервере();
	ТаблДокум.Показать("Печать документа");
	
КонецПроцедуры 

&НаСервере
Функция ПечатьШКНаСервере()
	
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум.Очистить();
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");  
	Строка = Макет.ПолучитьОбласть("Строка");
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          112);
	ПараметрыШтрихкода.Вставить("Высота",          75);
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(Объект.ШтрихКод));
	ПараметрыШтрихкода.Вставить("ТипКода",         2); // EAN13
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь );
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    16);
	
	Строка.Рисунки.ШтрихКод.Картинка= МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	Строка.Параметры.ФИО = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(Объект.Сотрудник.Наименование);
	ТаблДокум.АвтоМасштаб = Истина;
	ТаблДокум.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;   
	ТаблДокум.ВысотаСтраницы = "70";
	ТаблДокум.ШиринаСтраницы = "100";
	
	ТаблДокум.Вывести(Строка); 
	ТаблДокум.ВывестиГоризонтальныйРазделительСтраниц();
	
	
	Возврат ТаблДокум;
	
КонецФункции

