
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
	Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьСканШК();
КонецПроцедуры


&НаКлиенте
Процедура АктивироватьСканШК() Экспорт 

	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	ОчиститьСканИнфо(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры             

&НаСервере
Процедура ОчиститьСканИнфо()
	СканШК = ""; 
	ЭтаФорма.Элементы.Информация.Заголовок = "";  
КонецПроцедуры  


&НаСервере
Процедура СканШКИзменениеТекстаРедактированияНаСервере(Текст)

	Номенклатура = Обработки.СХК_МобильныйСкладСырье.ПоискНоменклатурыПоШК(Текст);
	
	Если Не Номенклатура.Пустая() Тогда 
		ИспользоватьСерии = Номенклатура.ВидНоменклатуры.ИспользоватьСерии ;
	Иначе
		Элементы.Информация.Заголовок = "Номенклатура не найдена!";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СканШКИзменениеТекстаРедактированияНаСервере(Текст);
	Если ЭтаФорма.ИспользоватьСерии Тогда
		СтруктураПараметры = Новый Структура; 
		СтруктураПараметры.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
		СтруктураПараметры.Вставить("Склад",Склад());

		ОткрытьФормуВыбор("ФормаВыбораСерии",СтруктураПараметры,"ОбработатьЗакрытиеФормыВыборСерии");
	КонецЕсли;		
		
КонецПроцедуры

&НаСервере
Функция Склад()
	Возврат Справочники.Склады.НайтиПоНаименованию("СМ Склад сырья и материалов");
КонецФункции


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерии(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  

		ЭтотОбъект.СерияНоменклатуры = Значение.СерииНоменклатуры;  
		ЭтотОбъект.Упаковка = Значение.Упаковка; 
		
		ед = ЕдиницаИзмеренияНоменклатуры(ЭтаФорма.Номенклатура,Значение.СерииНоменклатуры);
		
		Если ЗначениеЗаполнено(Значение.Упаковка) Тогда
			Если Значение.Упаковка <> ед.ЕдиницаИзмерения Тогда
				ЭтотОбъект.ДоступныйОстатокЕД = Строка(Значение.ДоступныйОстаток/ед.Числитель) + " упак";// + " " + Строка(ед.ЕдиницаИзмерения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура,СерииНоменклатуры) 
	Возврат Обработки.СХК_МобильныйСкладСырье.ЕдиницаИзмеренияНоменклатуры(Номенклатура,СерииНоменклатуры);
КонецФункции



&НаКлиенте
Процедура ОткрытьФормуВыбор(ИмяФормы,СтруктураПараметры,Оповещение)
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметры,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения(Оповещение, ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма."+ИмяФормы, _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
