

&НаКлиенте
Процедура Расш1_ШтрихкодЭтикеткаПосле(Команда)
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Номенклатура", Объект.Ссылка);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормы,Новый УникальныйИдентификатор);
	
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыШтрихЭтикетка", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.Расш1_РегистрШтрихЭтикетка.ФормаСписка", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

//&НаКлиенте
//Процедура Расш1_ГиперссылкаШтрихкодЭтикеткаОбработкаНавигационнойСсылкиВместо(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	ПараметрыФормы = Новый Структура;
//	
//	ПараметрыФормы.Вставить("Номенклатура", Объект.Ссылка);
//	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормы,Новый УникальныйИдентификатор);
//	
//	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыШтрихЭтикетка", ЭтаФорма);
//	ОткрытьФорму("РегистрСведений.Расш1_РегистрШтрихЭтикетка.ФормаСписка", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
//	
//КонецПроцедуры   
//		
&НаКлиенте
Процедура ОбработатьЗакрытиеФормыШтрихЭтикетка(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СпайкиПосле(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Номенклатура", Объект.Ссылка);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормы,Новый УникальныйИдентификатор);
	
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыШтрихЭтикетка", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.СХК_Спайки.ФормаСписка", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)           
	//zaitsev@syspod.ru #79304
	ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
	НовыйРеквизит = Новый РеквизитФормы("МассаШтБрутто",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,5)));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	НовыйРеквизит = Новый РеквизитФормы("ШтВкоробке",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,5))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("СодержаниеБелка",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,5)));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("СодержаниеУглеводов",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,5)));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("Каллорийность",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));  
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	НовыйРеквизит = Новый РеквизитФормы("СодержаниеЖира",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,5)));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
    НовыйРеквизит = Новый РеквизитФормы("Влажность",Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	ГруппаКонтур = ЭтаФорма.Элементы.Добавить("ГруппаКонтур", Тип("ГруппаФормы"),ЭтаФорма.Элементы.СворачиваемаяГруппаДополнительныеРеквизиты);
	ГруппаКонтур.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("МассаШтБрутто", Тип("ПолеФормы"),ГруппаКонтур);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.Заголовок="Масса Шт Брутто (Номенклатура)";
	НовыйЭлемент.ПутьКДанным = "МассаШтБрутто";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ШтВкоробке", Тип("ПолеФормы"),ГруппаКонтур);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.Заголовок="Шт в коробке (Номенклатура)";
	НовыйЭлемент.ПутьКДанным = "ШтВкоробке";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СодержаниеБелка", Тип("ПолеФормы"),ГруппаКонтур);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок="Содержание белка, не менее";
	НовыйЭлемент.ПутьКДанным = "СодержаниеБелка";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СодержаниеУглеводов", Тип("ПолеФормы"),ГруппаКонтур);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.Заголовок="Содержание углеводов, не менее";
	НовыйЭлемент.ПутьКДанным = "СодержаниеУглеводов";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Каллорийность", Тип("ПолеФормы"),ГруппаКонтур);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.Заголовок="Каллорийность/Энер.ценность";
	НовыйЭлемент.ПутьКДанным = "Каллорийность";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СодержаниеЖира", Тип("ПолеФормы"),ГруппаКонтур);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок="Содержание жира, не менее";
	НовыйЭлемент.ПутьКДанным = "СодержаниеЖира";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Влажность", Тип("ПолеФормы"),ГруппаКонтур);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.Заголовок="Влажность не более, %";
	НовыйЭлемент.ПутьКДанным = "Влажность";    
	Элементы.Влажность.РежимВыбораИзСписка = Истина;
	 Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
        |ГДЕ
        |    ЗначенияСвойствОбъектов.Владелец.Имя = ""ВлажностьНеБолее""
        |    И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ";
    
    Элементы.Влажность.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение КАК Значение,
		|	ДополнительныеСведения.Свойство.Наименование КАК СвойствоНаименование
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект
		|	И (ДополнительныеСведения.Свойство.Наименование = &Свойство1
		|			ИЛИ ДополнительныеСведения.Свойство.Наименование = &Свойство2
		|			ИЛИ ДополнительныеСведения.Свойство.Наименование = &Свойство3
		|			ИЛИ ДополнительныеСведения.Свойство.Наименование = &Свойство4
		|			ИЛИ ДополнительныеСведения.Свойство.Наименование = &Свойство5
		|			ИЛИ ДополнительныеСведения.Свойство.Наименование = &Свойство6
		|			ИЛИ ДополнительныеСведения.Свойство.Наименование = &Свойство7)";
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.УстановитьПараметр("Свойство1", "Масса Шт Брутто (Номенклатура)");  
	Запрос.УстановитьПараметр("Свойство2", "Шт в коробке (Номенклатура)");
	Запрос.УстановитьПараметр("Свойство3", "Содержание белка, не менее");
	Запрос.УстановитьПараметр("Свойство4", "Содержание углеводов, не менее");
	Запрос.УстановитьПараметр("Свойство5", "Каллорийность/Энер.ценность");
	Запрос.УстановитьПараметр("Свойство6", "Содержание жира, не менее");
	Запрос.УстановитьПараметр("Свойство7", "Влажность не более, %");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.СвойствоНаименование="Масса Шт Брутто (Номенклатура)" Тогда   
			ЭтаФорма.МассаШтБрутто=ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.СвойствоНаименование="Шт в коробке (Номенклатура)" Тогда  
			 ЭтаФорма.ШтВкоробке=ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.СвойствоНаименование="Содержание белка, не менее" Тогда 
			ЭтаФорма.СодержаниеБелка=ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.СвойствоНаименование="Содержание углеводов, не менее" Тогда
			ЭтаФорма.СодержаниеУглеводов=ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.СвойствоНаименование="Каллорийность/Энер.ценность" Тогда  
			ЭтаФорма.Каллорийность=ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.СвойствоНаименование="Содержание жира, не менее" Тогда  
			ЭтаФорма.СодержаниеЖира=ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
		Если  ВыборкаДетальныеЗаписи.СвойствоНаименование="Влажность не более, %" Тогда     
			ЭтаФорма.Влажность=ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли;
	КонецЦикла;
	//zaitsev@syspod.ru #79304


	КонецПроцедуры

&НаСервере
Процедура Расш1_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	//zaitsev@syspod.ru #79304
	Если ЗначениеЗаполнено(ЭтаФорма.МассаШтБрутто) Тогда
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи(); 
		Запись.Объект = Объект.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Масса Шт Брутто (Номенклатура)"); 
		Запись.Значение=ЭтаФорма.МассаШтБрутто;
		Запись.Записать(); 
	КонецЕсли;   
	Если ЗначениеЗаполнено(ЭтаФорма.ШтВкоробке) Тогда
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи(); 
		Запись.Объект = Объект.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Шт в коробке (Номенклатура)"); 
		Запись.Значение=ЭтаФорма.ШтВкоробке;
		Запись.Записать(); 
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтаФорма.СодержаниеБелка) Тогда
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи(); 
		Запись.Объект = Объект.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Содержание белка, не менее"); 
		Запись.Значение=ЭтаФорма.СодержаниеБелка;
		Запись.Записать(); 
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтаФорма.СодержаниеУглеводов) Тогда
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи(); 
		Запись.Объект = Объект.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Содержание углеводов, не менее"); 
		Запись.Значение=ЭтаФорма.СодержаниеУглеводов;
		Запись.Записать(); 
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтаФорма.Каллорийность) Тогда
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи(); 
		Запись.Объект = Объект.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Каллорийность/Энер.ценность"); 
		Запись.Значение=ЭтаФорма.Каллорийность;
		Запись.Записать(); 
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтаФорма.СодержаниеЖира) Тогда
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи(); 
		Запись.Объект = Объект.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Содержание жира, не менее"); 
		Запись.Значение=ЭтаФорма.СодержаниеЖира;
		Запись.Записать(); 
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтаФорма.Влажность) Тогда
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи(); 
		Запись.Объект = Объект.Ссылка;
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Влажность не более, %"); 
		Запись.Значение=ЭтаФорма.Влажность;
		Запись.Записать(); 
	КонецЕсли;
    //zaitsev@syspod.ru #79304
	КонецПроцедуры




