
&НаСервере
Процедура ПередЗаписьюНаСервере()
	Запись.Автор = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ПередЗаписьюНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
КонецПроцедуры




&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если НачалоДня(Запись.Период) < НачалоДня(ТекущаяДата()) ИЛИ Запись.Количество <> 0 Тогда
		ЭтаФорма.Доступность = Ложь;
	Иначе
		Запись.Период = ТекущаяДата()+86400;	
	КонецЕслИ;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	Если НачалоДня(Запись.Период)+86400 <= НачалоДня(ТекущаяДата())+86400 Тогда
		Запись.Период = ТекущаяДата()+86400;
	ИначеЕсли Запись.Период > НачалоДня(ТекущаяДата()) + 86400*3 Тогда
		Запись.Период = НачалоДня(ТекущаяДата()) + 86400*3;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриПовторномОткрытииНаСервере()
	ЭтаФорма.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриПовторномОткрытииНаСервере();
КонецПроцедуры



