&НаСервере
Функция Расш1_ПроверкаСтатуса()
 	Возврат Объект.Статус <> Перечисления.СтатусыРасходныхОрдеров.Отгружен
КонецФункции

&НаКлиенте
Процедура Расш1_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если  Расш1_ПроверкаСтатуса() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Не забудьте установить статус Отгружен!",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт	
КонецПроцедуры


&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
	
КонецПроцедуры 

&НаСервере
Процедура ДоступностьРеквизитов()
	
	ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	
	ГруппаСклад = Справочники.ГруппыПользователей.НайтиПоНаименованию("Отдел складского учета"); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь",ТекПользователь);
	Строка = ГруппаСклад.Состав.НайтиСтроки(Отбор);                               
	Если Строка.Количество()>=1 И ТИПЗнч(Объект.Получатель) = ТИП("СправочникСсылка.Партнеры") Тогда  
		//ЭтаФорма.Элементы.Статус.Доступность = Ложь;
		ЭтаФорма.Элементы.ОтгружаемыеТоварыДействие.ТолькоПросмотр = Истина; 
	ИначеЕсли Строка.Количество()>=1 И Объект.Получатель = Справочники.Склады.НайтиПоНаименованию("Склад списания") Тогда  
		ЭтаФорма.Элементы.Статус.Доступность = Ложь;
	КонецЕсли; 
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_ПолныеСклад") Тогда

	Иначе 
		//Если ТИПЗнч(Объект.Получатель) = ТИП("СправочникСсылка.Партнеры") Тогда
		//	ЭтаФорма.Элементы.ТоварыПоРаспоряжениямСерия.ТолькоПросмотр = Истина;
		//	ЭтаФорма.Элементы.ОтгружаемыеТоварыСерия.ТолькоПросмотр = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПеред(Отказ)
	ДоступностьРеквизитов();
КонецПроцедуры



