
//&Вместо("ТекстЗапросаРеквизитыСчетовФактурПостановление981КнигаПродаж")
//Функция Расш1_ТекстЗапросаРеквизитыСчетовФактурПостановление981КнигаПродаж()
//	
//		
//	// Счета-фактуры выданные, составленные от имени продавца, возникают у комиссионера, в книге не отражаются.
//	// Т.к. у счетов-фактур, составленных от имени продавца, и выданных комитенту на вознаграждение один и тот же 
//	// документ - основание (отчет комитенту), то необходимо отбирать только счета-фактуры на вознаграждение, 
//	// чтобы не задвоились записи при соединении регистра НДС и списка документов.
//	//
//	// Счета-фактуры полученные, составленные от имени продавца, отражаются в базе комитента и
//	// на основании их комитент принимает НДС к вычету, поэтому для счетов-фактур полученных отбор по
//	// флагу "Составлен от имени продавца" не должен выполняться.
//	// 
//	// Счета-фактуры (полученные и выданные) на аванс в базе комиссионера, составленные от имени продавца, 
//	// не формируют движения по регистрам НДС, поэтому задвоение данных при соединении регистров с ними не возникает.
//	
//	// Для списка счетов-фактур получаем данные документов-оснований.
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура
//	|ПОМЕСТИТЬ СписокДокументовОснований
//	|ИЗ
//	|	ЗаписиКнигиПродаж
//	|ГДЕ
//	|	НЕ ЗаписиКнигиПродаж.СчетФактура ЕСТЬ NULL
//	|	И ЗаписиКнигиПродаж.СчетФактура <> НЕОПРЕДЕЛЕНО
//	|
//	|ОБЪЕДИНИТЬ 
//	|
//	|ВЫБРАТЬ
//	|	ЗаписиКнигиПродаж.ДокументОплаты
//	|ИЗ
//	|	ЗаписиКнигиПродаж
//	|ГДЕ
//	|	НЕ ЗаписиКнигиПродаж.ДокументОплаты ЕСТЬ NULL
//	|	И ЗаписиКнигиПродаж.ДокументОплаты <> НЕОПРЕДЕЛЕНО
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	СчетФактура
//	|;
//	|
//	|ВЫБРАТЬ
//	|	Операция.Ссылка КАК СчетФактура,
//	|	МИНИМУМ(ЖурналУчетаСчетовФактур.НомерСтроки) КАК НомерСтроки
//	|ПОМЕСТИТЬ вт_НомераСтрокПромежуточная
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК Операция
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
//	|		ПО Строки.Ссылка = Операция.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|		ПО Строки.ДокументОснование = СписокДокументовОснований.СчетФактура
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК Возврат
//	|		ПО Строки.ДокументОснование = Возврат.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
//	|		ПО ЖурналУчетаСчетовФактур.СчетФактура = Операция.Ссылка
//	|			И ЖурналУчетаСчетовФактур.ЧастьЖурнала = ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры)
//	|ГДЕ
//	|	Операция.Проведен
//	|	И НЕ Операция.Перевыставленный
//	|	И Возврат.Организация В (&Организация)
//	|	И НЕ Операция.Исправление
//	|	И Возврат.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|СГРУППИРОВАТЬ ПО
//	|	Операция.Ссылка
//	|ИНДЕКСИРОВАТЬ ПО
//	|	СчетФактура
//	|;
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Операция.Организация КАК Организация,
//	|	Строки.ДокументОснование КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL КАК Контрагент,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|
//	|ПОМЕСТИТЬ ВТ_СчетаФактурыПромежуточная
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК Операция
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
//	|	ПО Строки.Ссылка = Операция.Ссылка
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|	ПО Строки.ДокументОснование = СписокДокументовОснований.СчетФактура
//	|ГДЕ
//	|	Операция.Проведен
//	|	И НЕ Операция.Перевыставленный
//	|	И Операция.Организация В (&Организация)
//	|	И НЕ Операция.Исправление
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL КАК Контрагент,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК Операция
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
//	|	ПО Строки.Ссылка = Операция.Ссылка
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|	ПО Операция.Ссылка = СписокДокументовОснований.СчетФактура
//	|ГДЕ
//	|	Операция.Проведен
//	|	И НЕ Операция.Перевыставленный
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
//	|	ИСТИНА КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ИСТИНА КАК СводнаяСправка
//	|
//	|ИЗ
//	|	Документ.СводнаяСправкаНДС КАК Операция
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|	ПО Операция.Ссылка = СписокДокументовОснований.СчетФактура
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL КАК Контрагент,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|
//	|ИЗ
//	|	Документ.СчетФактураПолученныйНалоговыйАгент КАК Операция
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|	ПО Операция.Ссылка = СписокДокументовОснований.СчетФактура
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|	И НЕ Операция.Исправление
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL КАК Контрагент,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	Документ.СчетФактураПолученныйНалоговыйАгент КАК Операция
//	|
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|	ПО Операция.Ссылка = СписокДокументовОснований.СчетФактура
//	|
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|	И Операция.Исправление
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	// +СБ. Кузькин Е.А. 2021-07-23 Вывод номера счет фактуры комиссионера
//	|ВЫБОР
//	|	КОГДА ТаблицаПокупатели.НомерСчетаФактурыРасширенный <> """"
//	|		ТОГДА ТаблицаПокупатели.НомерСчетаФактурыРасширенный
//	|	ИНАЧЕ Операция.Номер
//	|КОНЕЦ КАК НомерСчетаФактуры,
//	// -СБ. Кузькин Е.А.
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	ТаблицаПокупатели.Покупатель КАК Контрагент,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	ТаблицаПокупатели.НомерСтроки КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	Операция.Сводный КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураКомиссионеру.Покупатели КАК ТаблицаПокупатели
//	|	ПО СписокДокументовОснований.СчетФактура = ТаблицаПокупатели.Ссылка
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	|		Документ.СчетФактураКомиссионеру КАК Операция
//	|	ПО
//	|		ТаблицаПокупатели.Ссылка = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА Операция.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|			ТОГДА Операция.Ссылка
//	|		ИНАЧЕ Операция.ДокументОснование
//	|	КОНЕЦ КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	Строки.СтавкаНДС.ПеречислениеСтавкаНДС КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	Операция.Контрагент КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ИЛИ Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	ВЫБОР
//	|		КОГДА Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ИЛИ Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
//	|			ТОГДА ""26""
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданныйАванс КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.ДокументОснование
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Документ.СчетФактураВыданныйАванс.Авансы КАК Строки
//	|	ПО
//	|		Строки.Ссылка = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|	И НЕ Операция.Исправление
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	Строки.СтавкаНДС.ПеречислениеСтавкаНДС КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	Операция.Контрагент КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ИЛИ Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	ВЫБОР
//	|		КОГДА Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ИЛИ Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
//	|			ТОГДА ""26""
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданныйАванс КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.Ссылка
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Документ.СчетФактураВыданныйАванс.Авансы КАК Строки
//	|	ПО
//	|		Строки.Ссылка = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|	И Операция.Исправление
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА Операция.Исправление
//	|			ТОГДА Операция.Ссылка
//	|		ИНАЧЕ
//	|			Операция.ДокументОснование
//	|	КОНЕЦ КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	Строки.СтавкаНДС.ПеречислениеСтавкаНДС КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	Операция.Контрагент КАК Контрагент,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйАванс КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.ДокументОснование
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Документ.СчетФактураПолученныйАванс.Авансы КАК Строки
//	|	ПО
//	|		Строки.Ссылка = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.ДокументОснование КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	ВЫБОР
//	|		КОГДА Операция.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) ТОГДА
//	|			НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ 
//	|			Операция.Договор 
//	|	КОНЕЦ КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураНалоговыйАгент КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.ДокументОснование
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		Документ.СчетФактураНалоговыйАгент.РасшифровкаСуммы КАК Строки
//	|	ПО
//	|		Строки.Ссылка = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураНаНеподтвержденнуюРеализацию0 КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.Ссылка
//	|
//	|
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|	
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ИСТИНА КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ИСТИНА КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	""26"" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация  КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.НомерДекларации КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.Ссылка
//	|
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация  КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ИСТИНА КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеОВвозеТоваров КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.Ссылка
//	|
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация  КАК Организация,
//	|	Операция.ДокументОснование КАК СчетФактура,
//	|	Операция.НомерВходящегоДокумента КАК НомерСчетаФактуры,
//	|	Операция.ДатаВходящегоДокумента КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнойДокументПодтвержденияНДС КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.ДокументОснование
//	|
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Передача.ОрганизацияПолучатель КАК Организация,
//	|	Строки.ДокументОснование КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	2 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК Операция
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
//	|		ПО Строки.Ссылка = Операция.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|		ПО Строки.ДокументОснование = СписокДокументовОснований.СчетФактура
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
//	|		ПО Строки.ДокументОснование = Передача.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И НЕ Передача.РасчетыЧерезОтдельногоКонтрагента
//	|	И Передача.ОрганизацияПолучатель В (&Организация)
//	|	И НЕ Операция.Исправление
//	|	И Передача.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Передача.ОрганизацияПолучатель КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	2 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК Операция
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
//	|		ПО Строки.Ссылка = Операция.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|		ПО Строки.ДокументОснование = СписокДокументовОснований.СчетФактура
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
//	|		ПО Строки.ДокументОснование = Передача.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И НЕ Передача.РасчетыЧерезОтдельногоКонтрагента
//	|	И Передача.ОрганизацияПолучатель В (&Организация)
//	|	И Операция.Исправление
//	|	И Передача.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Возврат.Организация КАК Организация,
//	|	Строки.ДокументОснование КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.Дата КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	Возврат.ОрганизацияПолучатель КАК Контрагент,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	ЕСТЬNULL(НомераСтрок.НомерСтроки, 0) КАК НомерСтроки,
//	|	ИСТИНА КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК Операция
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
//	|		ПО Строки.Ссылка = Операция.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
//	|		ПО Строки.ДокументОснование = СписокДокументовОснований.СчетФактура
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК Возврат
//	|		ПО Строки.ДокументОснование = Возврат.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_НомераСтрокПромежуточная КАК НомераСтрок
//	|		ПО НомераСтрок.СчетФактура = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Возврат.Организация В (&Организация)
//	|	И НЕ Операция.Исправление
//	|	И Возврат.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Основания.ДокументОснование КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	Операция.КодВидаОперацииНаУменьшение КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК Основания
//	|		ПО СписокДокументовОснований.СчетФактура = Основания.ДокументОснование
//	|
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК Операция
//	|		ПО Основания.Ссылка = Операция.Ссылка
//	|
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|	И ТИПЗНАЧЕНИЯ(Основания.ДокументОснование) <> ТИП(Документ.КорректировкаРеализации)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	Операция.Номер КАК НомерСчетаФактуры,
//	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	Операция.КодВидаОперацииНаУменьшение КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК Основания
//	|		ПО СписокДокументовОснований.СчетФактура = Основания.Ссылка
//	|
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК Операция
//	|		ПО Основания.Ссылка = Операция.Ссылка
//	|
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|	И ТИПЗНАЧЕНИЯ(Основания.ДокументОснование) <> ТИП(Документ.КорректировкаРеализации)
//	|	И Операция.Исправление
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Операция.Организация КАК Организация,
//	|	Операция.Ссылка КАК СчетФактура,
//	|	ВЫБОР 
//	|		КОГДА Операция.ПредъявленСчетФактура 
//	|				И Операция.ДатаПолучения <> ДАТАВРЕМЯ(1,1,1)
//	|			ТОГДА Операция.НомерСчетаФактуры
//	|		ИНАЧЕ Операция.Номер
//	|	КОНЕЦ КАК НомерСчетаФактуры,
//	|	ВЫБОР 
//	|		КОГДА Операция.ПредъявленСчетФактура 
//	|				И Операция.ДатаПолучения <> ДАТАВРЕМЯ(1,1,1)
//	|			ТОГДА Операция.ДатаСчетаФактуры
//	|		ИНАЧЕ Операция.Дата
//	|	КОНЕЦ КАК ДатаСчетаФактуры,
//	|	Операция.Ссылка КАК СчетФактураДокумент,
//	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
//	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
//	|	NULL,
//	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
//	|	1 КАК НомерСтроки,
//	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
//	|	ЛОЖЬ КАК СводныйКорректировочный,
//	|	ЛОЖЬ КАК СводныйКомиссионный,
//	|	"""" КАК КодВидаОперации,
//	|	ЛОЖЬ КАК СводнаяСправка
//	|ИЗ
//	|	СписокДокументовОснований КАК СписокДокументовОснований
//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаписьКнигиПокупок КАК Операция
//	|	ПО СписокДокументовОснований.СчетФактура = Операция.Ссылка
//	|ГДЕ
//	|	Операция.Проведен
//	|	И Операция.Организация В (&Организация)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	СчетФактура,
//	|	СтавкаНДСАванса,
//	|	ДоговорАванса,
//	|	Контрагент
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
//	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
//	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
//	|	ЗаписиКнигиПродаж.СтавкаНДС_Аванс КАК СтавкаНДСАванса,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.ДатаСчетаФактуры
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.ДатаСчетаФактуры
//	|		ИНАЧЕ ДанныеПервичныхДокументов.Дата
//	|	КОНЕЦ КАК ДатаСчетаФактуры,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.НомерСчетаФактуры
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.НомерСчетаФактуры
//	|		ИНАЧЕ ДанныеПервичныхДокументов.Номер
//	|	КОНЕЦ КАК НомерСчетаФактуры,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.СчетФактураДокумент
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.СчетФактураДокумент
//	|	КОНЕЦ КАК СчетФактураДокумент,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.НомерСтроки
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.НомерСтроки
//	|	КОНЕЦ КАК НомерСтроки,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.СводныйКорректировочный
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.СводныйКорректировочный
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК СводныйКорректировочный,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.СводныйКомиссионный
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.СводныйКомиссионный
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК СводныйКомиссионный,
//	|	ЛОЖЬ КАК НачислениеПоОказаниюУслуг,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.КодВидаОперации
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.КодВидаОперации
//	|		ИНАЧЕ ""26""
//	|	КОНЕЦ КАК КодВидаОперации,
//	|	ВЫБОР
//	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыСчетФактура.СводнаяСправка
//	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
//	|			ТОГДА СФДокументыДокументОплаты.СводнаяСправка
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК СводнаяСправка,
//	|	ЗаписиКнигиПродаж.Организация КАК Организация,
//	|	ЕСТЬNULL(СФДокументыСчетФактура.ЭтоРозничнаяПродажа, СФДокументыДокументОплаты.ЭтоРозничнаяПродажа) КАК ЭтоРозничнаяПродажа,
//	|	ЕСТЬNULL(СФДокументыСчетФактура.ОбрабатыватьНомерДокумента, СФДокументыДокументОплаты.ОбрабатыватьНомерДокумента) КАК ОбрабатыватьНомерДокумента
//	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
//	|ИЗ
//	|	ЗаписиКнигиПродаж КАК ЗаписиКнигиПродаж
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СФДокументыСчетФактура
//	|		ПО ЗаписиКнигиПродаж.СчетФактура = СФДокументыСчетФактура.СчетФактура
//	|			И (ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = ЕСТЬNULL(СФДокументыСчетФактура.Контрагент, ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре))
//	|			И ЗаписиКнигиПродаж.ДоговорАванса = СФДокументыСчетФактура.ДоговорАванса
//	|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = СФДокументыСчетФактура.СтавкаНДСАванса
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СФДокументыДокументОплаты
//	|		ПО ЗаписиКнигиПродаж.ДокументОплаты = СФДокументыДокументОплаты.СчетФактура
//	|			И (ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = ЕСТЬNULL(СФДокументыДокументОплаты.Контрагент, ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре))
//	|			И ЗаписиКнигиПродаж.ДоговорАванса = СФДокументыДокументОплаты.ДоговорАванса
//	|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = СФДокументыДокументОплаты.СтавкаНДСАванса
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
//	|		ПО ЗаписиКнигиПродаж.СчетФактура = ДанныеПервичныхДокументов.Документ
//	|			И ЗаписиКнигиПродаж.Организация = ДанныеПервичныхДокументов.Организация
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	СчетФактураДокумент
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТ_СчетаФактурыПромежуточная
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ СписокДокументовОснований
//	|";
//	
//	// Получаем дополнительную информацию из журнала учета счетов-фактур.
//	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
//	"ВЫБРАТЬ
//	|	ЖурналУчетаСчетовФактур.Регистратор КАК Регистратор,
//	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактура,
//	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры КАК НомерСчетаФактуры,
//	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
//	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировочногоСчетаФактуры,
//	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировочногоСчетаФактуры,
//	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
//	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
//	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
//	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
//	|	ВЫБОР
//	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА """"
//	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
//	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК КППКонтрагента,
//	|	ЖурналУчетаСчетовФактур.НомерСтроки КАК НомерСтроки,
//	|	ЖурналУчетаСчетовФактур.КодВидаОперации КАК КодВидаОперации,
//	|	ВЫБОР
//	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
//	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК ВалютаНаименование,
//	|	ВЫБОР
//	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
//	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.Код
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК ВалютаКод,
//	|	ЖурналУчетаСчетовФактур.Валюта.Наименование КАК ВалютаНаименованиеКраткое,
//	|	ВЫБОР
//	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).Корректировочный
//	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
//	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|				КОНЕЦ
//	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученныйНалоговыйАгент
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученныйНалоговыйАгент).Корректировочный
//	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение + ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
//	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|				КОНЕЦ
//	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный И ЖурналУчетаСчетовФактур.ЧастьЖурнала = ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры)
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).Корректировочный
//	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
//	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|				КОНЕЦ
//	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).Корректировочный
//	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
//	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|				КОНЕЦ
//	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СводнаяСправкаНДС
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СводнаяСправкаНДС).Корректировочная
//	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
//	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|				КОНЕЦ
//	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданныйАванс
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданныйАванс).Корректировочный
//	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
//	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|				КОНЕЦ
//	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученныйАванс
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученныйАванс).Корректировочный
//	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
//	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|				КОНЕЦ
//	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
//	|	КОНЕЦ КАК ВсегоПродажВВалюте,
//	|	ЖурналУчетаСчетовФактур.Посредник КАК ПосредникСсылка,
//	|	ЖурналУчетаСчетовФактур.Валюта КАК Валюта,
//	|	ЖурналУчетаСчетовФактур.Организация КАК Организация
//	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
//	|ИЗ
//	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
//	|ГДЕ
//	|	ЖурналУчетаСчетовФактур.СчетФактура В
//	|			(ВЫБРАТЬ
//	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
//	|			ИЗ
//	|				ВТ_ТаблицаСчетаФактурыДокументы)
//	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	СчетФактура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_РегистрацияСчетовФактур.СчетФактура КАК СчетФактура,
//	|	ВТ_РегистрацияСчетовФактур.Организация КАК Организация,
//	|	СУММА(ВТ_РегистрацияСчетовФактур.ВсегоПродажВВалюте) КАК ВсегоПродажВВалюте
//	|ПОМЕСТИТЬ СуммыПродажПоСчетамФактурам
//	|ИЗ
//	|	ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТ_РегистрацияСчетовФактур.СчетФактура,
//	|	ВТ_РегистрацияСчетовФактур.Организация
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	СчетФактура,
//	|	Организация
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
//	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
//	|	КОНЕЦ КАК ДатаСчетаФактуры,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
//	// +СБ. Кузькин Е.А. 2021-07-23 Вывод номера счет фактуры комиссионера
//	|		ИНАЧЕ ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура) = ТИП(Документ.СчетФактураКомиссионеру) 
//	|				ТОГДА ЕСТЬNULL(ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры)
//	|				ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры)
//	|			  КОНЕЦ
//	|	КОНЕЦ КАК НомерСчетаФактуры,
//	// -СБ. Кузькин Е.А.
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
//	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ДатаИсправления
//	|	КОНЕЦ КАК ДатаИсправления,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА """"
//	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.НомерИсправления
//	|	КОНЕЦ КАК НомерИсправления,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
//	|	КОНЕЦ КАК НомерСчетаФактурыСортировка,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
//	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
//	|				КОНЕЦ
//	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
//	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
//	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
//	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
//	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
//	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
//	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
//	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
//	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
//	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.КодВидаОперации, ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации) КАК КодВидаОперации,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
//	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
//	|	ВЫБОР
//	|		КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL 
//	|			ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.ОбрабатыватьНомерДокумента
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.НачислениеПоОказаниюУслуг КАК НачислениеПоОказаниюУслуг,
//	|	ВТ_РегистрацияСчетовФактур.КППКонтрагента КАК КППКонтрагента,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
//	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка КАК ПосредникСсылка,
//	|	СуммыПродажПоСчетамФактурам.ВсегоПродажВВалюте КАК ВсегоПродажВВалюте,
//	|	ВТ_РегистрацияСчетовФактур.ВалютаКод КАК ВалютаКод,
//	|	ВТ_РегистрацияСчетовФактур.Валюта КАК Валюта,
//	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование КАК ВалютаНаименование,
//	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеКраткое КАК ВалютаНаименованиеКраткое,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СводнаяСправка КАК СводнаяСправка,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.ЭтоРозничнаяПродажа
//	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
//	|ИЗ
//	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
//	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_РегистрацияСчетовФактур.СчетФактура
//	|			И (НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|					И НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
//	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыПродажПоСчетамФактурам КАК СуммыПродажПоСчетамФактурам
//	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = СуммыПродажПоСчетамФактурам.СчетФактура
//	|			И ВТ_ТаблицаСчетаФактурыДокументы.Организация = СуммыПродажПоСчетамФактурам.Организация
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
//	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
//	// +СБ. Кузькин Е.А. 2021-07-23 Вывод номера счет фактуры комиссионера.
//	|		ИНАЧЕ ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура) = ТИП(Документ.СчетФактураКомиссионеру) 
//	|				ТОГДА ЕСТЬNULL(ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры, ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры)
//	|				ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры)
//	|			  КОНЕЦ
//	|	КОНЕЦ,
//	// -СБ. Кузькин Е.А.
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
//	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ДатаИсправления
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА """"
//	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.НомерИсправления
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
//	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
//	|				КОНЕЦ
//	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
//	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
//	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
//	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
//	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
//	|	КОНЕЦ,
//	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры,
//	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры,
//	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки,
//	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки,
//	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.КодВидаОперации, ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации),
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура,
//	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент),
//	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.НачислениеПоОказаниюУслуг,
//	|	ВТ_РегистрацияСчетовФактур.КППКонтрагента,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре,
//	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка,
//	|	СуммыПродажПоСчетамФактурам.ВсегоПродажВВалюте,
//	|	ВТ_РегистрацияСчетовФактур.ВалютаКод,
//	|	ВТ_РегистрацияСчетовФактур.Валюта,
//	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование,
//	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеКраткое,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.СводнаяСправка,
//	|	ВЫБОР
//	|		КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL 
//	|			ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.ОбрабатыватьНомерДокумента
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ,
//	|	ВТ_ТаблицаСчетаФактурыДокументы.ЭтоРозничнаяПродажа
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	СчетФактура,
//	|	ДоговорАванса,
//	|	СтавкаНДСАванса,
//	|	КонтрагентПоСчетуФактуре
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ СуммыПродажПоСчетамФактурам
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТ_РегистрацияСчетовФактур
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТ_ТаблицаСчетаФактурыДокументы
//	|"
//	+ ОбщегоНазначения.РазделительПакетаЗапросов();
//	
//	Возврат ТекстЗапроса;
//	
//КонецФункции
