
&НаСервере
Процедура ВыполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	|	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК Количество,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОбработки) КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток < 0";
	Запрос.УстановитьПараметр("ДатаОбработки",ТекущаяДата());	 
	//Запрос.УстановитьПараметр("Ячейка",Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер"));
	
	Док = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	Док.Записать(РежимЗаписиДокумента.Запись);		 

	ЗапросБуфер = Новый Запрос;
	ЗапросБуфер.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	|	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК Количество,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОбработки,Ячейка =  &Ячейка) КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 0";
	ЗапросБуфер.УстановитьПараметр("ДатаОбработки",ТекущаяДата());	 
	ЗапросБуфер.УстановитьПараметр("Ячейка",Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер"));

	Док = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Товары.Загрузить(ЗапросБуфер.Выполнить().Выгрузить());
	Док.Записать(РежимЗаписиДокумента.Запись);		 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомманду(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
