
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Номер",ЭтаФорма.СерииНоменклатуры);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере() 
	
	Если Строка(ЭтотОбъект.Номенклатура.ВидНоменклатуры.Ссылка.УникальныйИдентификатор()) = "cd5f0400-37d5-11e8-ab89-001e67f91767" ИЛИ  Строка(ЭтотОбъект.Номенклатура.ВидНоменклатуры.Ссылка.УникальныйИдентификатор()) = "82c0513e-e661-11e8-e599-001e67f91767" Тогда 
    	ГоденДо = Дата(1,1,1);
	Иначе
		Если ЭтотОбъект.Календарь = Дата(1,1,1) ИЛИ ДобавитьМесяц(ЭтотОбъект.Календарь,ЭтотОбъект.Номенклатура.СрокГодности) <= ТекущаяДата() Тогда
			ош =  Ложь;  
			Возврат ош;  
		Иначе
	    	ГоденДо = ДобавитьМесяц(ЭтотОбъект.Календарь,ЭтотОбъект.Номенклатура.СрокГодности);
		КонецЕсли;		
	КонецЕсли;		
	
	
	СерияНоменклатуры = ПолучитьСериюПоНомеру(Строка(ЭтаФорма.НомерВходящегоДокумента) +" "+ Строка(ЭтаФорма.Упаковка.Наименование),ЭтотОбъект.Номенклатура,ЭтотОбъект.Календарь);
	
	Если СерияНоменклатуры.Пустая() = Истина Тогда 
		спр = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Иначе
		спр = СерияНоменклатуры.ПолучитьОбъект();
	КонецЕсли;   
	
	спр.ДатаПроизводства = ЭтотОбъект.Календарь;
	спр.ГоденДо = ГоденДо;
	спр.ВидНоменклатуры = ЭтотОбъект.Номенклатура.ВидНоменклатуры; 
	спр.СХК_Упаковка = ЭтотОбъект.Упаковка;
	Если ЭтаФорма.Упаковка.Числитель = 1 Тогда
		спр.Наименование =  ЭтаФорма.НомерВходящегоДокумента;
		спр.Номер =  ЭтаФорма.НомерВходящегоДокумента;   
	Иначе
		спр.Наименование =  Строка(ЭтаФорма.НомерВходящегоДокумента) +" "+ Строка(ЭтаФорма.Упаковка.Наименование);
		спр.Номер =  Строка(ЭтаФорма.НомерВходящегоДокумента) +" "+ Строка(ЭтаФорма.Упаковка.Наименование);   
	КонецЕсли;		
	
	Попытка
		спр.Записать(); 
		ЭтаФорма.СерииНоменклатуры = спр.Ссылка;
		ош =  Истина;
	Исключение
		ош =  Ложь;
	КонецПопытки; 
	
	Возврат ош;
		
КонецФункции

 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура,ДатаПроизводства) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	               |	И СерииНоменклатуры.ДатаПроизводства = &ДатаПроизводства" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ДатаПроизводства",ЭтотОбъект.Календарь);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура Сохранить(Команда)
	Если СохранитьНаСервере() Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Заполните корректно дату срока годности",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.НомерВходящегоДокумента <> "" Тогда
		ЭтотОбъект.НомерВходящегоДокумента = СтруктураПараметров.НомерВходящегоДокумента;//УправлениеКонтактнойИнформациейКлиентСервер.ОставитьТолькоЦифрыВСтроке(СтруктураПараметров.НомерВходящегоДокумента.Номер);
    	ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;	
    	ЭтотОбъект.СерииНоменклатуры = СтруктураПараметров.СерииНоменклатуры;
    	ЭтотОбъект.Упаковка = СтруктураПараметров.Упаковка;
		ЭтотОбъект.Календарь = ТекущаяДата();
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

