
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Номер",ЭтаФорма.СерииНоменклатуры);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере() 
	
	Если ДеньПриИзмененииНаСервере() И МесяцПриИзмененииНаСервере() И ГодПриИзмененииНаСервере() Тогда 
		Если ЭтаФорма.День<10 Тогда
			День = "0"+Строка(ЭтаФорма.День);
		Иначе                                  
			Месяц = Строка(ЭтаФорма.Месяц);
		КонецЕсли;	
		Если ЭтаФорма.Месяц<10 Тогда
			Месяц = "0"+Строка(ЭтаФорма.Месяц);
		Иначе                                  
			Месяц = Строка(ЭтаФорма.Месяц);
		КонецЕсли;	
			
		Попытка 
			ЭтотОбъект.ГоденДо = Дата(Строка(День)+"."+Строка(Месяц)+"."+"20"+Строка(ЭтаФорма.Год) + " 00:00:00");
		Исключение                       
			ЭтотОбъект.ГоденДо = Дата(1,1,1);
		КонецПопытки;
	КонецЕсли;	
			
	
	Если ЭтотОбъект.ГоденДо = Дата(1,1,1) ИЛИ ЭтотОбъект.ГоденДо <= ТекущаяДата() Тогда
		ош =  Ложь;  
		Возврат ош;
	КонецЕсли;		
	
	СерияНоменклатуры = ПолучитьСериюПоНомеру(ЭтаФорма.НомерЗаказаПоставщику,ЭтотОбъект.Номенклатура,ЭтотОбъект.ГоденДо);
	
	Если СерияНоменклатуры.Пустая() = Истина Тогда 
		спр = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Иначе
		спр = СерияНоменклатуры.ПолучитьОбъект();
	КонецЕсли;   
	
	спр.ГоденДо = ЭтотОбъект.ГоденДо;
	спр.ВидНоменклатуры = ЭтотОбъект.Номенклатура.ВидНоменклатуры;
	спр.Наименование =  ЭтаФорма.НомерЗаказаПоставщику;
	спр.Номер =  ЭтаФорма.НомерЗаказаПоставщику;   
	
	Попытка
		спр.Записать(); 
		ЭтаФорма.СерииНоменклатуры = спр.Ссылка;
		ош =  Истина;
	Исключение
		ош =  Ложь;
	КонецПопытки; 
	
	Возврат ош;
		
КонецФункции

 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура,ГоденДо) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	               |	И СерииНоменклатуры.ГоденДо = &ГоденДо" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ГоденДо",ГоденДо);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура Сохранить(Команда)
	Если СохранитьНаСервере() Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Заполните корректно дату срока годности",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.ЗаказПоставщику <> "" Тогда
		ЭтотОбъект.НомерЗаказаПоставщику = УправлениеКонтактнойИнформациейКлиентСервер.ОставитьТолькоЦифрыВСтроке(СтруктураПараметров.ЗаказПоставщику.Номер);
    	ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;	
    	ЭтотОбъект.СерииНоменклатуры = СтруктураПараметров.СерииНоменклатуры;	
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция МесяцПриИзмененииНаСервере()
	Ош = Истина;
	Если ЭтаФОрма.Месяц > 12 ИЛИ ЭтаФОрма.Месяц = 0 Тогда
		Ош = Ложь;
	КонецЕсли;
	
	Возврат Ош;
		
КонецФункции

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	Если Не МесяцПриИзмененииНаСервере() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупрежденияСообщения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Введите корректный месяц",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДеньПриИзмененииНаСервере()
	Ош = Истина;
	Если ЭтаФорма.День > 31 ИЛИ ЭтаФорма.День = 0 Тогда
		Ош = Ложь;
	КонецЕсли;
	
	Возврат Ош;
		
КонецФункции


&НаКлиенте
Процедура ДеньПриИзменении(Элемент)
	
	Если Не ДеньПриИзмененииНаСервере() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупрежденияСообщения",ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Введите корректную дату",5,"Внимание!!!");
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеЗакрытияПредупрежденияСообщения(Значение) Экспорт
	
КонецПроцедуры

&НаСервере
Функция ГодПриИзмененииНаСервере()
	Ош = Истина;
	Если ЭтаФорма.Год = 0 Тогда
		Ош = Ложь;
	КонецЕсли;
	
	Возврат Ош;
		
КонецФункции


&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Если Не ГодПриИзмененииНаСервере() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупрежденияСообщения",ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Введите корректную дату",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

