
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Номер",ЭтаФорма.СерииНоменклатуры);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере()
	Если ЭтотОбъект.ГоденДо = Дата(1,1,1) Тогда
		ош =  Ложь;
	КонецЕсли;		
	
	СерияНоменклатуры = ПолучитьСериюПоНомеру(ЭтаФорма.НомерЗаказаПоставщику,ЭтотОбъект.Номенклатура,ЭтотОбъект.ГоденДо);
	
	Если СерияНоменклатуры.Пустая() = Истина Тогда 
		спр = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Иначе
		спр = СерияНоменклатуры.ПолучитьОбъект();
	КонецЕсли;   
	
	спр.ГоденДо = ЭтотОбъект.ГоденДо;
	спр.ВидНоменклатуры = ЭтотОбъект.Номенклатура.ВидНоменклатуры;
	спр.Наименование =  ЭтаФорма.НомерЗаказаПоставщику;
	спр.Номер =  ЭтаФорма.НомерЗаказаПоставщику;   
	
	Попытка
		спр.Записать(); 
		ЭтаФорма.СерииНоменклатуры = спр.Ссылка;
		ош =  Истина;
	Исключение
		ош =  Ложь;
	КонецПопытки; 
	
	Возврат ош;
		
КонецФункции

 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура,ГоденДо) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	               |	И СерииНоменклатуры.ГоденДо = &ГоденДо" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ГоденДо",ГоденДо);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура Сохранить(Команда)
	Если СохранитьНаСервере() Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Заполните дату срока годности",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение, ДопПараметры) Экспорт
	ЭтаФорма.Закрыть();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.ЗаказПоставщику <> "" Тогда
		ЭтотОбъект.НомерЗаказаПоставщику = УправлениеКонтактнойИнформациейКлиентСервер.ОставитьТолькоЦифрыВСтроке(СтруктураПараметров.ЗаказПоставщику.Номер);
    	ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;	
    	ЭтотОбъект.СерииНоменклатуры = СтруктураПараметров.СерииНоменклатуры;	
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
