
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.Номенклатура <> "" Тогда
    	Список.Параметры.УстановитьЗначениеПараметра("Номенклатура",СтруктураПараметров.Номенклатура);
    	Список.Параметры.УстановитьЗначениеПараметра("Склад",СтруктураПараметров.Склад);
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборНаСервере(Элемент.ТекущиеДанные.Серия,Элемент.ТекущиеДанные.ДоступныйОстаток);
	ЭтаФорма.Закрыть();
КонецПроцедуры   

&НаСервере
Процедура ВыборНаСервере(Серия,ДоступныйОстаток)
	ЭтаФорма.СерииНоменклатуры = Серия;
	ЭтаФорма.ДоступныйОстаток = ДоступныйОстаток;
	ЭтаФорма.Упаковка = Серия.СХК_Упаковка;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("СерииНоменклатуры",ЭтаФорма.СерииНоменклатуры);
	СтуктураВозврат.Вставить("ДоступныйОстаток",ЭтаФорма.ДоступныйОстаток);
	СтуктураВозврат.Вставить("Упаковка",ЭтаФорма.Упаковка);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры


