
&НаСервере
Процедура Расш1_КомандаУстановитСтатусПолученПослеНаСервере(ВыделенныеСтроки)
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Строка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Документ = Строка;
		Запись.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
		НаборЗаписей.Записать(1);

	КонецЦикла;		
КонецПроцедуры


&НаСервере
Процедура Расш1_УстановитьстатусНеПолученПослеНаСервере(ВыделенныеСтроки)
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Строка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Документ = Строка;
		Запись.Статус = Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;
		НаборЗаписей.Записать(1);

	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Расш1_УстановитьстатусНеПолученПосле(Команда)
	ВыделенныеСтроки = Элементы.СписокДокументыПоступления.ВыделенныеСтроки;
	Расш1_УстановитьстатусНеПолученПослеНаСервере(ВыделенныеСтроки);
	Элементы.СписокДокументыПоступления.Обновить();
КонецПроцедуры


&НаСервере
Процедура Расш1_КомандаУстановитСтатусПолученПослеНаСервере1()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура Расш1_КомандаУстановитСтатусПолученПосле(Команда)
	Расш1_КомандаУстановитСтатусПолученПослеНаСервере1();
КонецПроцедуры

