
&НаКлиенте
Процедура ШКпользователяИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ЗаполнитьПользователя(Текст);
	Если Не СотрудникНеЗаполнен() Тогда  
		//Этаформа.Закрыть();
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("Пользователь",Объект.Сотрудник );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыФормаАвторизации", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.Форма", _Параметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		Элементы.Ошибка.Заголовок = "Пользователь не найден";	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыФормаАвторизации(Значение, ДопПараметры) Экспорт 
	ОчиститьСотрудника();					
КонецПроцедуры



&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СотрудникНеЗаполнен() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция СотрудникНеЗаполнен() 
	Возврат Объект.Сотрудник.Пустая();					
КонецФункции

&НаСервере
Процедура ЗаполнитьПользователя(ШК)
	
	Объект.Сотрудник = Обработки.СХК_МобильныйСклад.ПолучитьПользователяПоШК(ШК);

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если НЕ МобильныйКлиент Тогда
		Если ПроверитьРоль() Тогда 
			УстановитьПользователя();
			Если Не СотрудникНеЗаполнен() Тогда  
				Этаформа.Закрыть();
				ПараметрыФормыОстатки = Новый Структура;
				ПараметрыФормыОстатки.Вставить("Пользователь",Объект.Сотрудник );
				АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
				_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыФормаАвторизации", ЭтаФорма);
				ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.Форма", _Параметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			КонецЕсли;
		КонецЕсли;
	#Иначе
		
		АктивироватьПоиск();
		
	#КонецЕсли 
    //ПодключитьОбработчикОжидания("ВремяБлокировки", 10);
КонецПроцедуры

&НаСервере
Функция ПроверитьРоль()
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьПользователя()
	
	Объект.Сотрудник = Пользователи.АвторизованныйПользователь();

КонецПроцедуры

//&НаКлиенте
//Процедура ВремяБлокировки()  
//	ЭтаФорма.Активизировать();
//КонецПроцедуры


&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьЯчейкаСервер(); 
	Элементы.ШКпользователя.ОбновитьТекстРедактирования();
	Элементы.ШКпользователя.Видимость = Ложь;
	Элементы.ШКпользователя.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКпользователя; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьЯчейкаСервер()
	ШКпользователя = "";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКпользователя;
КонецПроцедуры

&НаСервере
Процедура ОчиститьСотрудника()
	Объект.Сотрудник = Справочники.Пользователи.ПустаяСсылка();
КонецПроцедуры



