
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Доступность();
КонецПроцедуры

&НаСервере
Процедура Доступность()
	Если РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.Элементы.ТоварыПоРаспоряжениям.Доступность = Истина;
		ЭтаФорма.Элементы.ТоварыПоРаспоряжениям.ПодчиненныеЭлементы.ТоварыПоРаспоряжениямСобран.Доступность = Истина;
		ЭтаФорма.Элементы.ТоварыПоРаспоряжениям.ИзменятьСоставСтрок = Истина;

		ЭтаФорма.Элементы.ОтгружаемыеТовары.Доступность = Истина;
		ЭтаФорма.Элементы.ОтгружаемыеТовары.ПодчиненныеЭлементы.ТоварыПоРаспоряжениямСобран.Доступность = Истина;
		ЭтаФорма.Элементы.ОтгружаемыеТовары.ИзменятьСоставСтрок = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	Объект.СобранныеТовары.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры
