
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого стр из ЭтотОбъект.НоменклатураПромо Цикл
		Если стр.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка() Тогда
			Если стр.ТекущаяЦена = 0 Тогда
				Сообщить("С не заполненной ценой проведение не возможно ");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	//Если ЭтотОбъект.СтатусПромоДокумента = Перечисления.Промо_СтатусПромо.НаСогласование Тогда
	//	
	//	
	//КонецЕсли;
	//
	//Отбор = Новый Структура("Согласован",Ложь);
	//Строки = ЭтотОбъект.Согласовать.НайтиСтроки(Отбор);
	//Если Строки.Количество() = 0 Тогда
	//	ОтправитьУведомление();
	//КонецЕсли; 
	//
	//Отбор = Новый Структура("НеСогласован",Истина);
	//Строки = ЭтотОбъект.Согласовать.НайтиСтроки(Отбор);
	//Если Строки.Количество() = 0 Тогда
	//	//ОтправитьУведомление();
	//КонецЕсли;
	
КонецПроцедуры


Процедура ОтправитьУведомление()
	Сообщить("111");	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("ВыбратьПромо", Ложь);
	////НайденныеСтроки = ЭтотОбъект.МетодыПромо.НайтиСтроки(ПараметрыОтбора);
	//Для Каждого НСтрока из НайденныеСтроки Цикл
	//	ЭтотОбъект.МетодыПромо.Удалить(НСтрока);
	//КонецЦикла;
	
	//Отбор = Новый Структура("Направление,Область","","");
	//МассивПустыхСтрок = ЭтотОбъект.СХК_География.НайтиСтроки(Отбор);
	//Для Каждого СтрокаМассива из МассивПустыхСтрок Цикл
	//	ЭтотОбъект.СХК_География.Удалить(СтрокаМассива);
	//КонецЦикла;  
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)  
	//ЭтотОбъект.ТипПромо = ОбъектКопирования.ТипПромо; 
	//ЭтотОбъект.СтатусПромоДокумента = Перечисления.Промо_СтатусПромо.Создан;
	//ЭтотОбъект.Согласовать.Очистить();
КонецПроцедуры
