///////////////////////
//////Ткачева Е.В. 19.09.2024   
&НаКлиенте
Процедура Расш1_ПриОткрытииПеред(Отказ)
 Если ЭтаФорма.Объект.Расш1_ДоговорИП = Истина Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Истина;
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Истина; 
		Элементы.Расш1_Подразделение.Видимость = Истина;  
		Элементы.Расш1_Должность.Видимость = Истина;   
		Элементы.Расш1_Оплата.Видимость = Истина;
	ИначеЕсли  
		ЭтаФорма.Объект.Расш1_ДоговорИП = Ложь Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Ложь; 
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Ложь; 
		Элементы.Расш1_Подразделение.Видимость = Ложь;  
		Элементы.Расш1_Должность.Видимость = Ложь;   
		Элементы.Расш1_Оплата.Видимость = Ложь;
КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Расш1_Расш1_ДоговорИППриИзмененииПосле(Элемент)
	Если ЭтаФорма.Объект.Расш1_ДоговорИП = Истина Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Истина;
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Истина; 
		Элементы.Расш1_Подразделение.Видимость = Истина;  
		Элементы.Расш1_Должность.Видимость = Истина;   
		Элементы.Расш1_Оплата.Видимость = Истина;  
		Элементы.Расш1_Адрес.Видимость = Истина;
		Элементы.Расш1_КонтактныеДанные.Видимость = Истина;
	ИначеЕсли  
		ЭтаФорма.Объект.Расш1_ДоговорИП = Ложь Тогда 
		Элементы.Расш1_ДатаНачалаДоговора.Видимость = Ложь;
		Элементы.Расш1_ДатаОкончанияДоговора.Видимость = Ложь; 
		Элементы.Расш1_Подразделение.Видимость = Ложь;  
		Элементы.Расш1_Должность.Видимость = Ложь;   
		Элементы.Расш1_Оплата.Видимость = Ложь;  
		Элементы.Расш1_Адрес.Видимость = Ложь;
		Элементы.Расш1_КонтактныеДанные.Видимость = Ложь;
		КонецЕсли;
	    КонецПроцедуры



	
//////////////