
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если СтруктураПараметров.ЗаказПоставщику <> "" Тогда
		ЭтотОбъект.ДокументЗаказПеремещения = СтруктураПараметров.ДокументЗаказПеремещения;
		ЗаполнитьТабЧасть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть()
	
	Товары.Очистить();
	Товары.Загрузить(ПолучитьДанныеПоЗаказу(ЭтотОбъект.ДокументЗаказПоставщику));
	

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоЗаказу(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	ВложенныйЗапрос.Количество КАК КоличествоУпаковокПринято,
	|	ВложенныйЗапрос.Серия КАК СерииНоменклатуры,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	|			ПриходныйОрдерНаТоварыТовары.Упаковка КАК Упаковка,
	|			ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
	|			ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК Распоряжение,
	|			ПриходныйОрдерНаТоварыТовары.Серия КАК Серия,
	|			ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|		ГДЕ
	|			ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен = ИСТИНА
	|			И ПриходныйОрдерНаТоварыТовары.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|		ПО ЗаказПоставщикуТовары.Ссылка = ВложенныйЗапрос.Распоряжение
	|		И ЗаказПоставщикуТовары.Номенклатура = ВложенныйЗапрос.Номенклатура
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Заказ );
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции
