
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	Если Элемент.ТекущиеДанные.КоличествоУпаковокСобрано > 0 И Элемент.ТекущиеДанные.КоличествоУпаковокСобрано <> Элемент.ТекущиеДанные.КоличествоУпаковок Тогда
		ВывестиВопрос(Элемент.ТекущиеДанные);	
	Иначе
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Элемент.ТекущиеДанные);	 
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ВывестиВопрос(Данные)
	
	//@skip-check undefined-function
	Ответ = Вопрос("Добавить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Добавить позицию?" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);
		СтруктураСтрока.Вставить("СерииНоменклатуры","");
		СтруктураСтрока.Вставить("КоличествоУпаковокСобрано",0);
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
		ОтветРедактирования = Вопрос("Изменить позицию?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Изменить позицию?" // (необ.) заголовок
		//"По данному ордеру все собрано !!!"
		);
		Если ОтветРедактирования = КодВозвратаДиалога.Да Тогда
			ПараметрыФормыОстатки = Новый Структура;
			ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
			СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные );	 
			ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
			АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
			_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
			//@skip-check notify-description-to-server-procedure
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
			ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	ЗаполнитьТабЧасть()	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если СтруктураПараметров.ДокументЗаказПеремещения <> "" Тогда
		ЭтотОбъект.ДокументЗаказПеремещения = СтруктураПараметров.ДокументЗаказПеремещения;
		ЗаполнитьТабЧасть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть()
	
	Товары.Очистить();
	Товары.Загрузить(ПолучитьДанныеПоЗаказу(ЭтотОбъект.ДокументЗаказПеремещения));

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоЗаказу(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
|	ВложенныйЗапрос.Количество КАК КоличествоУпаковокСобрано,
|	ВложенныйЗапрос.Серия КАК СерииНоменклатуры,
|	ВложенныйЗапрос.Ссылка КАК Ссылка
|ИЗ
|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказПоставщикуТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество КАК Количество,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия КАК Серия,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
|		ИЗ
|			Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
|		ГДЕ
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
|			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
|		ПО (ЗаказПоставщикуТовары.Ссылка = ВложенныйЗапрос.Распоряжение)
|			И (ЗаказПоставщикуТовары.Номенклатура = ВложенныйЗапрос.Номенклатура)
|ГДЕ
|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
|
|СГРУППИРОВАТЬ ПО
|	ЗаказПоставщикуТовары.Номенклатура,
|	ВложенныйЗапрос.Серия,
|	ВложенныйЗапрос.Ссылка,
|	ЗаказПоставщикуТовары.Упаковка,
|	ВложенныйЗапрос.Количество";
	Запрос.УстановитьПараметр("Ссылка",Заказ );
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

&НаКлиенте
Процедура Переместить(Команда)
	
	О = ПереместитьПоЗаказу();
	Если О = Ложь Тогда
		ЭтаФорма.Закрыть(); 
	Иначе
		
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Функция ПереместитьПоЗаказу() 
	
	Ош = Ложь;

		/////////////// ПеремещениеТоваров 
	СтруктураП = Новый Структура;
	СтруктураП.Вставить("ЗаполнятьПоОрдеру",Истина);
	СтруктураП.Вставить("Статус",Перечисления.СтатусыПеремещенийТоваров.Принято);
	СтруктураП.Вставить("Дата",ТекущаяДата());
	СтруктураП.Вставить("ИмяДокумента","ПеремещениеТоваров");
	СтруктураП.Вставить("ИмяПоляЗаказ","ЗаказНаПеремещение");
	СтруктураП.Вставить("ИмяРегистраЗаказ","ЗаказыНаПеремещение");
	СтруктураП.Вставить("КлючевыеПоля","Номенклатура, Характеристика, Серия, Назначение, НазначениеОтправителя"); 
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ДокументЗаказПеремещения.Ссылка);
	СтруктураП.Вставить("МассивЗаказов",МассивЗаказов);
	
	РеквизитыШапки = Новый Структура; 
	РеквизитыШапки.Вставить("ВариантПриемкиТоваров",Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным);
	РеквизитыШапки.Вставить("Организация",ДокументЗаказПеремещения.Организация);
	РеквизитыШапки.Вставить("СкладОтправитель",ДокументЗаказПеремещения.СкладОтправитель);
	РеквизитыШапки.Вставить("СкладПолучатель",ДокументЗаказПеремещения.СкладПолучатель);//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
	РеквизитыШапки.Вставить("СпособДоставки",Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
	РеквизитыШапки.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	
	СтруктураП.Вставить("РеквизитыШапки",РеквизитыШапки);
	ДокП = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокП.Заполнить(СтруктураП);
	ДокП.Дата = ТекущаяДата();
	ДокП.Записать(РежимЗаписиДокумента.Запись);
	
	ДокПТ = ДокП.Ссылка.ПолучитьОбъект();
	ДокПТ.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято; 
	
	Попытка 
		ДокПТ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение  
		ДокПТ.Записать(РежимЗаписиДокумента.Запись);
		Ош = Истина;
	КонецПопытки; 
	
		 Возврат Ош;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	АктивироватьПолеСканШК();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПолеСканШК() 
	ОчиститьПолеНомерУПД(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьПолеНомерУПД()
	СканШК = "";
КонецПроцедуры


&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтрокаНоменклатуры = НайтиноменклатуруПоШК(Текст);
	Если ТипЗнч(СтрокаНоменклатуры) = Тип("Структура")  Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтрокаНоменклатуры );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция НайтиноменклатуруПоШК(ШК)
	Ош = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод"; 
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выбрать(); 
	
	Если Рез.Следующий() Тогда  
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",Рез.Номенклатура);
		Отбор.Вставить("КоличествоУпаковокСобрано",0);
		Строки = Товары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Строки[0]);
			Возврат СтруктураСтрока;
		КонецЕсли;
		КонецЕсли;
	
	Возврат Ош;
	
КонецФункции
