Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого стр Из ТоварыПоРаспоряжениям Цикл
		Если стр.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			стр.Собран = Истина;
		Иначе
			//НСтр = ПолучитьНомерСтрокиДокумента(стр.Номенклатура, стр.Серия, стр.Упаковка);
			//Если ТИПЗНЧ(НСтр) = ТИП("Число") Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура", стр.Номенклатура);
				Отбор.Вставить("Серия", стр.Серия);
		    	Отбор.Вставить("ШКУпаковки",стр.ШКУпаковки);
				Строки = СобранныеТовары.НайтиСтроки(Отбор);
				итКол = 0;
				Если Строки.Количество() >= 1 Тогда

					Для сч = 0 По Строки.Количество() - 1 Цикл
						итКол = итКол + Строки[сч].Количество;
						Если итКол = стр.Количество Тогда
							стр.Собран = Истина;
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЦикла;

				КонецЕсли;
			//Иначе
			//	ТоварыПоРаспоряжениям.Удалить(стр);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
	
	Если ПСтроки.Количество() = 0 Тогда 
		Собран = Истина;
	Иначе
		Собран = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры


Функция ПолучитьНомерСтрокиДокумента(Ном,Сер,Уп)
	
	ош = "";
	
	Таб = ДокОснования.Ссылка.ОтгружаемыеТовары.Выгрузить(); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",Ном);
	Отбор.Вставить("Серия",Сер);
	Отбор.Вставить("Упаковка",Уп);
	
	Строки = Таб.НайтиСтроки(Отбор);
	Если Строки.Количество() >= 1 Тогда
		Если Строки[0].Действие <> Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать Тогда
			Возврат Число(Строки[0].НомерСтроки);
		Иначе
			ош = "Эту позицию НЕ ОТГРУЖАТЬ";
		КонецЕсли;
	Иначе
		ош = "Ошибка в документе";
	КонецЕсли;
	
	Возврат ош;
	
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТЧТовары Из СобранныеТовары Цикл
		Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
		Движение.Серия = Строка(ТекСтрокаТЧТовары.Серия);
		Движение.Ячейка = ТекСтрокаТЧТовары.Ячейка;
		Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Собран = Ложь;  
	СобранныеТовары.Очистить(); 
	ТТ = ТоварыПоРаспоряжениям.Выгрузить();
	ТТ.ЗаполнитьЗначения(Ложь, "Собран"); 
	ТоварыПоРаспоряжениям.Загрузить(ТТ);
КонецПроцедуры
