
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого стр Из ТоварыПоРаспоряжениям Цикл
		Если стр.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			стр.Собран = Истина;
		Иначе
			//НСтр = ПолучитьНомерСтрокиДокумента(стр.Номенклатура, стр.Серия, стр.Упаковка);
			//Если ТИПЗНЧ(НСтр) = ТИП("Число") Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура", стр.Номенклатура);
				Отбор.Вставить("Серия", стр.Серия);
		    	Отбор.Вставить("ШКУпаковки",стр.ШКУпаковки);
				Строки = СобранныеТовары.НайтиСтроки(Отбор);
				итКол = 0;
				Если Строки.Количество() >= 1 Тогда

					Для сч = 0 По Строки.Количество() - 1 Цикл
						итКол = итКол + Строки[сч].Количество;
						Если итКол = стр.Количество Тогда
							стр.Собран = Истина;
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЦикла;

				КонецЕсли;
			//Иначе
			//	ТоварыПоРаспоряжениям.Удалить(стр);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = ТоварыПоРаспоряжениям.НайтиСтроки(Отбор);
	
	Если ПСтроки.Количество() = 0 Тогда 
		Собран = Истина;
	Иначе
		Собран = Ложь;
	КонецЕсли;

	ТабПользователей = СобранныеТовары.Выгрузить();
	ТабПользователей.Свернуть("Кладовщик"); 
	Ком = "";
	Для Каждого стр из ТабПользователей Цикл 
		Если ЗначениеЗаполнено(стр.Кладовщик)  Тогда
			Ком = Ком + Строка(стр.Кладовщик) + Символы.ПС ;
		КонецЕсли;
	КонецЦикла;
	Комментарий = Ком ;
	
КонецПроцедуры


Функция ПолучитьНомерСтрокиДокумента(Ном,Сер,Уп)
	
	ош = "";
	
	Таб = ДокОснования.Ссылка.ОтгружаемыеТовары.Выгрузить(); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",Ном);
	Отбор.Вставить("Серия",Сер);
	Отбор.Вставить("Упаковка",Уп);
	
	Строки = Таб.НайтиСтроки(Отбор);
	Если Строки.Количество() >= 1 Тогда
		Если Строки[0].Действие <> Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать Тогда
			Возврат Число(Строки[0].НомерСтроки);
		Иначе
			ош = "Эту позицию НЕ ОТГРУЖАТЬ";
		КонецЕсли;
	Иначе
		ош = "Ошибка в документе";
	КонецЕсли;
	
	Возврат ош;
	
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТЧТовары Из СобранныеТовары Цикл
		Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
		Движение.Серия = Строка(ТекСтрокаТЧТовары.Серия);
		Движение.Ячейка = ТекСтрокаТЧТовары.Ячейка;
		Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Если ПроверитьРО() Тогда 
		Собран = Ложь;  
		СобранныеТовары.Очистить(); 
		ТТ = ТоварыПоРаспоряжениям.Выгрузить();
		ТТ.ЗаполнитьЗначения(Ложь, "Собран"); 
		ТоварыПоРаспоряжениям.Загрузить(ТТ);
		
		РО = ДокОснования.ПолучитьОбъект();
		Если РО.Проведен Тогда
			РО.Статус = Перечисления.СтатусыРасходныхОрдеров.Подготовлен;
			ТабРО = ДокОснования.ОтгружаемыеТовары.Выгрузить();
			ТабРО.ЗаполнитьЗначения(Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать, "Действие"); 
			РО.ОтгружаемыеТовары.Загрузить(ТабРО);
			РО.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ВернутьТоварВБуфер();

	Иначе              
		Сообщить("Распроведите всю цепочку документов !!!");
		Отказ = Истина;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры 

Функция ПроверитьРО()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Расш1_ОтгрузкаФакт.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.Расш1_ОтгрузкаФакт КАК Расш1_ОтгрузкаФакт
					|ГДЕ
					|	Расш1_ОтгрузкаФакт.Проведен = Истина
					|	И Расш1_ОтгрузкаФакт.ПометкаУдаления = Ложь
					|	И Расш1_ОтгрузкаФакт.ТЧОтгрузка.Отгрузка = &Отгрузка
					|	И Расш1_ОтгрузкаФакт.Статус = Значение(Перечисление.Расш1_СтатусОтгрузкаФакт.Отгружен)";
	Запрос.УстановитьПараметр("Отгрузка",ДокОснования.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;	
	КонецЕсли;
	
КонецФункции 

Процедура ВернутьТоварВБуфер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Номенклатура КАК Номенклатура,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Серия КАК Серия,
	               |	СУММА(СХК_СписаниеЯчейкиСобранныеТовары.Количество) КАК Количество,
	               |	&Ячейка КАК Ячейка,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Упаковка КАК Упаковка,&Время КАК Время ,
				   |	СУММА(СХК_СписаниеЯчейкиСобранныеТовары.Количество) /  СХК_СписаниеЯчейкиСобранныеТовары.Упаковка.Числитель КАК КоличествоУпаковок ,
				   |    &Пользователь КАК Пользователь
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки.СобранныеТовары КАК СХК_СписаниеЯчейкиСобранныеТовары
	               |ГДЕ
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Ссылка.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Номенклатура,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Серия,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Ячейка,
	               |	СХК_СписаниеЯчейкиСобранныеТовары.Упаковка"; 
	Запрос.УстановитьПараметр("Ссылка",Ссылка);  
	Запрос.УстановитьПараметр("Пользователь",Пользователи.АвторизованныйПользователь());  
	Запрос.УстановитьПараметр("Время",ТекущаяДата());
	Запрос.УстановитьПараметр("Ячейка",Справочники.СХК_СкладЯчейки.НайтиПоКоду("000000372"));
	
	Док = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Док.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("При проведении возникли ошибки");
	КонецПопытки;
	
КонецПроцедуры


