
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ПериодДата = ТекущаяДата(); 
	//ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ПериодДата;
	//ЭтаФорма.НачатьРедактированиеЭлемента();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",НачалоДня(ЭтотОбъект.ПериодДата));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецДня(ЭтотОбъект.ПериодДата));
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура QRОрдераИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Рез = ПоискОрдерПриИзмененииНаСервере(Текст);
	Если Рез <> Ложь Тогда
		ПараметрыФормыЗаказа = Новый Структура;
		ПараметрыФормыЗаказа.Вставить("Ссылка",Рез);
		//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыЗаказа,Новый УникальныйИдентификатор);
		//Создаем структуру с параметрами, которые передадим во вторую форму
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("Обработка.МобильныйСкладТест.Форма.Ордер", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	Иначе
		Сообщить("Не нашел");
	КонецЕсли;
	
КонецПроцедуры  


&НаСервере
Функция ПоискОрдерПриИзмененииНаСервере(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РасходныйОрдерНаТовары.Номер = &Номер";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ЭтотОбъект.ПериодДата)-30*86400);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ЭтотОбъект.ПериодДата)+10*86400);
	Запрос.УстановитьПараметр("Номер", Номер);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Количество()=1 Тогда
		Пока Рез.Следующий() Цикл
			Ссылка = Рез.Ссылка;
			Прервать;
		КонецЦикла;
	Иначе
		Ссылка = Ложь;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	Рез = ПоискОрдерПриИзмененииНаСервере(Элемент.ТекущиеДанные.Номер);
	Если Рез <> Ложь Тогда
		ПараметрыФормыЗаказа = Новый Структура;
		ПараметрыФормыЗаказа.Вставить("Ссылка",Рез);
		//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыЗаказа,Новый УникальныйИдентификатор);
		//Создаем структуру с параметрами, которые передадим во вторую форму
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("Обработка.МобильныйСкладТест.Форма.Ордер", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	Иначе
		Сообщить("Не нашел");
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	ЭтаФорма.ОбновитьОтображениеДанных();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.QRОрдера.РедактированиеТекста = Истина;
	АктивироватьПоиск();
	ПодключитьОбработчикОжидания("АктивироватьПоиск",5,Истина);
КонецПроцедуры  




&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.QRОрдера.ОбновитьТекстРедактирования();
	Элементы.QRОрдера.Видимость = Ложь;
	Элементы.QRОрдера.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.QRОрдера; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
	ЗаполнитьСписок();
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	QRОрдера = "";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",НачалоДня(ЭтотОбъект.ПериодДата-30*86400));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецДня(ЭтотОбъект.ПериодДата));
	Список.Параметры.УстановитьЗначениеПараметра("Склад",Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции")); 

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()

	ЭтаФорма.Элементы.QRОрдера.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры





