
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check undefined-variable
	ЭтотОбъект.Автор = Пользователи.АвторизованныйПользователь().Ссылка;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Попытка
		Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
		Для Каждого ТекСтрокаТЧТовары Из ТЧТовары Цикл
			Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
			Движение.Серия = ТекСтрокаТЧТовары.Серия;
			Движение.Ячейка = ТекСтрокаТЧТовары.ТекЯчейка;
			Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
		КонецЦикла;
	Исключение  
		Сообщить("Не Списано");
	КонецПопытки;
	
	// регистр СХК_ТоварыНаСкладе Приход
	Попытка
		Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
		Для Каждого ТекСтрокаТЧТовары Из ТЧТовары Цикл
			Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
			Движение.Серия = ТекСтрокаТЧТовары.Серия;
			Движение.Ячейка = ТекСтрокаТЧТовары.НЯчейка;
			Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
		КонецЦикла;
	Исключение
		Сообщить("Не удалось выполнить перемещение");
	КонецПопытки;
	
	
	
КонецПроцедуры


