
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не РольДоступна("ПолныеПрава") Тогда 
	//	ЭтотОбъект.Автор = Пользователи.АвторизованныйПользователь().Ссылка;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Если ЭтотОбъект.Сторно Тогда
		Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
		Для Каждого ТекСтрокаТЧТовары Из ТЧТовары Цикл
			Движение = Движения.СХК_ТоварыНаСкладе.Добавить(); 
			Если ТекСтрокаТЧТовары.Количество > 0 Тогда 
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
				Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.ВНаличии = ТекСтрокаТЧТовары.Количество*(-1);
				
			КонецЕсли;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
			Движение.Серия = ТекСтрокаТЧТовары.Серия;
			Движение.Ячейка = ТекСтрокаТЧТовары.НЯчейка;
		КонецЦикла;
		
	Иначе
		Попытка
			Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
			Для Каждого ТекСтрокаТЧТовары Из ТЧТовары Цикл
				Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
				Движение.Серия = ТекСтрокаТЧТовары.Серия;
				Движение.Ячейка = ТекСтрокаТЧТовары.ТекЯчейка;
				Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
			КонецЦикла;
		Исключение  
			Сообщить("Не Списано");
		КонецПопытки;
		
		// регистр СХК_ТоварыНаСкладе Приход
		Попытка
			Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
			Для Каждого ТекСтрокаТЧТовары Из ТЧТовары Цикл
				Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
				Движение.Серия = ТекСтрокаТЧТовары.Серия;
				Движение.Ячейка = ТекСтрокаТЧТовары.НЯчейка;
				Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
			КонецЦикла;
		Исключение
			Сообщить("Не удалось выполнить перемещение");
		КонецПопытки;
		
	КонецЕсли;
	
	
КонецПроцедуры


