&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если ЗначениеЗаполнено(СтруктураПараметров.ЗаказПоставщику)  Тогда
		ЭтотОбъект.ДокументЗаказПоставщику = СтруктураПараметров.ЗаказПоставщику;
		ЗаполнитьФорму(СтруктураПараметров.СтрокиЗаказПоставщику);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(МасТоваров)
	
	Товары.Очистить();
	
	Для сч=0 по МасТоваров.Количество()-1 Цикл
		строкаТоваров = МасТовары.Добавить();
		СтрокаТоваров.Номенклатура = МасТоваров[сч].Номенклатура;
		СтрокаТоваров.КоличествоУпаковок = МасТоваров[сч].КоличествоУпаковок;
	КонецЦикла;	
	
	//МасТовары.Загрузить(Товары.Выгрузить());
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПриходныйОрдер(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	               |ГДЕ
	               |	ПриходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	               //|	И ПриходныйОрдерНаТовары.Проведен = ЛОЖЬ
	               |	И ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	               |	И ПриходныйОрдерНаТовары.Распоряжение = &Ссылка
	               |	И ПриходныйОрдерНаТовары.НомерВходящегоДокумента = &НомерВходящегоДокумента";
	Запрос.УстановитьПараметр("Ссылка",Заказ.Ссылка );
	Запрос.УстановитьПараметр("НомерВходящегоДокумента",ЭтотОбъект.НомерУПД );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПроверитьУПД() Тогда
		ОткрытьФормуУПД(); 
	Иначе
		ПроверитьСоздатьДокументПО();
		ОбработатьТабЧасть("");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьУПД()

	Если ЗначениеЗаполнено(ЭтаФорма.НомерУПД) И ЗначениеЗаполнено(ЭтаФорма.ДатаУПД) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции



&НаКлиенте
Процедура ОткрытьФормуУПД()
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ДокументЗаказПоставщику);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыФормаУПД", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаУПД", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыФормаУПД(Значение, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда  
		Если Значение.НомерУПД <> 0 Тогда
			ЭтотОбъект.ДатаУПД = Значение.ДатаУПД;  
			ЭтотОбъект.НомерУПД = Значение.НомерУПД; 
			ПроверитьСоздатьДокументПО();
			ОбработатьТабЧасть("");
		Иначе
			ОткрытьФормуВопроса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВопроса()
	Ответ = Вопрос("Ввести номер УПД?",//"Ордер собран",//"Разместить ордер ?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Ввести номер УПД?" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуУПД();
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
 	СтандартнаяОбработка = Ложь;  
	Если Не ПроверитьУПД() Тогда
		ОткрытьФормуУПД(); 
	Иначе
		Если Элемент.ТекущиеДанные.КоличествоПринято > 0 И Элемент.ТекущиеДанные.Принято = Ложь Тогда
			ВывестиВопрос(Элемент.ТекущиеДанные);	
		ИначеЕсли Элемент.ТекущиеДанные.Принято = Истина Тогда
			ВывестиВопросИзменения(Элемент.ТекущиеДанные);	
		Иначе
			ПараметрыФормыОстатки = Новый Структура;
			ПараметрыФормыОстатки.Вставить("ДокументПО",ЭтотОбъект.ДокументПО);
			СтруктураСтрока = Новый Структура("Номенклатура,КоличествоУпаковок,СерияНоменклатуры,КоличествоПринято,Принято,Упаковка,НомерСтрокиДокумента");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Элемент.ТекущиеДанные);	 
			ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
			АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
			_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
			//@skip-check notify-description-to-server-procedure
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
			ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли; 
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте 
Процедура ВывестиВопросИзменения(Данные)

	Ответ = Вопрос("Изменить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Изменить позицию?" // (необ.) заголовок
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументПО",ЭтотОбъект.ДокументПО);
		СтруктураСтрока = Новый Структура("Номенклатура,КоличествоУпаковок,СерияНоменклатуры,КоличествоПринято,Принято,Упаковка,НомерСтрокиДокумента");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);	 
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщикаИзменение", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры



&НаКлиенте 
Процедура ВывестиВопрос(Данные)

	Ответ = Вопрос("Добавить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Добавить позицию?" // (необ.) заголовок
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументПО",ЭтотОбъект.ДокументПО);
		СтруктураСтрока = Новый Структура("Номенклатура,КоличествоУпаковок,СерияНоменклатуры,КоличествоПринято,Принято,Упаковка,НомерСтрокиДокумента");  
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);
		СтруктураСтрока.Вставить("СерияНоменклатуры","");
		//СтруктураСтрока.Вставить("КоличествоПринято",0);
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщикаИзменение(Значение, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(Значение) Тогда 
		//ИзменитьТабЧасть(Значение);
		ПроверитьСоздатьДокументПО();
		ОбработатьТабЧасть("");
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ИзменитьТабЧасть(Структура)
	
	Если ЗначениеЗаполнено(Структура) Тогда  
		
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",Структура.Номенклатура);
			Отбор.Вставить("Принято",Истина);
			Отбор.Вставить("СерияНоменклатуры",Структура.СерииНоменклатуры);
			Строки = Товары.НайтиСтроки(Отбор); 
			Если Строки.Количество()>=1 Тогда
				СтрокаИзм = Строки[0];
			КонецЕсли;
				
			ОтборН = Новый Структура;
			ОтборН.Вставить("Номенклатура",Структура.Номенклатура);
			ОтборН.Вставить("Принято",Ложь);
			СтрокиОтбор = Товары.НайтиСтроки(ОтборН);

			Если СтрокиОтбор.Количество()>=1 Тогда
				СтрокиРод = СтрокиОтбор[0];
			КонецЕсли;
			
			Если Структура.КоличествоУпаковокПринято = 0 Тогда
				СтрокиРод.КоличествоПринято = СтрокиРод.КоличествоПринято - СтрокаИзм.КоличествоПринято;
				Товары.Удалить(СтрокаИзм);
			ИначеЕсли Структура.КоличествоУпаковокПринято > 0 Тогда   
				СтрокиРод.КоличествоПринято = СтрокиРод.КоличествоПринято - СтрокаИзм.КоличествоПринято+Структура.КоличествоУпаковокПринято;
				СтрокаИзм.КоличествоПринято	= Структура.КоличествоУпаковокПринято;
				СтрокаИзм.НомерСтрокиДокумента	= Структура.НомерСтрокиДокумента;
			КонецЕсли;
 
		Товары.Сортировать("Принято Возр");
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(Значение) Тогда 
		//ОбработатьТабЧасть(Значение);
		ПроверитьСоздатьДокументПО();
		ОбработатьТабЧасть("");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоздатьДокументПО() 
	Товары.Очистить();
	Товары.Загрузить(МасТовары.Выгрузить());
	ДокПО = ПолучитьПриходныйОрдер(ЭтотОбъект.ДокументЗаказПоставщику);
	Если ДокПО = Ложь Тогда
		НовыйДокПо = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		НовыйДокПо.Дата = ТекущаяДата();  
		НовыйДокПо.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		НовыйДокПо.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;    
		НовыйДокПо.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад;
		НовыйДокПо.Отправитель = ЭтотОбъект.ДокументЗаказПоставщику.Партнер;
		НовыйДокПо.НомерВходящегоДокумента = ЭтотОбъект.НомерУПД;
		НовыйДокПо.ДатаВходящегоДокумента = ЭтотОбъект.ДатаУПД;
		НовыйДокПо.Распоряжение = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
		НовыйДокПо.Ответственный = Пользователи.АвторизованныйПользователь();
		НовыйДокПо.Записать(РежимЗаписиДокумента.Запись); 
		ЭтотОбъект.ДокументПО = НовыйДокПо.Ссылка;
	Иначе
		ЭтотОбъект.ДокументПО = ДокПО.Ссылка;  
		
		Для Каждого стр из ДокПО.Ссылка.Товары Цикл
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",стр.Номенклатура);
			СЗ.Вставить("КоличествоУпаковокПринято",стр.Количество);
			СЗ.Вставить("СерииНоменклатуры",стр.Серия);   
			СЗ.Вставить("Упаковка",стр.Упаковка);
			СЗ.Вставить("НомерСтрокиДокумента",стр.НомерСтроки);
		    ОбработатьТабЧасть(СЗ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТабЧасть(Структура)
	
	Если ЗначениеЗаполнено(Структура) Тогда  
		Если Структура.КоличествоУпаковокПринято > 0 Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",Структура.Номенклатура);
			Отбор.Вставить("Принято",Ложь);
			
			Строки = Товары.НайтиСтроки(Отбор);
			
			Если Строки.Количество()>=1 Тогда
				Строки[0].КоличествоПринято = Строки[0].КоличествоПринято + Структура.КоличествоУпаковокПринято; 
				Строки[0].КоличествоУпаковок = Строки[0].КоличествоУпаковок - Строки[0].КоличествоПринято; 
				
				Т = Товары.Добавить();
				Т.Номенклатура = Структура.Номенклатура;				
				Т.НомерСтрокиДокумента = Структура.НомерСтрокиДокумента;				
				Т.КоличествоПринято = Структура.КоличествоУпаковокПринято;				
				Т.СерияНоменклатуры = Структура.СерииНоменклатуры;				
				Т.Упаковка = Структура.Упаковка;	
				Т.Принято = Истина;	
				Если Строки[0].КоличествоУпаковок <=0 Тогда				
				//Если Строки[0].КоличествоПринято >= Строки[0].КоличествоУпаковок Тогда 
					Товары.Удалить(Строки[0]);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли; 
		Товары.Сортировать("Принято Возр");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	Ответ = Вопрос("Завершить прием сырья?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Завершить прием сырья?" // (необ.) заголовок
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Ош = ПринятьНаСервере();
		Если Ош = Ложь Тогда
			ЭтаФорма.Закрыть();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
			ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры

&НаСервере
Функция ПринятьНаСервере() 
	
	Ош = Истина;
	
	Таб = ДокументПО.Товары.Выгрузить();  

		Заказ = ЭтотОбъект.ДокументЗаказПоставщику.ПолучитьОбъект();
		ТабЗаказаЗП = Заказ.Товары.Выгрузить();
		
		ТабДокПТУ = Таб.Скопировать();
		ТабДокПТУ.Свернуть("Номенклатура","КоличествоУпаковок");
		Для каждого стрПТУ из ТабДокПТУ Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", стрПТУ.Номенклатура);
			Строки = ТабЗаказаЗП.НайтиСтроки(Отбор);
			Если Строки.Количество()>=1 Тогда
				Если Строки[0].КоличествоУпаковок <> стрПТУ.КоличествоУпаковок Тогда
					Строки[0].КоличествоУпаковок = стрПТУ.КоличествоУпаковок;
					Строки[0].Количество = стрПТУ.КоличествоУпаковок;
					
				СтруктураПересчетаСуммы = Новый Структура;

				Если Строки[0].СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
				Иначе
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Ложь);
					
				КонецЕсли;
					
					
				СтруктураДействий = Новый Структура;  
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));

				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строки[0], СтруктураДействий, Неопределено);
					
				КонецЕсли;
			КонецЕсли;
		конецЦикла;
		
		Попытка 
			Заказ.Товары.Загрузить(ТабЗаказаЗП);
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение   
			Заказ.Записать(РежимЗаписиДокумента.Запись);
			Ош = "При проведении возникла ошибка, проведите в ручную";
		КонецПопытки;
	
	
	ТабЗаказа = ЭтотОбъект.ДокументЗаказПоставщику.Товары.Выгрузить();
	
	Док = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент(); 
	Док.Дата = ТекущаяДата(); 
	Док.ДатаПоступления = ТекущаяДата();
	Док.Партнер = ЭтотОбъект.ДокументЗаказПоставщику.Партнер.Ссылка;
	Док.Контрагент = ЭтотОбъект.ДокументЗаказПоставщику.Контрагент.Ссылка;
	Док.Организация = ЭтотОбъект.ДокументЗаказПоставщику.Организация;
	Док.Договор = ЭтотОбъект.ДокументЗаказПоставщику.Договор;
	Док.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
	Док.ВалютаВзаиморасчетов = ЭтотОбъект.ДокументЗаказПоставщику.Валюта;
	Док.Валюта =  ЭтотОбъект.ДокументЗаказПоставщику.Валюта; 
	Док.ЦенаВключаетНДС = ЭтотОбъект.ДокументЗаказПоставщику.ЦенаВключаетНДС;
	Док.ПоступлениеПоЗаказам = Истина;
	Док.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад; 
	Док.Подразделение = ЭтотОбъект.ДокументЗаказПоставщику.Подразделение;
	Док.Соглашение = ЭтотОбъект.ДокументЗаказПоставщику.Соглашение;
	Док.ХозяйственнаяОперация = ЭтотОбъект.ДокументЗаказПоставщику.ХозяйственнаяОперация;
	Док.ГруппаФинансовогоУчета = ЭтотОбъект.ДокументЗаказПоставщику.ГруппаФинансовогоУчета;
	Док.Автор = Пользователи.АвторизованныйПользователь();
	Док.ЗакупкаПодДеятельность = ЭтотОбъект.ДокументЗаказПоставщику.ЗакупкаПодДеятельность;
	Док.НалогообложениеНДС = ЭтотОбъект.ДокументЗаказПоставщику.НалогообложениеНДС;;
	Док.ВариантПриемкиТоваров   = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;   
	
	Док.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
	Док.НомерВходящегоДокумента = ЭтотОбъект.НомерУПД;
	Док.ДатаВходящегоДокумента = ЭтотОбъект.ДатаУПД; 
	
	
	Для Каждого стр из Таб Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ТабЗаказа.НайтиСтроки(Отбор);
		
		Если Строки.Количество()>=1 Тогда 
		
				Т = Док.Товары.Добавить();  
				Т.кодСтроки = Строки[0].кодСтроки;
				Т.Номенклатура = стр.Номенклатура;
				Т.Упаковка = стр.Упаковка;
				Т.КоличествоУпаковок = стр.КоличествоУпаковок;
				Т.Количество = стр.Количество; 
				Т.Цена = Строки[0].Цена;
				Т.СтавкаНДС = Строки[0].СтавкаНДС;
				Т.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад ;
				Т.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
				Т.ОбъектРасчетов  = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
				Если стр.Серия <> Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
					Т.Серия = стр.Серия;
					Т.СтатусУказанияСерий = 14;
				Иначе
					Т.СтатусУказанияСерий = 0;
				КонецЕсли;  
				
				СтруктураПересчетаСуммы = Новый Структура;
				
				Если Строки[0].СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
				Иначе
					СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
					СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Ложь);
					
				КонецЕсли;
				
				
				СтруктураДействий = Новый Структура;  
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
				СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Т, СтруктураДействий, Неопределено);
					
		Иначе
			Ош = "Товар отсутствует в заказе";
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	Попытка	
		
		
					
		Док.Записать(РежимЗаписиДокумента.Проведение);  
		ДокПо = ДокументПО.ПолучитьОбъект();
		докПо.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
		докПо.Записать(РежимЗаписиДокумента.Проведение);
		Ош = Ложь;
		
	Исключение 
		Док.Записать(РежимЗаписиДокумента.Запись);
		Ош = "При проведении возникла ошибка, проведите в ручную";
	КонецПопытки;		
	
	
	
	Возврат  Ош;
	
КонецФункции 



