
&НаКлиенте
Процедура ВыборУпаковки(Команда)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборУпаковки", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаУпаковки", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборУпаковки(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтотОбъект.Упаковка = Значение.Упаковка;  
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда
		ЭтаФорма.Элементы.КоличествоУпаковокПринято.РедактированиеТекста = Истина;
		АктивироватьКоличествоУпаковокПринято();
	ИначеЕсли ЭтаФорма.СерииНоменклатуры.Пустая() = Ложь Тогда
		АктивироватьКоличествоУпаковокПринято();
	Иначе 
		ЭтаФорма.Элементы.Декорация1.Заголовок = "Создайте серию";
		//ОткрытьФормуСозданииСерии();
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданииСерии()
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ЭтотОбъект.ДокументЗаказПоставщику);
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	ПараметрыФормыОстатки.Вставить("СерииНоменклатуры",ЭтотОбъект.СерииНоменклатуры);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСерии", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтотОбъект.СерииНоменклатуры = ПолучитьСериюПоНомеру(Строка(Значение.Номер),ЭтотОбъект.Номенклатура);  
		ОчиститьКоличествоУпаковокПринято();
		АктивироватьКоличествоУпаковокПринято();
		ЭтаФорма.Элементы.Декорация1.Заголовок = "";
	КонецЕсли;

КонецПроцедуры

 &НаСервере
Процедура ОчиститьКоличествоУпаковокПринято() 
	ЭтотОбъект.КоличествоУпаковокПринято = 0;
КонецПроцедуры
 
	 
 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Наименование = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура АктивироватьКоличествоУпаковокПринято() 
    Элементы.КоличествоУпаковокПринято.Доступность = Истина; 
	Элементы.КоличествоУпаковокПринято.ОбновитьТекстРедактирования();
	Элементы.КоличествоУпаковокПринято.Видимость = Ложь;
	Элементы.КоличествоУпаковокПринято.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоУпаковокПринято; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.ЗаказПоставщику <> "" Тогда
		ЭтотОбъект.ДокументЗаказПоставщику = СтруктураПараметров.ЗаказПоставщику;
		ЗаполнитьФорму(СтруктураПараметров.ЗаказПоставщику,СтруктураПараметров.СтрокаЗаказПоставщику);
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
//	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

&НаСервере
Процедура ЗаполнитьФорму(ДокЗаказа,СтрокаЗаказа)
	
	ЭтотОбъект.Номенклатура = СтрокаЗаказа.Номенклатура;
	Вложение = ПроверитьВложение(СтрокаЗаказа.Номенклатура);
	Если Вложение >=1 Тогда
		ЭтаФОрма.Элементы.ВыборУпаковки.Видимость = Истина;	
	КонецЕсли;
	
	Если СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Ложь Тогда
		Элементы.СоздатьСерииНоменклатуры.Доступность = Ложь;
		ЭтотОбъект.ПараметрыУказанияСерий = Ложь;
	Иначе 
		Элементы.КоличествоУпаковокПринято.Доступность = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Склад",ДокЗаказа.Склад);
		Отбор.Вставить("ПолитикаУчетаСерий",Справочники.ПолитикиУчетаСерий.НайтиПоНаименованию("Учет себестоимости по сериям"));
		Строки = СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		
		Если Строки.Количество()>=1 Тогда
			ЭтотОбъект.ПараметрыУказанияСерий = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	
	ЭтотОбъект.СерииНоменклатуры = СтрокаЗаказа.СерииНоменклатуры;
	//ЭтотОбъект.Упаковка = СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения;
	ЭтотОбъект.КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок;
	ЭтотОбъект.КоличествоУпаковокПринято = СтрокаЗаказа.КоличествоУпаковокПринято;
	
	ДокПО = ПолучитьПриходныйОрдер(ДокЗаказа);
	Если ДокПО = Ложь Тогда
		НовыйДокПо = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		НовыйДокПо.Дата = ТекущаяДата();  
		НовыйДокПо.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		НовыйДокПо.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика;    
		НовыйДокПо.Склад = ДокЗаказа.Склад;
		НовыйДокПо.Отправитель = ДокЗаказа.Партнер;
		НовыйДокПо.НомерВходящегоДокумента = ДокЗаказа.Ссылка.НомерПоДаннымПоставщика;
		НовыйДокПо.ДатаВходящегоДокумента = ДокЗаказа.Ссылка.ДатаПоДаннымПоставщика;
		НовыйДокПо.Распоряжение = ДокЗаказа.Ссылка;
		НовыйДокПо.Записать(РежимЗаписиДокумента.Запись); 
		НовыйДокПо.Ответственный = Пользователи.АвторизованныйПользователь();
		ДокументПО = НовыйДокПо.Ссылка;
	Иначе
		ДокументПО = ДокПО.Ссылка;
		Если СтрокаЗаказа.КоличествоУпаковокПринято > 0 Тогда
			Элементы.Добавить.Видимость = Ложь;
			Элементы.Изменить.Видимость = Истина;
			Если СтрокаЗаказа.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
				Элементы.СоздатьСерииНоменклатуры.Доступность = Ложь; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	 

КонецПроцедуры

Функция ПроверитьВложение(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.Количество();
КонецФункции

Функция ПолучитьВложение(Номенклатура,Наименование)
	Кратность = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	               |	И УпаковкиЕдиницыИзмерения.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Запрос.УстановитьПараметр("Наименование",Наименование); 

	Результат = Запрос.Выполнить().Выбрать();
	
КонецФункции


&НаСервере
Функция ПолучитьПриходныйОрдер(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	               |ГДЕ
	               |	ПриходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	               |	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА
	               |	И ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	               |	И ПриходныйОрдерНаТовары.Распоряжение = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Заказ.Ссылка );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ДобавитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.КоличествоУпаковокПринято = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	ИначеЕсли ЭтотОбъект.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Ош = "Заполните УПАКОВКУ";
	Иначе
		Док = ЭтотОбъект.ДокументПО.ПолучитьОбъект();

		Т = Док.Товары.Добавить();
		Т.Номенклатура = ЭтотОбъект.Номенклатура; 
		Т.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
		Т.Количество = ЭтотОбъект.КоличествоУпаковокПринято * ЭтотОбъект.Упаковка.Числитель;
		Т.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокПринято * ЭтотОбъект.Упаковка.Числитель;
		Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
			Т.СтатусУказанияСерий = 14; 
			Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
		Иначе
			Т.СтатусУказанияСерий = 0;
		КонецЕсли;      
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки;
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции


&НаКлиенте
Процедура Добавить(Команда)
	Ош = ДобавитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры   


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьСтрокуДокумента(Команда)
	Ош = ИзменитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Функция ИзменитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.КоличествоУпаковокПринято = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	Иначе
		Док = ЭтотОбъект.ДокументПО.ПолучитьОбъект();
		
		Таб = Док.Товары.Выгрузить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
		Отбор.Вставить("Серия", ЭтотОбъект.СерииНоменклатуры.Ссылка);
		
		Строки = Таб.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда
			Строки[0].Количество = ЭтотОбъект.КоличествоУпаковокПринято;
			Строки[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокПринято;
		КонецЕсли;
		
		Док.Товары.Очистить();
		Док.Товары.Загрузить(Таб);
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки;
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции

&НаКлиенте
Процедура СоздатьСерииНоменклатуры(Команда)
	ОткрытьФормуСозданииСерии();
	
КонецПроцедуры


