&Вместо("ВывестиСтрокуДереваСпецификаций")
Процедура ВывестиСтрокуДереваСпецификаций_Расш(ТабДокумент, Макет, СтрокаДерева, Уровень, КоличествоПродукции = 1)
	
	Если СтрокаДерева.ВидСтроки = "МатериалыИУслуги"
		ИЛИ СтрокаДерева.ВидСтроки = "ВыходныеИзделия"
		ИЛИ СтрокаДерева.ВидСтроки = "Трудозатраты" Тогда
		//ОбластьМакета = Макет.ПолучитьОбласть("Группа");
		//ОбластьМакета.Параметры.Номенклатура = СтрокаДерева.Номенклатура;
	Иначе
		Если СтрокаДерева.Строки.Количество() = 0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(СтрокаДерева);
			ОбластьМакета.Параметры.НоменклатураКод = СтрокаДерева.Номенклатура.Артикул;
		КонецЕСли;
	КонецЕсли;
	Если СтрокаДерева.Строки.Количество() = 0 Тогда
		ОбластьСтрока = ТабДокумент.Вывести(ОбластьМакета, Уровень);
		//ТабДокумент.Область(ОбластьСтрока.Верх,1+1).Отступ = Уровень - 1;
	КонецЕСли;
	
	Если СтрокаДерева.Строки.Количество() > 0 Тогда
		
		Уровень = Уровень + 1;
		
		Для Каждого Строка Из СтрокаДерева.Строки Цикл
			
			ВывестиСтрокуДереваСпецификаций(ТабДокумент, Макет, Строка, Уровень, Строка.Количество);
			
		КонецЦикла;
		
		Уровень = Уровень - 1;
		
	КонецЕсли;
	
КонецПроцедуры

&Вместо("СформироватьПечатныеФормыДереваСпецификаций")
Функция СформироватьПечатныеФормыДереваСпецификаций_РАсш(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ДеревоСпецификацийЗначение = ПолучитьИзВременногоХранилища(ПараметрыПечати.АдресВХранилище);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДеревоСпецификаций";
	
	Макет = Обработки.ДеревоРесурсныхСпецификаций.ПолучитьМакет("ДеревоСпецификаций");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru = 'Дерево спецификации'");
	ОбластьМакета.Параметры.ДатаСогласования = ДеревоСпецификацийЗначение.Строки[0].Спецификация.НачалоДействия;
	ОбластьМакета.Параметры.НомерСпецификации = "Спецификация № " + ДеревоСпецификацийЗначение.Строки[0].Спецификация.Код;
	ОбластьМакета.Параметры.КодГП = ?(ДеревоСпецификацийЗначение.Строки[0].Номенклатура.Артикул="",ДеревоСпецификацийЗначение.Строки[0].Номенклатура.Код,ДеревоСпецификацийЗначение.Строки[0].Номенклатура.Артикул);
	ОбластьМакета.Параметры.НаименованиеГП = ДеревоСпецификацийЗначение.Строки[0].Номенклатура;
	ОбластьМакета.Параметры.СТО = ДеревоСпецификацийЗначение.Строки[0].Спецификация.Описание;
	
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Уровень = 1;
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	
	Для Каждого Строка Из ДеревоСпецификацийЗначение.Строки Цикл
		
		Количество = Строка.Количество;
		
		ВывестиСтрокуДереваСпецификаций(ТабДокумент, Макет, Строка, Уровень, Количество);
		
	КонецЦикла;
	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ДатаВвода = ДеревоСпецификацийЗначение.Строки[0].Спецификация.НачалоДействия;
	ОбластьМакета.Параметры.ДатаОтмены = ДеревоСпецификацийЗначение.Строки[0].Спецификация.КонецДействия;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции

