
&НаКлиенте
Процедура мСкладВыбор(Элемент, Область, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЯчейки()
	Для сч =1 по 22 Цикл
		A = ТЯчейки.Добавить();
		A.ЯчейкаЯчейка = "A"+сч;
		B = ТЯчейки.Добавить();
		B.ЯчейкаЯчейка = "B"+сч;
		C = ТЯчейки.Добавить();
		C.ЯчейкаЯчейка = "C"+сч;
		D = ТЯчейки.Добавить();
		D.ЯчейкаЯчейка = "D"+сч; 
		П = ТЯчейки.Добавить();
		П.ЯчейкаЯчейка = "П"+сч;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБуферТекДень() 
	Б = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Расш1_ПоступлениеСкладТовары.Номенклатура КАК Номенклатура,
	               |	Расш1_ПоступлениеСкладТовары.Серия КАК Серия,
	               |	Расш1_ПоступлениеСкладТовары.Количество КАК Количество,
	               |	Расш1_ПоступлениеСкладТовары.Ячейка КАК Ячейка,
	               |	Расш1_ПоступлениеСкладТовары.Время КАК Время
	               |ИЗ
	               |	Документ.Расш1_ПоступлениеСклад.Товары КАК Расш1_ПоступлениеСкладТовары
	               |ГДЕ
	               |	Расш1_ПоступлениеСкладТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Расш1_ПоступлениеСкладТовары.Ссылка.Проведен = &Проведен
	               |	И Расш1_ПоступлениеСкладТовары.Ссылка.ПометкаУдаления = &ПометкаУдаления"; 
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	БуферТек.Очистить();
	Для Каждого стр из ТабЗнач Цикл
		Т = БуферТек.Добавить();
		Т.Номенклатура = стр.Номенклатура;
		Т.Серия = стр.Серия;
		Т.Количество = стр.Количество;
		Т.Время = стр.Время;
	КонецЦикла;
	
	
		
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБуфер() 
	Б = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество,
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия
				   //|	СХК_ТоварыНаСкладеОстатки.Ячейка.Ряд КАК ЯчейкаРяд
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка.Наименование = &Ячейка"; 
	Запрос.УстановитьПараметр("Ячейка","Буфер");
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	Буфер.Очистить();
	Для Каждого стр из ТабЗнач Цикл
		Т = Буфер.Добавить();
		Т.Номенклатура = стр.Номенклатура;
		Т.Серия = стр.Серия;
		Т.Количество = стр.Количество;
	КонецЦикла;
	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТЯчейки();
	ЗаполнитьБуфер(); 
	ЗаполнитьБуферТекДень();

	мСклад = ЗаполнитьТЧ(ЭтаФорма.Номенклатура);
	мСкладОформление();	
КонецПроцедуры

&НаСервере 
Процедура мСкладОформление()
	мСклад.АвтоМасштаб = Истина;
	
	
КонецПроцедуры


&НаСервере  
Функция	ЗаполнитьТЧ(НомП)
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум.Очистить();  
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетСклад"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СТРОКА(СХК_ТоварыНаСкладеОстатки.Ячейка.Секция) + СТРОКА(СХК_ТоварыНаСкладеОстатки.Ячейка.Ячейка) КАК ЯчейкаЯчейка,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	|	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	|	СХК_ТоварыНаСкладеОстатки.Ячейка.Ряд КАК ЯчейкаРяд
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки";  
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	
	Ряд1 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд1");
	Ряд2 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд2");
	Ряд3 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд3");
	Ряд4 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд4");
	Ряд5 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд5");
	Ряд6 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд6");
	Ряд7 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд7");
	Ряд8 = Макет.ПолучитьОбласть("ОбластьСтрока|Ряд8");
	Ряд10 = Макет.ПолучитьОбласть("Область1011|Ряд10");
	Ряд11 = Макет.ПолучитьОбласть("Область1011|Ряд11");
	Ряд9 = Макет.ПолучитьОбласть("Область9");


	//Для Каждого стр из Ряд1.Параметры Цикл 
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("ЯчейкаРяд","1"); 
	//	Отбор.Вставить("ЯчейкаЯчейка",стр); 
	//	Строки = ТабЗнач.НайтиСтроки(Отбор); 
	//	Если Строки.Количество() = 1 Тогда
	//		Ряд1.Параметры[стр] = Строки[0].Номенклатура;	
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	
	Для Каждого стр из ТЯчейки Цикл
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","1");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд1.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд1.Параметры[стр.ЯчейкаЯчейка] = Н ;
		КонецЕсли;	
//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","2");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд2.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд2.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","3");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд3.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд3.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	
//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","4");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд4.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд4.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","5");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд5.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд5.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","6");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд6.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд6.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","7");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд7.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд7.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","8");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд8.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) +" / "+ Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд8.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","10");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд10.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;			КонецЦикла;
			Ряд10.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","11");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд11.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+ " / "+Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд11.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	
//
		Отбор = Новый Структура;	
		Отбор.Вставить("ЯчейкаРяд","9");
		Отбор.Вставить("ЯчейкаЯчейка",стр.ЯчейкаЯчейка); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			Ряд9.Параметры[стр.ЯчейкаЯчейка] = Строка(Строки[0].Номенклатура)+ Строка(Строки[0].Серия) + " / "+Строка(Строки[0].ВНаличииОстаток);
		ИначеЕсли Строки.Количество() > 1 Тогда 
			Н = "";
			Для Каждого ном из Строки Цикл
				Н = Строка(Н) + Строка(ном.Номенклатура)+ Строка(ном.Серия)+" / "+ Строка(ном.ВНаличииОстаток) + Символы.ПС;
			КонецЦикла;
			Ряд9.Параметры[стр.ЯчейкаЯчейка] = Н;
		КонецЕсли;	

		

	КонецЦикла;
	
	ТаблДокум.Вывести(Ряд10);
	ТаблДокум.Присоединить(Ряд11);
	
	ТаблДокум.Вывести(Ряд1);

	ТаблДокум.Присоединить(Ряд2);
	ТаблДокум.Присоединить(Ряд3);
	ТаблДокум.Присоединить(Ряд4);
	ТаблДокум.Присоединить(Ряд5);
	ТаблДокум.Присоединить(Ряд6);
	ТаблДокум.Присоединить(Ряд7);
	ТаблДокум.Присоединить(Ряд8);
	ТаблДокум.Вывести(Ряд9);
	
 
	 Для а = 1 по ТаблДокум.ВысотаТаблицы Цикл 
		Для б = 1 по ТаблДокум.ШиринаТаблицы Цикл
			текстЯчейка = ТаблДокум.Область("R"+а+"C"+б).Текст; 
			Если стрДлина(текстЯчейка) > 20 Тогда
				Если ТипЗнч(НомП) = Тип("СправочникСсылка.Номенклатура") И ЭтаФорма.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка() Тогда 
					Если НомП.Наименование = текстЯчейка Тогда
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Синий; 
					ИначеЕсли СтрНайти(текстЯчейка, НомП.Наименование) Тогда 
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Синий;
					Иначе
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Красный;
					КонецЕсли;
				ИначеЕсли ТипЗнч(НомП) = Тип("Массив") Тогда  
					спрН = Справочники.Номенклатура.НайтиПоНаименованию(текстЯчейка).Ссылка;
					Индекс = НомП.Найти(спрН);
					Если Индекс <> Неопределено Тогда
                    	ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Синий;
					ИНаче
						ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Красный;
					КонецЕсли;	
				Иначе
					
					ТаблДокум.Область("R"+а+"C"+б).ЦветФона = WebЦвета.Красный;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	 
	Возврат ТаблДокум;
	
КонецФункции

&НаКлиенте
Процедура Тест(Команда)
	мСклад = ЗаполнитьТЧ(ЭтаФорма.Номенклатура);
	мСкладОформление();	
	ЗаполнитьБуфер();
	ЗаполнитьБуферТекДень();
КонецПроцедуры  




&НаКлиенте
Процедура мСкладПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Сообщить("");
КонецПроцедуры

&НаСервере  
Функция	ЗаполнитьТЗОрдер()
	Док = ЭтаФорма.РасходныйОрдер.ПолучитьОбъект();
	Мас = Док.ОтгружаемыеТовары.ВыгрузитьКолонку("Номенклатура");//Таб.ВыгрузитьКолонку("Фрукт");
	Возврат Мас;
КонецФункции


	
&НаКлиенте
Процедура РасходныйОрдерПриИзменении(Элемент)
	ЭтаФорма.Номенклатура = "";	 
	ТЗ = ЗаполнитьТЗОрдер();
	Если ТЗ.Количество() >= 1 Тогда
		мСклад = ЗаполнитьТЧ(ТЗ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент) 
	ЭтаФорма.РасходныйОрдер =  "";
	мСклад = ЗаполнитьТЧ(ЭтаФорма.Номенклатура);	
КонецПроцедуры
