&НаСервере
Процедура ТоварыВЗаказ()
	М = Новый Массив;

	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таб.Область(1, 1, Таб.ВысотаТаблицы, 10));
	Построитель.Выполнить();
	Результат = Построитель.Результат.Выгрузить();	

	Для Каждого стр из Результат Цикл
		 
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(стр.Номенклатура);
		Серия = Справочники.Номенклатура.НайтиПоНаименованию(стр.Серия);
		Ячейка = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
		Кол = Число(стр.Кол);
				СЗ = Новый Структура; 
				СЗ.Вставить("Номенклатура",Номенклатура);
				СЗ.Вставить("Серия",стр.Серия);
				СЗ.Вставить("Ячейка",Ячейка);
				СЗ.Вставить("Кол",Кол);
            М.Добавить(СЗ);
	КонецЦикла;
	
Д = Объект.Док.ПолучитьОбъект();
Д.Товары.Очистить();
Для сч= 0 по М.Количество()-1 Цикл
	Т = Д.Товары.Добавить();
	Т.Номенклатура = М[сч].Номенклатура;
	Т.Серия = М[сч].Серия;
	Т.Количество = М[сч].Кол;
	Т.Ячейка = М[сч].Ячейка;
	Т.Время = ТекущаяДата();
КонецЦикла; 
Д.Записать();

КонецПроцедуры


&НаКлиенте
Процедура Импорт(Команда)
	ТоварыВЗаказ();
КонецПроцедуры

