
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939 
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	//++shishkin@syspod.ru #87939
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	//++shishkin@syspod.ru #87939
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	//--shishkin@syspod.ru #87939
КонецПроцедуры 

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	//--shishkin@syspod.ru #87939
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	//--shishkin@syspod.ru #87939
КонецПроцедуры
///////////////////////////заполнение фактического количеста по результатам перемещений в день инвентаризации
&НаКлиенте
Процедура Расш1_ЗаполнитьПоТСДПосле(Команда)
	ЗаполнитьПоТСД();
	ОбновитьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличество()
	Для Каждого стр из Объект.Товары Цикл
	ТекущаяСтрока = стр;
	
	СтруктураДействий = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковокФакт(СтруктураДействий);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);			
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоТСД()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
				   |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
				   |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество
				   |ИЗ
				   |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(
				   |			&ДатаОкончания,
				   |			Ячейка <> &Ячейка
				   |				) КАК СХК_ТоварыНаСкладеОстатки
				   |ГДЕ
				   |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 0 ";
	//Запрос.УстановитьПараметр("Дата",Дата("30.01.2026 20:00:00"));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ячейка", Справочники.СХК_СкладЯчейки.НайтиПоКоду("000000372"));

	Рез = Запрос.Выполнить().Выбрать();

	Пока Рез.Следующий() Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Рез.Номенклатура);
		Отбор.Вставить("Серия", Справочники.СерииНоменклатуры.НайтиПоНаименованию(Рез.Серия));

		Строки = Объект.Товары.НайтиСтроки(Отбор);

		Если Строки.Количество() = 1 Тогда
			Строки[0].КоличествоФакт = Рез.Количество;
			Строки[0].КоличествоУпаковокФакт = Рез.Количество;

		ИначеЕсли Строки.Количество() = 0 Тогда
			Т = Объект.Товары.Добавить();
			Т.Количество = 0;
			Т.КоличествоФакт = Рез.Количество;
			Т.КоличествоУпаковок = 0;
			Т.КоличествоУпаковокФакт = Рез.Количество;
			Т.Номенклатура = Рез.Номенклатура;
			Т.Упаковка = Рез.Номенклатура.ЕдиницаИзмерения;
			Т.Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Рез.Серия);
			Т.СтатусУказанияСерий = 10;
			Т.ИзлишекПорча = Ложь;
			Т.ХарактеристикиИспользуются = Ложь;
			Т.ТипНоменклатуры	= Перечисления.ТипыНоменклатуры.Товар;
			Т.Артикул = Рез.Номенклатура.Артикул;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры





