
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Автор = Пользователи.АвторизованныйПользователь();
		Объект.Наименование = "Озон " + Строка(Формат(ТекущаяДата(),"ДЛФ=Д"));
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Функция ЗаполнитьИмпорт()
	
	ТаблДокум = Новый  ТабличныйДокумент;
	ТаблДокум.Очистить(); 
    Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ТаблДокум.Вывести(ОбластьШапка); 
	ТаблДокум.ФиксацияСверху = 1;
	
	Возврат ТаблДокум;
	
КонецФункции


&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница) 
	Если ТекущаяСтраница.Заголовок = "Импорт" Тогда
		ТЧИмпорт = ЗаполнитьИмпорт();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЧИмпорт.Область(1, 1, ТЧИмпорт.ВысотаТаблицы, 3));
	Построитель.Выполнить();
	Результат = Построитель.Результат.Выгрузить();	
	
	Объект.ТЧОбъем.Очистить();
	
	Для Каждого стр из Результат Цикл 
		Если стр.Вес <> "" И стр.Ставка <> "" Тогда 
			Т = Объект.ТЧОбъем.Добавить();
			Т.ОбъемОт = стр.ОбъемОт; 
			Т.ОбъемДо = стр.ОбъемДо;
			Т.Ставка = стр.Ставка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры
