
&Перед("ОбработкаПроверкиЗаполнения")
Процедура Расш1_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)  

	Если СкладыСервер.ИспользоватьСкладскиеПомещения(ЭтотОбъект.Склад,Дата) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СкладскиеПомещения.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.СкладскиеПомещения КАК СкладскиеПомещения
		               |ГДЕ
		               |	СкладскиеПомещения.Владелец = &Владелец"; 
		Запрос.УстановитьПараметр("Владелец",ЭтотОбъект.Склад);
		
		Рез = Запрос.Выполнить().Выгрузить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка",ЭтотОбъект.Помещение.Ссылка); 
		Строки = Рез.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Сообщить("Указано не верное помещение");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	//
	//ГруппаСклад = Справочники.ГруппыПользователей.НайтиПоНаименованию("Отдел складского учета"); 
	//
	//Отбор = Новый Структура;
	//Отбор.Вставить("Пользователь",ТекПользователь);
	//Строка = ГруппаСклад.Состав.НайтиСтроки(Отбор);                               
	//
	//Если Строка.Количество()>=1 И Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен И ТИПЗнч(Получатель) = ТИП("СправочникСсылка.Партнеры") Тогда 
	//	Сообщить("У вас нет прав на изменения статуса !!!");
	//	Отказ = Истина;
	//КонецЕсли; 

	Если Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен И ТИПЗнч(Получатель) = ТИП("СправочникСсылка.Партнеры") Тогда 
		Если СХК_ТСДСклад.ПоискСХКСписание(Ссылка) = Ложь Тогда
			Сообщить("Нет сборки по ТСД");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры 

