
&НаСервере
Процедура ПриОткрытииНаСервере()
	Дата = ТекущаяДата();
	ПолучитьКоличествоНаСервере(Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры   

&НаСервере
Процедура ПолучитьКоличествоНаСервере(Дата)
	ЭтаФорма.Количество = 0;
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	Расш1_ОтгрузкаФакт.Ссылка КАК Ссылка
               |ИЗ
               |	Документ.Расш1_ОтгрузкаФакт КАК Расш1_ОтгрузкаФакт
               |ГДЕ
               |	Расш1_ОтгрузкаФакт.Дата МЕЖДУ &ДатаНачада И &ДатаОкончания
               |	И Расш1_ОтгрузкаФакт.Проведен = &Проведен
               |	И Расш1_ОтгрузкаФакт.ПометкаУдаления = &ПометкаУдаления";  
Запрос.УстановитьПараметр("ДатаНачада",НачалоДня(Дата));
Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Дата));
Запрос.УстановитьПараметр("Проведен",Истина);
Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
Рез = Запрос.Выполнить().Выбрать(); 
к = 0;
Пока Рез.Следующий() Цикл
	Попытка
		Для Каждого стр из Рез.Ссылка.ТЧОрдер Цикл 
			Док = стр.ЗаказКлиента.ПолучитьОбъект();
			к = к + Док.Товары.Итог("КоличествоУпаковок");
		КонецЦикла;
	Исключение
	КонецПопытки;
	
		//к = к + Рез.Ссылка.Товары.Итог("КоличествоУпаковок");
	КонецЦикла;
ЭтаФорма.Количество = к;
	
КонецПроцедуры

&НаКлиенте
Процедура Дата1ПриИзменении(Элемент)
	ПолучитьКоличествоНаСервере(Дата);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Парам = Новый Структура;

	Парам.Вставить("text",Строка("за " + Строка(Формат(Дата,"ДЛФ=Д")) + Строка(" отправлено ")+Строка(Количество) + Строка(" шт")));

	Сервер = "192.168.88.146:8000/bot/";
	Соединение =  Новый HTTPСоединение(Сервер,,,,,90,,);
	
	Заголовки = Новый Соответствие; 
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON();
	ЗаписьJSON.ОткрытьФайл(КаталогВременныхФайлов()+"contr.json", , , ПараметрыЗаписи) ;
	ЗаписатьJSON(ЗаписьJSON, Парам);
	
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Парам);
	СтрJSON = ЗаписьJSON.Закрыть(); 
	
	
	Запрос = Новый HTTPЗапрос("day/",Заголовки);
	Запрос.УстановитьТелоИзСтроки("present="+СтрJSON); 
	
	ФайлРезультата = ПолучитьИмяВременногоФайла();
	Соединение.ОтправитьДляОбработки(Запрос,ФайлРезультата);
	
	ТекстовыйФайлОтвет = Новый ТекстовыйДокумент;
	ТекстовыйФайлОтвет.Прочитать(ФайлРезультата,КодировкаТекста.UTF8);
	СтрокаОтветСервера = ТекстовыйФайлОтвет.ПолучитьТекст(); 

КонецПроцедуры

&НаКлиенте
Процедура Отчет(Команда)
	ОткрытьФорму("Отчет.ОтгрузкаСоСкладаЗаПериод.Форма");
КонецПроцедуры


