
&НаКлиенте
Процедура ТоварыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	Если Элемент.ТекущиеДанные.КоличествоУпаковокПринято > 0 И Элемент.ТекущиеДанные.КоличествоУпаковокПринято <> Элемент.ТекущиеДанные.КоличествоУпаковок Тогда
		ВывестиВопрос(Элемент.ТекущиеДанные);	
	Иначе
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ЭтотОбъект.ДокументЗаказПоставщику);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокПринято,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Элемент.ТекущиеДанные);	 
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ВывестиВопрос(Данные)
	
	//@skip-check undefined-function
	Ответ = Вопрос("Добавить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Добавить позицию?" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ЭтотОбъект.ДокументЗаказПоставщику);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокПринято,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);
		СтруктураСтрока.Вставить("СерииНоменклатуры","");
		СтруктураСтрока.Вставить("КоличествоУпаковокПринято",0);
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ЭтотОбъект.ДокументЗаказПоставщику);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокПринято,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные );	 
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	ЗаполнитьТабЧасть()	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если СтруктураПараметров.ЗаказПоставщику <> "" Тогда
		ЭтотОбъект.ДокументЗаказПоставщику = СтруктураПараметров.ЗаказПоставщику;
		ЗаполнитьТабЧасть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть()
	
	Товары.Очистить();
	Товары.Загрузить(ПолучитьДанныеПоЗаказу(ЭтотОбъект.ДокументЗаказПоставщику));
	

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоЗаказу(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	ВложенныйЗапрос.Количество КАК КоличествоУпаковокПринято,
	|	ВложенныйЗапрос.Серия КАК СерииНоменклатуры,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	|			ПриходныйОрдерНаТоварыТовары.Упаковка КАК Упаковка,
	|			ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
	|			ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК Распоряжение,
	|			ПриходныйОрдерНаТоварыТовары.Серия КАК Серия,
	|			ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|		ГДЕ
	|			ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен = ИСТИНА
	|			И ПриходныйОрдерНаТоварыТовары.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|		ПО ЗаказПоставщикуТовары.Ссылка = ВложенныйЗапрос.Распоряжение
	|		И ЗаказПоставщикуТовары.Номенклатура = ВложенныйЗапрос.Номенклатура
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Заказ );
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

&НаКлиенте
Процедура Принять(Команда)
	Ош = ПринятьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры


&НаСервере
Функция ПринятьНаСервере() 
	
	Ош = Истина;
	
	
	Если Не ПоискДокументаПоступления() Тогда  
		
		
		Таб = ЭтотОбъект.Товары.Выгрузить();
		ТабЗаказа = ЭтотОбъект.ДокументЗаказПоставщику.Товары.Выгрузить();
		Док = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент(); 
		Док.Дата = ТекущаяДата(); 
		Док.ДатаПоступления = ТекущаяДата();
		Док.Партнер = ЭтотОбъект.ДокументЗаказПоставщику.Партнер;
		Док.Контрагент = ЭтотОбъект.ДокументЗаказПоставщику.Контрагент;
		Док.Организация = ЭтотОбъект.ДокументЗаказПоставщику.Организация;
		Док.Договор = ЭтотОбъект.ДокументЗаказПоставщику.Договор;
		Док.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
		Док.ВалютаВзаиморасчетов = ЭтотОбъект.ДокументЗаказПоставщику.Валюта;
		Док.Валюта =  ЭтотОбъект.ДокументЗаказПоставщику.Валюта; 
		Док.ЦенаВключаетНДС = ЭтотОбъект.ДокументЗаказПоставщику.ЦенаВключаетНДС;
		Док.ПоступлениеПоЗаказам = Истина;
		Док.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад;
		Док.Соглашение = ЭтотОбъект.ДокументЗаказПоставщику.Соглашение;
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		Док.Автор = Пользователи.АвторизованныйПользователь();
		Док.ЗакупкаПодДеятельность = ЭтотОбъект.ДокументЗаказПоставщику.ЗакупкаПодДеятельность;
		Док.НалогообложениеНДС = ЭтотОбъект.ДокументЗаказПоставщику.НалогообложениеНДС;;
        Док.ВариантПриемкиТоваров   = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз; 
		Для Каждого стр из Таб Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",стр.Номенклатура);
			Строки = ТабЗаказа.НайтиСтроки(Отбор);
			
			Если Строки.Количество()>=1 Тогда     
				Т = Док.Товары.Добавить();
				Т.Номенклатура = стр.Номенклатура;
				Т.Упаковка = стр.Номенклатура.ЕдиницаИзмерения;
				Т.КоличествоУпаковок = стр.КоличествоУпаковокПринято;
				Т.Количество = стр.КоличествоУпаковокПринято; 
				Т.Цена = Строки[0].Цена;
				//Т.Сумма = 
				Т.СтавкаНДС = Строки[0].СтавкаНДС;
				//Т.СуммаНДС = 
				//Т.СуммаСНДС = 
				Т.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад ;
				Т.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
				//Т.СуммаВзаиморасчетов = 
				Если стр.СерииНоменклатуры <> Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
					Т.Серия = стр.СерииНоменклатуры;
					Т.СтатусУказанияСерий = 14;
				Иначе
					Т.СтатусУказанияСерий = 0;
				КонецЕсли;
			СтруктураПересчетаСуммы = Новый Структура;	
			Если Строки[0].СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
				СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
			Иначе
				СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Ложь);
				
			КонецЕсли;
			
									
 	СтруктураДействий = Новый Структура;  
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Т, СтруктураДействий, Неопределено);

			Иначе
				Ош = "Товар отсутствует в заказе";
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	Попытка	
		Док.Записать(РежимЗаписиДокумента.Проведение);             
		Ош = Ложь;

	Исключение
		Ош = "При проведении возникла ошибка, проведите в ручную";
	КонецПопытки;		
		
	Иначе
		Ош = "Уже существует документ, выполните приемку в ручную";
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции 

Функция ПоискДокументаПоступления()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	               |ГДЕ
	               |	ПриходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	               |	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА
	               |	И ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	               |	И ПриходныйОрдерНаТовары.Распоряжение = &Ссылка";  
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.ДокументЗаказПоставщику.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции




