&НаКлиенте
Процедура ОткрытьФормуВыбор(ИмяФормы,СтруктураПараметры)
	
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметры,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.МобильныйСкладТест.Форма."+ИмяФормы, _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбработчикГП", 60); 

КонецПроцедуры   



&НаКлиенте
Процедура ОбработчикГП()    

	УстановитьКоличество();
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьКоличество() 
	СкладПолучатель = Новый	Массив;
	//СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
  
	
	ТекП = Пользователи.АвторизованныйПользователь();
	
	Если ТекП.Наименование = "tsd1" Тогда
		СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
	ИначеЕсли ТекП.Наименование = "tsd2" Тогда 
		СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ЦК Цех Комплектации")); 
		ЭтаФорма.Элементы.ГруппаРазмещение.Видимость = Ложь;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	СХК_ВыпускПоЭтапу.Период КАК Период,
	              |	СХК_ВыпускПоЭтапу.ЭтапПроизводства КАК ЭтапПроизводства,
	              |	СХК_ВыпускПоЭтапу.СкладПолучатель КАК СкладПолучатель,
	              |	СХК_ВыпускПоЭтапу.Количество КАК Количество,
	              |	СХК_ВыпускПоЭтапу.Статус КАК Статус,
	              |	СХК_ВыпускПоЭтапу.Упаковка КАК Упаковка,
	              |	СХК_ВыпускПоЭтапу.НомерСтрокиДок КАК НомерСтрокиДок
	              |ИЗ
	              |	РегистрСведений.СХК_ВыпускПоЭтапу КАК СХК_ВыпускПоЭтапу
	              |ГДЕ
	              //|	СХК_ВыпускПоЭтапу.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	              |	СХК_ВыпускПоЭтапу.Статус В (ЗНАЧЕНИЕ(Перечисление.СХК_СтатусВыпуска.Собран))
	              |	И СХК_ВыпускПоЭтапу.СкладПолучатель В(&СкладПолучатель)"; 
	
	 Запрос.УстановитьПараметр("СкладПолучатель",СкладПолучатель);
	 Результат = Запрос.Выполнить().Выбрать();
	 
	 Если Результат.Количество() >= 1 ТОгда
		 ЭтаФорма.Элементы.КолП.Заголовок =Результат.Количество();
	 КонецЕсли;   
/////////////////	 
	Б = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество,
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка.Наименование = &Ячейка"; 
	Запрос.УстановитьПараметр("Ячейка","Буфер");
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	 Если ТабЗнач.Количество() >= 1 ТОгда
		 ЭтаФорма.Элементы.КолП1.Заголовок =ТабЗнач.Количество();
	 КонецЕсли;   
	
	
	 
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоступление(Команда)
	ПараметрыФормыОстатки = Новый Структура;
	//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	//Создаем структуру с параметрами, которые передадим во вторую форму
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.МобильныйСкладТест.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры     


 &НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	УстановитьКоличество();	
КонецПроцедуры


&НаКлиенте
Процедура Размещение(Команда)
 	ПараметрыФормыОстатки = Новый Структура;
	//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	//Создаем структуру с параметрами, которые передадим во вторую форму
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.МобильныйСкладТест.Форма.ФормаПеремещение", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры


&НаКлиенте
Процедура Отгрузка(Команда)
	СтруктураПараметры = Новый Структура;
	ОткрытьФормуВыбор("СписокОрдеров",СтруктураПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОЯчейки(Команда)
	ПараметрыФормыОстатки = Новый Структура;
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.МобильныйСкладТест.Форма.ФормаИнформация", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры



