&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если СтруктураПараметров.ДокументЗаказПеремещения <> "" Тогда
		ЭтотОбъект.ДокументЗаказПеремещения = СтруктураПараметров.ДокументЗаказПеремещения;
		ЗаполнитьФорму(СтруктураПараметров.ДокументЗаказПеремещения,СтруктураПараметров.СтрокаДокументЗаказПеремещения);
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(ДокЗаказа,СтрокаЗаказа)
	
	ЭтотОбъект.Номенклатура = СтрокаЗаказа.Номенклатура; 
	ЭтотОбъект.СкладОтправитель = ДокЗаказа.СкладОтправитель;
	Вложение = ПроверитьВложение(СтрокаЗаказа.Номенклатура);
	ЭтотОбъект.КоличествоВложений = ?(Вложение>0,Вложение,0);

	Если Вложение >=1 Тогда
		ЭтаФОрма.Элементы.ВыборУпаковки.Видимость = Истина;	
	Иначе
		ЭтотОбъект.Упаковка = СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Ложь Тогда
		Элементы.ВыбратьСерию.Доступность = Ложь;
		ЭтотОбъект.ПараметрыУказанияСерий = Ложь;
	Иначе 
		//Элементы.КоличествоУпаковокСобрано.Доступность = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Склад",ДокЗаказа.СкладОтправитель);
		Отбор.Вставить("ПолитикаУчетаСерий",Справочники.ПолитикиУчетаСерий.НайтиПоНаименованию("Учет себестоимости по сериям"));
		Строки = СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		
		Если Строки.Количество()>=1 Тогда
			ЭтотОбъект.ПараметрыУказанияСерий = Истина; 
			ЭтотОбъект.ИспользоватьСерии = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	
	ЭтотОбъект.СерииНоменклатуры = СтрокаЗаказа.СерииНоменклатуры; 
	Если Не ЭтотОбъект.СерииНоменклатуры.Пустая() Тогда
		ЭтотОбъект.Упаковка = ЭтотОбъект.СерииНоменклатуры.СХК_Упаковка;
	КонецЕсли;
	
	ЭтотОбъект.КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок;
	ЭтаФорма.Элементы.ЕдДок.Заголовок = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения; 
	ЭтотОбъект.КоличествоУпаковокСобрано = СтрокаЗаказа.КоличествоУпаковокСобрано;
	
	ДокРО = ПолучитьРасходныйОрдер(ДокЗаказа);
	Если ДокРО = Ложь Тогда
		НовыйДокРО = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
		НовыйДокРО.Дата = ТекущаяДата();  
		НовыйДокРО.ДатаОтгрузки = ТекущаяДата();  
		НовыйДокРО.Ответственный = Пользователи.АвторизованныйПользователь();
		НовыйДокРО.Получатель = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика; 
		НовыйДокРО.Получатель = ДокЗаказа.СкладПолучатель;
		НовыйДокРО.Склад = ДокЗаказа.СкладОтправитель;
		НовыйДокРО.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению;
		НовыйДокРО.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке;
		НовыйДокРО.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		НовыйДокРО.Записать(РежимЗаписиДокумента.Запись); 
		ДокументРО = НовыйДокРО.Ссылка;
	Иначе
		ДокументРО = ДокРО.Ссылка;
		Если СтрокаЗаказа.КоличествоУпаковокСобрано > 0 Тогда
			Элементы.Добавить.Видимость = Ложь;
			Элементы.Изменить.Видимость = Истина;
			Если СтрокаЗаказа.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
				Элементы.СоздатьСерииНоменклатуры.Доступность = Ложь; 
			КонецЕсли;  
		Иначе 
			Собрано = 0;
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",СтрокаЗаказа.Номенклатура);
			//Отбор.Вставить("Серия",СтрокаЗаказа.СерииНоменклатуры); 
			Строки = ДокументРО.ОтгружаемыеТовары.НайтиСтроки(Отбор);
			Если Строки.Количество()>=1 Тогда
				Для сч=0 по Строки.Количество()-1 Цикл
					Собрано = Собрано + Строки[сч].КоличествоУпаковок;
				КонецЦикла;
				Элементы.ДекорацияОстаток.Заголовок = "Осталось собрать: " +Строка(?(СтрокаЗаказа.КоличествоУпаковок - Собрано>0,СтрокаЗаказа.КоличествоУпаковок - Собрано,0));// - Собрано);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	 

КонецПроцедуры

&НаСервере
Функция ПолучитьРасходныйОрдер(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	|	И ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Распоряжение",Заказ.Ссылка );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ОткрытьФормуВыбораСерии()
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Склад",ЭтотОбъект.СкладОтправитель);
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеВыбратьСерию", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаВыбораСерии", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ВыборСерии(Команда)
	ОткрытьФормуВыбораСерии();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеВыбратьСерию(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  

		ЭтотОбъект.СерииНоменклатуры = Значение.СерииНоменклатуры;  
		ЭтотОбъект.ДоступныйОстаток = Значение.ДоступныйОстаток; 
		ЭтотОбъект.Упаковка = Значение.Упаковка; 
		ед = ЕдиницаИзмеренияНоменклатуры();
		
		Если ЗначениеЗаполнено(Значение.Упаковка) Тогда
			Если Значение.Упаковка <> ед.ЕдиницаИзмерения Тогда
				ЭтотОбъект.ДоступныйОстатокЕД = Строка(Значение.ДоступныйОстаток/ед.Числитель) + " упак";// + " " + Строка(ед.ЕдиницаИзмерения);
			КонецЕсли;
		КонецЕсли;
		
		ОчиститьКоличествоУпаковокПринято();
		АктивироватьКоличествоУпаковокПринято();
		ЭтаФорма.Элементы.Декорация1.Заголовок = "";
		ПроверитьСерииДокумент();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьСерииДокумент() 
		Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();
		
		ТабРасп = Док.ТоварыПоРаспоряжениям.Выгрузить();
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
		Отбор.Вставить("Серия", ЭтотОбъект.СерииНоменклатуры.Ссылка);
		
		Строки = ТабРасп.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда  
			Элементы.Добавить.Видимость = Ложь;
			Элементы.Изменить.Видимость = Истина; 
			Элементы.ДекорацияСобрали.Заголовок = "Собрано: " +Строка(Строки[0].Количество);// - Собрано);
		КонецЕсли;
КонецПроцедуры


 &НаСервере
 Функция ЕдиницаИзмеренияНоменклатуры() 
	 СЗ = Новый Структура;
	 СЗ.Вставить("ЕдиницаИзмерения",ЭтотОбъект.Номенклатура.ЕдиницаИзмерения); 
	 Если ЗначениеЗаполнено(ЭтотОбъект.СерииНоменклатуры.СХК_Упаковка) Тогда
	 	СЗ.Вставить("Числитель",ЭтотОбъект.СерииНоменклатуры.СХК_Упаковка.Числитель); 
	Иначе
	 	СЗ.Вставить("Числитель",ЭтотОбъект.Номенклатура.ЕдиницаИзмерения.Числитель); 
	КонецЕсли;
	
	 Возврат СЗ;
 КонецФункции
 

&НаКлиенте
Процедура ВыборУпаковки(Команда)
	ОткрытьФормуВыбораУпаковки();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковки()
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборУпаковки", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаУпаковки", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборУпаковки(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтотОбъект.Упаковка = Значение.Упаковка;  
		ЭтаФорма.Элементы.ДекорацияСобрали.Заголовок = "";
		ЭтаФорма.КоличествоУпаковокСобрано = 0;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//Если ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда
	//	ЭтаФорма.Элементы.КоличествоУпаковокСобрано.РедактированиеТекста = Истина;
	//	АктивироватьКоличествоУпаковокПринято();
	//ИначеЕсли ЭтаФорма.СерииНоменклатуры.Пустая() = Ложь Тогда
	//	АктивироватьКоличествоУпаковокПринято();
	//Иначе 
	//	ЭтаФорма.Элементы.Декорация1.Заголовок = "Выберите серию";
	//	//ОткрытьФормуСозданииСерии();
	//КонецЕсли;
	
	Если ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда
		ЭтаФорма.Элементы.КоличествоУпаковокСобрано.РедактированиеТекста = Истина;
		АктивироватьКоличествоУпаковокПринято();
	ИначеЕсли ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда
		Если ЭтаФорма.СерииНоменклатуры.Пустая() Тогда
			ПодключитьОбработчикОжидания("ОткрытьФормуВыбораСерииПриОткрытии",0.1,Истина) ;
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.КоличествоВложений > 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда
		
		Если ЭтаФорма.СерииНоменклатуры.Пустая() Тогда
			ПодключитьОбработчикОжидания("ОткрытьФормуВыбораСерииПриОткрытии",0.1,Истина) ;
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.КоличествоВложений > 0 И ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда  
		ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	//Иначе
	//	ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСерииПриОткрытии() Экспорт
		ОткрытьФормуВыбораСерии();
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковкиПриОткрытии() Экспорт
	ОткрытьФормуВыбораУпаковки();		
КонецПроцедуры 


 &НаСервере
Процедура ОчиститьКоличествоУпаковокПринято() 
	ЭтотОбъект.КоличествоУпаковокСобрано = 0;
КонецПроцедуры
 
	 
 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Наименование = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура АктивироватьКоличествоУпаковокПринято() 
    Элементы.КоличествоУпаковокСобрано.Доступность = Истина; 
	Элементы.КоличествоУпаковокСобрано.ОбновитьТекстРедактирования();
	Элементы.КоличествоУпаковокСобрано.Видимость = Ложь;
	Элементы.КоличествоУпаковокСобрано.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоУпаковокСобрано; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 


Функция ПроверитьВложение(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.Количество();
КонецФункции

Функция ПолучитьВложение(Номенклатура,Наименование)
	Кратность = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	               |	И УпаковкиЕдиницыИзмерения.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Запрос.УстановитьПараметр("Наименование",Наименование); 

	Результат = Запрос.Выполнить().Выбрать();
	
КонецФункции




//Ош = 1 превышение количества вопрос
//
&НаСервере
Функция ДобавитьНаСервере(Ош) 
	
	//Ош = Истина;
	//
	Если ЭтотОбъект.КоличествоУпаковокСобрано = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	ИначеЕсли ЭтотОбъект.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Ош = "Заполните УПАКОВКУ";
	Иначе
		Если ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель > ЭтотОбъект.КоличествоУпаковок И Ош = Ложь Тогда
			Ош = 1;  
		ИначеЕсли ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель > ЭтотОбъект.ДоступныйОстаток Тогда
			Ош = "Нельзя отгружать больше чем на складе";  
			
		Иначе
			
			докЗаказ = ЭтотОбъект.ДокументЗаказПеремещения.ПолучитьОбъект();
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
			Отбор.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.КОбеспечению);
			СтрокиПеремещения = докЗаказ.Товары.НайтиСтроки(Отбор);
			Если СтрокиПеремещения.Количество()=1 Тогда
				Если СтрокиПеремещения[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель Тогда
					Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
						СтрокиПеремещения[0].СтатусУказанияСерий = 14; 
						СтрокиПеремещения[0].Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
					Иначе
						СтрокиПеремещения[0].СтатусУказанияСерий = 0;
					КонецЕсли; 
					СтрокиПеремещения[0].Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
					
					СтрокиПеремещения[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;	
					СтрокиПеремещения[0].НачалоОтгрузки = ТекущаяДата(); 
					Попытка
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						
				ИначеЕсли СтрокиПеремещения[0].КоличествоУпаковок > ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель Тогда
					СтрокиПеремещения[0].КоличествоУпаковок = СтрокиПеремещения[0].КоличествоУпаковок - ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;	
					СтрокиПеремещения[0].Количество = СтрокиПеремещения[0].Количество - ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;	
					
					Т = докЗаказ.Товары.Добавить();
					Т.Номенклатура = ЭтотОбъект.Номенклатура;
					Т.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
					Т.НачалоОтгрузки = ТекущаяДата();
					Т.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
						Т.СтатусУказанияСерий = 14; 
						Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
					Иначе
						Т.СтатусУказанияСерий = 0;
					КонецЕсли; 
					Т.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
					Т.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
					
					Попытка
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						
				ИначеЕсли СтрокиПеремещения[0].КоличествоУпаковок < ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель Тогда 
					докЗаказ.Товары.Удалить(СтрокиПеремещения[0]);
					//СтрокиПеремещения[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;	
					//СтрокиПеремещения[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;	
					
					Т = докЗаказ.Товары.Добавить();
					Т.Номенклатура = ЭтотОбъект.Номенклатура;
					Т.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
					Т.НачалоОтгрузки = ТекущаяДата();
					Т.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
						Т.СтатусУказанияСерий = 14; 
						Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
					Иначе
						Т.СтатусУказанияСерий = 0;
					КонецЕсли; 
					Т.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
					Т.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
					
					Попытка
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						
					
				Иначе
					Ош = "При проведении возникла ошибка";
					Возврат  Ош;
				КонецЕсли;
				
			Иначе
				Ош = "При проведении возникла ошибка";
				Возврат  Ош;
			КонецЕсли;
			
			Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();	
			///////////////////////
			ТРасп = Док.ТоварыПоРаспоряжениям.Добавить();
			ТРасп.Номенклатура = ЭтотОбъект.Номенклатура; 
			ТРасп.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ТРасп.СтатусУказанияСерий = 14; 
				ТРасп.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ТРасп.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ТРасп.Распоряжение = ЭтотОбъект.ДокументЗаказПеремещения;
			/////////////////////////
			ОтгТов = Док.ОтгружаемыеТовары.Добавить();
			ОтгТов.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить; 
			ОтгТов.Номенклатура = ЭтотОбъект.Номенклатура; 
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ОтгТов.СтатусУказанияСерий = 14; 
				ОтгТов.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ОтгТов.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ОтгТов.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
			ОтгТов.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			ОтгТов.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			//////////////////////////
			Попытка 
				Док.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
				Док.Записать(РежимЗаписиДокумента.Проведение);
				Ош = Ложь;
			Исключение 
				Док.Записать(РежимЗаписиДокумента.Запись);
				Ош = "При проведении возникла ошибка"
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;		
	
	Возврат  Ош;
	
КонецФункции


&НаКлиенте
Процедура Добавить(Команда)
	Ош = ДобавитьНаСервере(Ложь);
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Если Ош = 1 Тогда
			ВывестиВопросКоличествоПревышает();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
			ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте 
Процедура ВывестиВопросКоличествоПревышает()
	
	//@skip-check undefined-function
	Ответ = Вопрос("Количество превышает по документу, ПЕРЕМЕСТИТЬ?",//"Ордер собран",//"Разместить ордер ?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Вопрос" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
 		Ош = ДобавитьНаСервере(Истина);
		Если Ош = Ложь Тогда
			ЭтаФорма.Закрыть();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
			ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		КонецЕсли;
	Иначе
		АктивироватьКоличествоУпаковокПринято()	;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьСтрокуДокумента(Команда)
	Ош = ИзменитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Функция ИзменитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.КоличествоУпаковокСобрано = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	Иначе
		
		
		Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();
		
		ТабРасп = Док.ТоварыПоРаспоряжениям.Выгрузить();
		ТабОтгр = Док.ОтгружаемыеТовары.Выгрузить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
		Отбор.Вставить("Серия", ЭтотОбъект.СерииНоменклатуры.Ссылка);
		
		Строки = ТабРасп.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда  
			ТабРасп.Удалить(Строки[0]);
			//Строки[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано;
			//Строки[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано;
		КонецЕсли;
		Строки = ТабОтгр.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда  
			ТабОтгр.Удалить(Строки[0]);
			//Строки[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано;
			//Строки[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано;
		КонецЕсли;
		
		Док.ТоварыПоРаспоряжениям.Очистить();
		Док.ТоварыПоРаспоряжениям.Загрузить(ТабРасп);
		Док.ОтгружаемыеТовары.Очистить();
		Док.ОтгружаемыеТовары.Загрузить(ТабОтгр);
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки;
/////////////
			Док = ЭтотОбъект.ДокументРО.ПолучитьОбъект();	
			///////////////////////
			ТРасп = Док.ТоварыПоРаспоряжениям.Добавить();
			ТРасп.Номенклатура = ЭтотОбъект.Номенклатура; 
			ТРасп.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ТРасп.СтатусУказанияСерий = 14; 
				ТРасп.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ТРасп.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ТРасп.Распоряжение = ЭтотОбъект.ДокументЗаказПеремещения;
			/////////////////////////
			ОтгТов = Док.ОтгружаемыеТовары.Добавить();
			ОтгТов.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить; 
			ОтгТов.Номенклатура = ЭтотОбъект.Номенклатура; 
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				ОтгТов.СтатусУказанияСерий = 14; 
				ОтгТов.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				ОтгТов.СтатусУказанияСерий = 0;
			КонецЕсли;      
			ОтгТов.Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
			ОтгТов.Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			ОтгТов.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;
			//////////////////////////
			Попытка 
				Док.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
				Док.Записать(РежимЗаписиДокумента.Проведение);
				Ош = Ложь;
			Исключение 
				Док.Записать(РежимЗаписиДокумента.Запись);
				Ош = "При проведении возникла ошибка"
			КонецПопытки;
///////////// 
			Собрано = 0;
			докЗаказ = ЭтотОбъект.ДокументЗаказПеремещения.ПолучитьОбъект();
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
			Отбор.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.Отгрузить); 
 			Отбор.Вставить("Серия",ЭтотОбъект.СерииНоменклатуры);
			СтрокиПеремещения = докЗаказ.Товары.НайтиСтроки(Отбор);
            Собрано = СтрокиПеремещения[0].КоличествоУпаковок;		
			
			ОтборИ = Новый Структура;
			ОтборИ.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
			ОтборИ.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.КОбеспечению); 
			СтрокиИ = докЗаказ.Товары.НайтиСтроки(ОтборИ);
			
			Если ЭтаФорма.КоличествоУпаковокСобрано = 0 Тогда
				Если СтрокиИ.Количество() = 0 Тогда
					СтрокиПеремещения[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению; 
					СтрокиПеремещения[0].Серия = "";
				Иначе					
					докЗаказ.Товары.Удалить(СтрокиПеремещения[0]);	
				конецЕсли;	
			Иначе  
				СтрокиПеремещения[0].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;	
				СтрокиПеремещения[0].Количество = ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;
				Если СтрокиИ.Количество() = 1 Тогда 
					СтрокиИ[0].КоличествоУпаковок = (СтрокиИ[0].КоличествоУпаковок + Собрано) -ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;	
					СтрокиИ[0].Количество = (СтрокиИ[0].Количество + Собрано) - ЭтотОбъект.КоличествоУпаковокСобрано * ЭтотОбъект.Упаковка.Числитель;;
				конецЕсли;	
				
			КонецЕсли;
					Попытка
						докЗаказ.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ош = "При проведении возникла ошибка";
						Возврат  Ош;
					КонецПопытки;						

			
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции

&НаСервере
Функция ПроверитьУпаковку()
	Ош = Истина;
	ЭтаФорма.Элементы.Декорация1.Заголовок = "";
	Если ЭтаФорма.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда 
		ЭтаФорма.Элементы.Декорация1.Заголовок = "Заполните упаковку";
		КоличествоУпаковокСобрано = 0;
		Ош = Ложь;
	КонецЕсли;     
	Возврат Ош;
КонецФункции

	
&НаКлиенте
Процедура Плюс(Команда)  
	Если ПроверитьУпаковку() Тогда
		КоличествоУпаковокСобрано = КоличествоУпаковокСобрано + 1; 
		КоличествоУпаковокСобраноПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Минус(Команда)
	Если ПроверитьУпаковку() Тогда
		КоличествоУпаковокСобрано = КоличествоУпаковокСобрано - 1; 
		КоличествоУпаковокСобраноПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КоличествоУпаковокСобраноПриИзмененииНаСервере()
	Элементы.ДекорацияСобрали.Заголовок = "Собрано: " +Строка(ЭтаФорма.КоличествоУпаковокСобрано * ЭтаФорма.Упаковка.Числитель);// - Собрано);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокСобраноПриИзменении(Элемент) 
	Если ПроверитьУпаковку() Тогда
		КоличествоУпаковокСобраноПриИзмененииНаСервере(); 
	КонецЕсли;
КонецПроцедуры


