Функция СерияПоЗаказуПокупателя(Ссылка,Номенклатура) Экспорт    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиента.Серия КАК Серия
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Ссылка = &Ссылка
	               |	И ЗаказКлиента.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Серия = Рез.Серия;
	Иначе
		Серия = "";
	КонецЕсли;

	Возврат  Серия;  
	
КонецФункции   

Функция ТекущийОстаток(Серия,Номенклатура,Склад) Экспорт
	Если ТипЗнч(Серия) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		Сер = Серия;
	Иначе
		Попытка
			Сер = СерияПоЗаказуПокупателяОСГ(Серия,Номенклатура);
		Исключение
			Сер = Справочники.СерииНоменклатуры.ПустаяСсылка();
		КонецПопытки;
		
	КонецЕсли;
	
	Если ТипЗнч(Сер) <> Тип("Строка") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Серия КАК Серия,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ТоварыНаСкладахОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладахОстатки.Серия = &Серия
		|	И ТоварыНаСкладахОстатки.Склад = &Склад"; 
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Серия",Сер);
		Запрос.УстановитьПараметр("Склад",Склад);
		Рез = Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Остаток = Рез.ВНаличииОстаток;
		Иначе
			Остаток = 0;
		КонецЕсли;  
	Иначе
		Остаток = 0;
	КонецЕсли;  
	
	
	
 	Возврат  Остаток;  
	
КонецФункции 

Функция ПолучитьОсг(Серия,Номенклатура) Экспорт
	Если ТипЗнч(Серия) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		ДатаПроизводства = ДобавитьМесяц(Серия.ГоденДо,Номенклатура.СрокГодности*(-1));
		КолВоДнейСрокагодности = Серия.ГоденДо - ДатаПроизводства;
		ОстаточныйСрок = Серия.годенДо - ТекущаяДата();
		Если ОстаточныйСрок < 0 Тогда
			ОСГ = "Не годен";
		Иначе
			Если КолВоДнейСрокагодности = 0 Тогда
				ОСГ = 0;
			Иначе
				ОСГ = окр(ОстаточныйСрок*100/КолВоДнейСрокагодности);
			КонецЕСли;
		КонецЕсли;
		
		Возврат ОСГ; 
	Иначе 
		Попытка
		Сер = СерияПоЗаказуПокупателяОСГ(Серия,Номенклатура);
		ДатаПроизводства = ДобавитьМесяц(Сер.ГоденДо,Номенклатура.СрокГодности*(-1));
		КолВоДнейСрокагодности = Сер.ГоденДо - ДатаПроизводства;
		ОстаточныйСрок = Сер.годенДо - ТекущаяДата();
		Если ОстаточныйСрок < 0 Тогда
			ОСГ = "Не годен";
		Иначе
			Если КолВоДнейСрокагодности = 0 Тогда
				ОСГ = 0;
			Иначе
				ОСГ = окр(ОстаточныйСрок*100/КолВоДнейСрокагодности);
			КонецЕСли;
		КонецЕсли;
		
		Возврат ОСГ; 
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
		
КонецЕсли;		
	
КонецФункции     
	
Функция СерияПоЗаказуПокупателяОСГ(Ссылка,Номенклатура)     
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиента.Серия КАК Серия
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Ссылка = &Ссылка
	               |	И ЗаказКлиента.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Серия = Рез.Серия;
	Иначе
		Серия = "";
	КонецЕсли;

	Возврат  Серия;  
	
КонецФункции   


Функция ПоискРасходника(Заказ, Номенклатура)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	               |ГДЕ
	               |	РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
	               |	И РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Распоряжение",Заказ);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() ТОгда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции  

Функция ШтрихКодУпаковки(Номенклатура,Упаковка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	               |	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода); 
	Отбор = Новый Структура;
	Отбор.Вставить("Упаковка",Упаковка);
	Строки = ТабЗнач.НайтиСтроки(Отбор);  
	Если Строки.Количество()>=1 Тогда
    	Возврат Строки[0].Штрихкод;
	КонецЕсли;
	
КонецФункции 

Функция ШтрихКодУпаковкиЭтикетка(Номенклатура,Упаковка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Расш1_РегистрШтрихЭтикетка.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК Расш1_РегистрШтрихЭтикетка
	               |ГДЕ
	               |	Расш1_РегистрШтрихЭтикетка.Номенклатура = &Номенклатура
	               |	И Расш1_РегистрШтрихЭтикетка.Упаковка = &Упаковка";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Упаковка",Упаковка);
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода); 
	Если ТабЗнач.Количество()>=1 Тогда
    	Возврат ТабЗнач[0].Штрихкод;
	КонецЕсли;
	
КонецФункции




Функция РасчетЦены(Д,Цена) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалют.Курс КАК Курс
	               |ИЗ
	               |	РегистрСведений.КурсыВалют КАК КурсыВалют
	               |ГДЕ
	               |	КурсыВалют.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И КурсыВалют.Валюта = &Валюта";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Д));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Д));
	Запрос.УстановитьПараметр("Валюта",Справочники.Валюты.НайтиПоКоду("840"));

	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода); 
	Если ТабЗнач.Количество()>=1 Тогда
		Возврат ТабЗнач[0].Курс;	
	Иначе
		Возврат 1 ;	
	КонецЕсли;
	

КонецФункции   

Функция ЯчейкиСерии(Серия,ДатаОтчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОтчета) КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.Серия = &Серия" ;
	Запрос.УстановитьПараметр("ДатаОтчета",КонецДня(ДатаОтчета)); 
	Запрос.УстановитьПараметр("Серия",Серия); 
	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Возврат Строка(Серия) + "("+СтрСоединить(Рез,",")+")";
	
КонецФункции
