
&После("ПриНачалеРаботыСистемы")
Процедура Расш1_ПриНачалеРаботыСистемы()
	//ТекПользователь = Пользователи.АвторизованныйПользователь();
	//Производство = Справочники.ГруппыПользователей.НайтиПоНаименованию("Производство");
	//
	//Отбор = Новый Структура;
	//Отбор.Вставить("Пользователь",ТекПользователь);
	//Строка = Производство.Состав.НайтиСтроки(Отбор);                               
	//Если Строка.Количество()>=1 Тогда
	//	ПодключитьОбработчикОжидания("ОбработчикЗадачСтикер", 60);
	//КонецЕсли;
КонецПроцедуры   

Процедура ОбработчикЗадачСтикер() Экспорт  
	
	//ПоказатьОповещениеПользователя(
	//НСтр("ru = 'Выполнение:'"),
	//,
	//,
	//БиблиотекаКартинок.Информация32
	//);
	
КонецПроцедуры

//&После("ПриНачалеРаботыСистемы")
//Процедура Расш1_ПриНачалеРаботыСистемы()
//	ТекПользователь = Пользователи.АвторизованныйПользователь();
//	Если ТекПользователь = "tsd" Тогда
//		Сообщить("123");
//	КонецЕсли;
//	
//КонецПроцедуры




