
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");
	Объект.Дата = ТекущаяДата(); 
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЗаполнитьДокумент();
	КонецЕсли;

КонецПроцедуры   


&НаСервере
Процедура ЗаполнитьДокумент()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.Серия КАК Серия,
	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК КоличествоУчет
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.Склад = &Склад";
	Запрос.УстановитьПараметр("Склад", Объект.Склад); 
	Объект.Товары.Очистить(); 
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Т = Объект.Товары.Добавить();
		Т.Номенклатура = Рез.Номенклатура;
		Т.Серия = Рез.Серия;
		Т.КоличествоУчет = Рез.КоличествоУчет; 
		Т.КоличествоФакт = 0 - Рез.КоличествоУчет;
	КонецЦикла;
	
	//Объект.Товары.Загрузить(Запрос.Выполнить().Выбрать());
	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТоварыКоличествоПриИзмененииНаСервере(ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки);
КонецПроцедуры 

&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(ТекДанные)
ТекСтрока = Объект.Товары[Число(ТекДанные)-1];	
ТекСтрока.КоличествоФакт = ТекСтрока.Количество - ТекСтрока.КоличествоУчет ;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

	
