
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоНедели(началоДня(ТекущаяДата()));
	Период.ДатаОкончания = КонецНедели(КонецДня(ТекущаяДата()));
КонецПроцедуры  

&НаКлиенте
Процедура Печать(Команда)
	ПечатнаяФорма = ПечатьНаСервере(Период.ДатаНачала,Период.ДатаОкончания);
    ПечатнаяФорма.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ДатаНачала,ДатаОкончания)
	ТаблДокум = Новый  ТабличныйДокумент;
	МакетТД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	МакетТД.Автомасштаб = Истина;
	
	ТаблДокум.Очистить(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Расш1_ОтгрузкаФакт.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Расш1_ОтгрузкаФакт КАК Расш1_ОтгрузкаФакт
	               |ГДЕ
	               |	Расш1_ОтгрузкаФакт.Дата МЕЖДУ &ДатаНачада И &ДатаОкончания
	               |	И Расш1_ОтгрузкаФакт.Проведен = &Проведен
	               |	И Расш1_ОтгрузкаФакт.ПометкаУдаления = &ПометкаУдаления";  
	Запрос.УстановитьПараметр("ДатаНачада",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Рез = Запрос.Выполнить().Выбрать(); 
	Итог = 0; 
	КолОтгр = 0;
	ОбластьШапка = МакетТД.ПолучитьОбласть("Шапка"); 
	ОбластьШапка.Параметры.Заголовок = "Отчет за период" + Строка(Формат(ДатаНачала, "ДЛФ=Д")) + " - " + Строка(Формат(ДатаОкончания, "ДЛФ=Д"));
	ТаблДокум.Вывести(ОбластьШапка);
	
	
	Пока Рез.Следующий() Цикл
		//Для Каждого стр из Рез.Ссылка Цикл 
				ОбластьСтрока = МакетТД.ПолучитьОбласть("СтрокаОтгрузок");
				ОбластьСтрока.Параметры.Отгрузка = "от " + Строка(Формат(Рез.Ссылка.Дата, "ДЛФ=Д")) + " №" + Строка(Рез.Ссылка.Номер);
				к = 0;
				Для Каждого Строка из Рез.Ссылка.ТЧОрдер Цикл
					Док = Строка.ЗаказКлиента.ПолучитьОбъект();      
					к = к + Док.Товары.Итог("КоличествоУпаковок"); 
				КонецЦикла;
				ОбластьСтрока.Параметры.Кол = Строка(к) ;
				ТаблДокум.Вывести(ОбластьСтрока);

				Итог = Итог + к;
			//КонецЦикла;
	КонецЦикла;
	ОбластьИтоги = МакетТД.ПолучитьОбласть("Итоги");
	ОбластьИтоги.Параметры.ИтогоЗаПериод = "Итого отгрузок " + Рез.Количество() + " Итого штук " + Итог;			
	ТаблДокум.Вывести(ОбластьИтоги);
	
	Возврат ТаблДокум;
КонецФункции


