&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Если ЗначениеЗаполнено(СтруктураПараметров.ДокументПО) Тогда
		ЭтотОбъект.ДокументПО = СтруктураПараметров.ДокументПО;
		ЗаполнитьФорму(СтруктураПараметров.СтрокаЗаказПоставщику);
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(СтрокаЗаказа)
	
	ЭтотОбъект.Номенклатура = СтрокаЗаказа.Номенклатура;
	ЭтотОбъект.НомерСтрокиДокумента = СтрокаЗаказа.НомерСтрокиДокумента-1;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",СтрокаЗаказа.Номенклатура);
	Строки = ЭтотОбъект.ДокументПО.Распоряжение.Товары.НайтиСтроки(Отбор);
	
	ЭтотОбъект.Заказано = Строка(Строки[0].КоличествоУпаковок) + " " + Строка(СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения);
	
	ЭтотОбъект.Принято = Строка(СтрокаЗаказа.КоличествоПринято) + " " + Строка(СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения);
	
	Вложение = ПроверитьВложение(СтрокаЗаказа.Номенклатура);
	ЭтотОбъект.КоличествоВложений = ?(Вложение>0,Вложение,0);
	
	Если Вложение >0  Тогда
		Элементы.ГруппаУпаковки.Видимость = Истина;
	//	ЭтотОбъект.КоличествоВложений = Вложение;
	//	ЭтаФОрма.Элементы.ГруппаКоличество.Видимость = Истина;
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято.Видимость = Истина;	
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято1.Видимость = Ложь;	
	//	
	//Иначе
	//	ЭтотОбъект.КоличествоВложений = 0;
	//	ЭтаФОрма.Элементы.ГруппаКоличество.Видимость = Ложь;
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято1.Видимость = Истина;	
	//	ЭтаФОрма.Элементы.КоличествоУпаковокПринято.Видимость = Ложь;	
	КонецЕсли;
	//
	Если СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ИспользоватьСерии  Тогда
	//	Элементы.ГруппаСерииНоменклатуры.Видимость = Ложь;
	//	ЭтотОбъект.ПараметрыУказанияСерий = Ложь;
	//Иначе 
		//Элементы.КоличествоУпаковокПринято.Видимость = Ложь;
		Элементы.ГруппаСерииНоменклатуры.Видимость = Истина;
		ЭтотОбъект.ИспользоватьСерии = Истина;
		Отбор = Новый Структура;
		Отбор.Вставить("Склад",ДокументПО.Склад);
		Отбор.Вставить("ПолитикаУчетаСерий",Справочники.ПолитикиУчетаСерий.НайтиПоНаименованию("Учет себестоимости по сериям"));
		Строки = СтрокаЗаказа.Номенклатура.ВидНоменклатуры.ПолитикиУчетаСерий.НайтиСтроки(Отбор);
		
		Если Строки.Количество()>=1 Тогда
			ЭтотОбъект.ПараметрыУказанияСерий = Истина;
		КонецЕсли;
		
	КонецЕсли;
	//
	//
	//ЭтотОбъект.СерииНоменклатуры = СтрокаЗаказа.СерияНоменклатуры;
	//ЭтотОбъект.КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок; 
	Если СтрокаЗаказа.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		ЭтотОбъект.Упаковка = СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения;
	Иначе
		ЭтотОбъект.Упаковка = СтрокаЗаказа.Упаковка;
	КонецЕсли;
	//
	Если СтрокаЗаказа.Принято  Тогда 
		СЗ = РасчитатьКоличествоУпаковок();
		Элементы.Добавить.Видимость = Ложь;
		Элементы.Изменить.Видимость = Истина;
		//Если СтрокаЗаказа.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		//	Элементы.СоздатьСерииНоменклатуры.Доступность = Ложь;
		//ИначеЕсли Не СтрокаЗаказа.СерияНоменклатуры.Пустая() Тогда
		//	ЭтотОбъект.Упаковка = СтрокаЗаказа.СерияНоменклатуры.СХК_Упаковка;
		//КонецЕсли;
		//Если СтрокаЗаказа.Упаковка =  СтрокаЗаказа.Номенклатура.ЕдиницаИзмерения Тогда 
		//	ЭтотОбъект.ДополнительноеКоличество = СЗ.КоличествоУпаковок;
		//	Элементы.КоличествоУпаковокПринято.Доступность = Ложь;
		//Иначе
		//	//ЭтотОбъект.КоличествоУпаковокПринято = СтрокаЗаказа.КоличествоПринято/ЭтотОбъект.Упаковка.Числитель; 
		//	ЭтотОбъект.КоличествоУпаковокПринято = СЗ.КоличествоУпаковок; 
		//КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РасчитатьКоличествоУпаковок()
	СтрокаДокумента = ДокументПО.Товары[ЭтотОбъект.НомерСтрокиДокумента];
	
	СтруктураСтрока = Новый Структура("КоличествоУпаковок,Серия");
	ЗаполнитьЗначенияСвойств(СтруктураСтрока, СтрокаДокумента);	 
	
	КоличествоУпаковок = СтрокаДокумента.КоличествоУпаковок;
	Если Не СтрокаДокумента.Серия.Пустая() Тогда
		Если ЗначениеЗаполнено(СтрокаДокумента.Серия.СХК_Упаковка) Тогда
			КоличествоУпаковок = СтрокаДокумента.КоличествоУпаковок / СтрокаДокумента.Серия.СХК_Упаковка.Числитель;
		КонецЕсли;
	КонецЕсли;  
	
	СтруктураСтрока.Вставить("КоличествоУпаковок",КоличествоУпаковок);

	Возврат СтруктураСтрока;
КонецФункции


&НаКлиенте
Процедура ВыборУпаковки(Команда)
	ОткрытьФормуВыбораУпаковки();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковки()
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборУпаковки", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаУпаковки", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс );
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборУпаковки(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда
		ЭтаФорма.Элементы.Декорация1.Заголовок = "";
		Если Не Значение.Упаковка.Пустая() Тогда
			ЭтотОбъект.Упаковка = Значение.Упаковка; 
			//Элементы.КоличествоУпаковокПринято.Доступность = Истина;
			//ПересчитатьУпаковки();
		Иначе
			ЭтотОбъект.Упаковка = ЕдиницаИзмеренияНоменклатуры();
			//Элементы.КоличествоУпаковокПринято.Доступность = Ложь;
			ОчиститьКоличествоУпаковок();
		КонецЕсли; 
		ОчиститьСерию();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьУпаковки()
	ЭтаФорма.КоличествоУпаковокПринято = КоличествоУпаковокПринято/Упаковка.Числитель;			
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияНоменклатуры()
	Возврат ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;	
КонецФункции 

&НаСервере
Процедура ОчиститьСерию()
	ЭтаФорма.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКоличествоУпаковок()
	ЭтотОбъект.КоличествоУпаковокПринято = 0;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Ложь Тогда
		АктивироватьКоличествоУпаковокПринято();	
	ИначеЕсли ЭтаФорма.КоличествоВложений = 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда 
		ПодключитьОбработчикОжидания("ОткрытьФормуСозданииСерииПриОткрытии",0.1,Истина) ;
	ИначеЕсли ЭтаФорма.КоличествоВложений > 0 И ЭтаФорма.ПараметрыУказанияСерий = Истина Тогда  
		ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	//Иначе
	//	ПодключитьОбработчикОжидания("ОткрытьФормуВыбораУпаковкиПриОткрытии",0.1,Истина) ;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданииСерииПриОткрытии() Экспорт
		ОткрытьФормуСозданииСерии();
КонецПроцедуры   
	
&НаКлиенте
Процедура ОткрытьФормуВыбораУпаковкиПриОткрытии() Экспорт
	ОткрытьФормуВыбораУпаковки();		
КонецПроцедуры 


&НаКлиенте
Процедура ОткрытьФормуСозданииСерии()
	СтандартнаяОбработка = Ложь; 
	Если ЭтотОбъект.Упаковка.Пустая() = Истина И ЭтаФОрма.Элементы.ВыборУпаковки.Видимость = Истина Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеУпаковки", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Заполните УПАКОВКУ",5,"Внимание!!!");
	Иначе
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("НомерВходящегоДокумента",ДокументПОНомерВходящегоДокумента());
		ПараметрыФормыОстатки.Вставить("Номенклатура",ЭтотОбъект.Номенклатура);
		ПараметрыФормыОстатки.Вставить("Упаковка",ЭтотОбъект.Упаковка);
		ПараметрыФормыОстатки.Вставить("СерииНоменклатуры",ЭтотОбъект.СерииНоменклатуры);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСерии", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеУпаковки(Значение) Экспорт
		
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтотОбъект.СерииНоменклатуры = ПолучитьСериюПоНомеру(Строка(Значение.Номер),ЭтотОбъект.Номенклатура); 
		Если ЭтаФорма.Элементы.КоличествоУпаковокПринято.Видимость = Истина Тогда
			ОчиститьКоличествоУпаковокПринято();
			АктивироватьКоличествоУпаковокПринято();
		КонецЕсли;
		
		ЭтаФорма.Элементы.Декорация1.Заголовок = "";
	КонецЕсли;

КонецПроцедуры

 &НаСервере
Функция ДокументПОНомерВходящегоДокумента() 
	Возврат ЭтотОбъект.ДокументПО.НомерВходящегоДокумента;
КонецФункции


 &НаСервере
Процедура ОчиститьКоличествоУпаковокПринято() 
	ЭтотОбъект.КоличествоУпаковокПринято = 0;
КонецПроцедуры
 
	 
 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Наименование = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции


&НаКлиенте
Процедура АктивироватьКоличествоУпаковокПринято() 
    Элементы.Количество.Доступность = Истина; 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 




Функция ПроверитьВложение(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	               |	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
	               |	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	               |	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	               |	УпаковкиЕдиницыИзмерения.Представление КАК Представление
	               |ИЗ
	               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	               |ГДЕ
	               |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Номенклатура); 
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.Количество();
КонецФункции

&НаСервере
Функция ПолучитьПриходныйОрдер(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	               |ГДЕ
	               |	ПриходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	               |	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА
	               |	И ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	               |	И ПриходныйОрдерНаТовары.Распоряжение = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Заказ.Ссылка );
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ДобавитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.КоличествоУпаковокПринято = 0 И ЭтотОбъект.ДополнительноеКоличество = 0 Тогда
		Ош = "Укажите количество";
	ИначеЕсли ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	ИначеЕсли ЭтотОбъект.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Ош = "Заполните УПАКОВКУ";
	Иначе
		Док = ЭтотОбъект.ДокументПО.ПолучитьОбъект();
		
		//Если ЭтотОбъект.ДополнительноеКоличество > 0 Тогда 
		//	Т = Док.Товары.Добавить();
		//	Т.Номенклатура = ЭтотОбъект.Номенклатура; 
		//	Т.Количество = ЭтотОбъект.ДополнительноеКоличество;
		//	Т.КоличествоУпаковок = ЭтотОбъект.ДополнительноеКоличество;
		//	
		//	Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
		//		Т.СтатусУказанияСерий = 14; 
		//		Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
		//	Иначе
		//		Т.СтатусУказанияСерий = 0;
		//	КонецЕсли; 
		//КонецЕсли;
		
		Если ЭтотОбъект.КоличествоУпаковокПринято > 0 Тогда  
			
			ТТ = Док.Товары.Выгрузить();
			
			Т = ТТ.Добавить();
			Т.Номенклатура = ЭтотОбъект.Номенклатура; 
			Т.Количество = ЭтотОбъект.КоличествоУпаковокПринято * ЭтотОбъект.Упаковка.Числитель;
			Т.КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокПринято * ЭтотОбъект.Упаковка.Числитель ;
			Если ЭтотОбъект.ПараметрыУказанияСерий = Истина Тогда
				Т.СтатусУказанияСерий = 14; 
				Т.Серия = ЭтотОбъект.СерииНоменклатуры.Ссылка;
			Иначе
				Т.СтатусУказанияСерий = 0;
			КонецЕсли; 
			ТТ.Свернуть("Номенклатура,Серия,СтатусУказанияСерий","Количество,КоличествоУпаковок");
			Док.Товары.Очистить();
			Док.Товары.Загрузить(ТТ);
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь; 
			ЭтотОбъект.НомерСтрокиДокумента = Док.Товары.Количество()+1;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки; 
		КонецЕсли;
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции


&НаКлиенте
Процедура Добавить(Команда)
	Ош = ДобавитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры   


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьСтрокуДокумента(Команда)
	Ош = ИзменитьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Функция ИзменитьНаСервере() 
	
	Ош = Истина;
	
	Если ЭтотОбъект.ПараметрыУказанияСерий = Истина И ЭтотОбъект.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		Ош = "Заполните серию";
	Иначе
		Док = ЭтотОбъект.ДокументПО.ПолучитьОбъект();
		
		Таб = Док.Товары.Выгрузить();
		
		//Отбор = Новый Структура;
		//Отбор.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
		//Отбор.Вставить("Серия", ЭтотОбъект.СерииНоменклатуры.Ссылка);
		////Отбор.Вставить("Упаковка", ЭтотОбъект.Упаковка);
		//
		//Строки = Таб.НайтиСтроки(Отбор);
		//Если Строки.Количество()>=1 Тогда
		Если ЭтотОбъект.КоличествоУпаковокПринято = 0 И ЭтотОбъект.ДополнительноеКоличество = 0	Тогда 
			Таб.Удалить(ЭтотОбъект.НомерСтрокиДокумента);
		Иначе
			
			Если ЭтотОбъект.КоличествоУпаковокПринято > 0 ИЛИ ЭтотОбъект.ДополнительноеКоличество > 0 Тогда 
				Если ЭтотОбъект.КоличествоУпаковокПринято > 0 Тогда
					Таб[ЭтотОбъект.НомерСтрокиДокумента].Количество = ЭтотОбъект.КоличествоУпаковокПринято*ЭтотОбъект.Упаковка.Числитель;
					Таб[ЭтотОбъект.НомерСтрокиДокумента].КоличествоУпаковок = ЭтотОбъект.КоличествоУпаковокПринято*ЭтотОбъект.Упаковка.Числитель;
					//Строки[0].Упаковка = ЭтотОбъект.Упаковка;
				КонецЕсли;
				//Если ЭтотОбъект.ДополнительноеКоличество > 0 Тогда
				//	Таб[ЭтотОбъект.НомерСтрокиДокумента].Количество = ЭтотОбъект.ДополнительноеКоличество;
				//	Таб[ЭтотОбъект.НомерСтрокиДокумента].КоличествоУпаковок = ЭтотОбъект.ДополнительноеКоличество;
				//	//Строки[0].Упаковка = ЭтотОбъект.Номенклатура.ЕдиницаИзмерения;
				//КонецЕсли;
				
			//Иначе
			//	Таб.Удалить(Строки[0]);
		КонецЕсли;
			
		КонецЕсли;
		
		Док.Товары.Очистить(); 
		
		Таб.Свернуть("Номенклатура,Серия,СтатусУказанияСерий","Количество,КоличествоУпаковок");
		
		Док.Товары.Загрузить(Таб);


		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Ош = Ложь;
		Исключение
			Ош = "При проведении возникла ошибка"
		КонецПопытки;
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции

&НаКлиенте
Процедура СоздатьСерииНоменклатуры(Команда)
	ОткрытьФормуСозданииСерии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("СерииНоменклатуры",ЭтаФорма.СерииНоменклатуры);
	СтуктураВозврат.Вставить("Номенклатура",ЭтаФорма.Номенклатура);
	СтуктураВозврат.Вставить("Упаковка",ЭтаФорма.Упаковка);
	СтуктураВозврат.Вставить("КоличествоУпаковокПринято",ИтогКоличестваПоФорме());
	СтуктураВозврат.Вставить("НомерСтрокиДокумента",ЭтаФорма.НомерСтрокиДокумента);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры

&НаСервере
Функция ИтогКоличестваПоФорме()
	Возврат  ЭтотОбъект.КоличествоУпаковокПринято*ЭтотОбъект.Упаковка.Числитель + ЭтотОбъект.ДополнительноеКоличество; 
	
КонецФункции

&НаСервере
Процедура УпаковкаПриИзмененииНаСервере()
	ЭтаФорма.СерииНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка(); 
	ЭтаФорма.КоличествоУпаковокПринято = 0;
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	УпаковкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Плюс(Команда)
	КоличествоУпаковокПринято = КоличествоУпаковокПринято + 1;
КонецПроцедуры

&НаКлиенте
Процедура Минус(Команда)
	КоличествоУпаковокПринято = КоличествоУпаковокПринято - 1;
КонецПроцедуры


