&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	СписокЭтапов.Параметры.УстановитьЗначениеПараметра("ЭтапПроизводства",Объект.Ссылка);
КонецПроцедуры   


&НаСервере
Процедура СХК_ОтразитьКоличествоФактВТЧНаСервере(Исполнитель)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОтразитьКоличествоФактВТЧ(Исполнитель);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	ЗаполнитьСлужебныеРеквизиты();
	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей();
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура СХК_ОтразитьКоличествоФактВТЧ(Исполнитель) Экспорт
	СХК_ОтразитьКоличествоФактВТЧНаСервере(Исполнитель); 
КонецПроцедуры

&НаСервере
Процедура Расш1_СХК_СвернутьПослеНаСервере()
	Если Объект.РасходМатериаловИРабот.Количество()>=1 Тогда
	   ВремТЗ =  Объект.РасходМатериаловИРабот.Выгрузить();
	   ВремТЗ.Свернуть("Подразделение,Номенклатура, Характеристика, Серия,Упаковка,СтатьяКалькуляции,ДатаРасхода,СтатусУказанияСерий","КоличествоУпаковок,Количество");
	   Объект.РасходМатериаловИРабот.Загрузить(ВремТЗ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СХК_СвернутьПосле(Команда)
	Расш1_СХК_СвернутьПослеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Расш1_СтатусПриИзмененииПослеНаСервере()
	Если Объект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
		
		Расш1_СХК_РасчитатьДолюСтоимостиНаСервере();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Проведен = &Проведен
		|	И ПриходныйОрдерНаТовары.ПометкаУдаления = &ПометкаУдаления
		|	И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение"; 
		Запрос.УстановитьПараметр("Проведен",Истина);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		Запрос.УстановитьПараметр("Распоряжение",Объект.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Док = Результат.Ссылка.ПолучитьОбъект(); 
			Док.Отправитель = Объект.Подразделение; 
			Док.НомерВходящегоДокумента = Док.Распоряжение.НомерНаПечать;
			ТабТовары = Док.Товары.Выгрузить();
			Док.Товары.Очистить();
			Док.Товары.Загрузить(ТабТовары);
			Док.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Расш1_СХК_РасчитатьДолюСтоимостиНаСервере()
	ПроизводствоСервер.СХК_РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Объект, ПараметрыРаспределенияЗатрат,Неопределено);		
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтатусПриИзмененииПосле(Элемент)
	Расш1_СтатусПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьСлужебныеРеквизитыТабличныхЧастей")
Процедура Расш1_ЗаполнитьСлужебныеРеквизитыТабличныхЧастей(СписокТЧ, СтрокиЗаполнения)
	СтруктураТЧ = Новый Структура(СписокТЧ);
	ВсеТЧ = (СтруктураТЧ.Количество() = 0);
	
	Если СтруктураТЧ.Свойство("ВыходныеИзделия") ИЛИ ВсеТЧ Тогда
		УправлениеПроизводством.ЗаполнитьСлужебныеРеквизитыВыходныхИзделийЭтапаПроизводства(Объект.ВыходныеИзделия, СтрокиЗаполнения);
		УправлениеПроизводством.ЗаполнитьНаправлениеВыпускаВТЧ(?(СтрокиЗаполнения <> Неопределено, СтрокиЗаполнения, Объект.ВыходныеИзделия));
		//++ Устарело_Переработка24
		ДавальческаяСхема.ЗаполнитьПризнакДоступноОформлениеОтчетаДавальцуВТаблице(ЭтотОбъект, Объект.ВыходныеИзделия, СтрокиЗаполнения);
		//-- Устарело_Переработка24
		НастройкаСчетовУчетаСервер.ОбновитьПредставлениеНастройки(ЭтотОбъект, "Объект.ВыходныеИзделия");
		Расш1_СХК_РасчитатьДолюСтоимостиНаСервере();
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("ПобочныеИзделия") ИЛИ ВсеТЧ Тогда
		УправлениеПроизводством.ЗаполнитьСлужебныеРеквизитыВыходныхИзделийЭтапаПроизводства(Объект.ПобочныеИзделия, СтрокиЗаполнения);
		УправлениеПроизводством.ЗаполнитьНаправлениеВыпускаВТЧ(?(СтрокиЗаполнения <> Неопределено, СтрокиЗаполнения, Объект.ПобочныеИзделия));
		//++ Устарело_Переработка24
		ДавальческаяСхема.ЗаполнитьПризнакДоступноОформлениеОтчетаДавальцуВТаблице(ЭтотОбъект, Объект.ПобочныеИзделия, СтрокиЗаполнения);
		//-- Устарело_Переработка24
		НастройкаСчетовУчетаСервер.ОбновитьПредставлениеНастройки(ЭтотОбъект, "Объект.ПобочныеИзделия");
		ВнутренняяПереработкаСервер.ЗаполнитьВладелецИзделияДоступенВТаблице(ЭтотОбъект, Объект.ПобочныеИзделия);
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("РасходМатериаловИРабот") ИЛИ ВсеТЧ Тогда
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		
		НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
			Объект.РасходМатериаловИРабот,
			СтруктураДействий,
			СтрокиЗаполнения);
		
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("ЭкономияМатериалов") ИЛИ ВсеТЧ Тогда
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		
		НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
			Объект.ЭкономияМатериалов,
			СтруктураДействий,
			СтрокиЗаполнения);
			
		КоллекцияСтрок = ?(СтрокиЗаполнения <> Неопределено, СтрокиЗаполнения, Объект.ЭкономияМатериалов);
		Для каждого ДанныеСтроки Из КоллекцияСтрок Цикл
			ДанныеСтроки.Действия = ?(ДанныеСтроки.СписатьНаРасходы, 
										Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию, 
										Перечисления.ХозяйственныеОперации.ВозвратИзПроизводства);
		КонецЦикла;
		
		ПроизводствоСервер.ЗаполнитьПризнакЦеховаяКладоваяВТаблице(Объект.ЭкономияМатериалов, "Получатель",, СтрокиЗаполнения);
		НастройкаСчетовУчетаСервер.ОбновитьПредставлениеНастройки(ЭтотОбъект, "Объект.ЭкономияМатериалов");
		
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("ОбеспечениеМатериаламиИРаботами") ИЛИ ВсеТЧ Тогда
		
		УправлениеПроизводством.ЗаполнитьСлужебныеРеквизитыОбеспеченияЭтапаПроизводства(
			ЭтотОбъект,
			Объект.ОбеспечениеМатериаламиИРаботами,
			СтрокиЗаполнения);
		
		ЗаполнитьНормативы("ОбеспечениеМатериаламиИРаботами", СтрокиЗаполнения);
		
		ЗаполнитьСлужебныеРеквизитыФормыДокумента();
		
		Если ПравоЧтенияАналогов И ПоказатьАналоги Тогда
			ОтметитьНаличиеАналогов();
		КонецЕсли;
		
		УправлениеДаннымиОбИзделиях.ЗаполнитьРеквизитВходитВНабор(Объект);
		
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("Трудозатраты") ИЛИ ВсеТЧ Тогда
		
		ЗаполнитьНормативы("Трудозатраты", СтрокиЗаполнения);
		
	КонецЕсли;

КонецПроцедуры
