
&НаКлиенте
Процедура ПоискШКQrИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ПроверкаНаЧисло(Текст) = Истина Тогда
		Т = ПоискШК(Текст);
	Иначе
		Для сч = 3 по 7 Цикл
			Т = ПоискQR(Текст,сч);
			Если Т <> Ложь Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Если Т <> Ложь ТОгда
		Элементы.ГруппаНоменклатура.Видимость = Истина; 
		Элементы.Добавить.Видимость = Истина;  

		СоздатьГруппыРезультата(Т);
	Иначе
		Сообщить("Остаток 0");
	КонецЕсли;
		
КонецПроцедуры  

&НаСервере
Процедура СоздатьГруппыРезультата(м)
        Номенклатура = "";
        Серия = "";
        Количество = 0;
		
		Номенклатура = м[0].Номенклатура; 
		Если м[0].Серия <> "" Тогда
			Серия = м[0].Серия;
		Иначе
			ЭтаФорма.ТекущийЭлемент = Элементы.Серия;
		КонецЕсли;
		
	
КонецПроцедуры

&НаСервере
Функция ПоискШК(Ш)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Расш1_РегистрШтрихЭтикетка.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК Расш1_РегистрШтрихЭтикетка
	|ГДЕ
	|	Расш1_РегистрШтрихЭтикетка.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Ш);
	Рез = Запрос.Выполнить().Выбрать();
	Мас = Новый Массив;

	Если Рез.Количество() >=1 Тогда
		Пока Рез.Следующий() Цикл 
			//Ном = Рез.Номенклатура;
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
			СЗ.Вставить("Серия",""); 
			Мас.Добавить(СЗ);
			
		КонецЦикла
	Иначе
		Мас = Ложь;	
	КонецЕсли;
	
	Возврат Мас;
	
КонецФункции  

//&НаСервере
//Функция ПоискQR(Ш,сим)
//	Запрос = Новый Запрос;
//	//|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК ШтрихкодыНоменклатуры
//	
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
//	               |	ТоварыНаСкладахОстатки.Серия КАК Серия,
//	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
//	               |ИЗ
//	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
//	               |ГДЕ
//	               |	(ТоварыНаСкладахОстатки.Склад = &Склад ИЛИ ТоварыНаСкладахОстатки.Склад = &СкладГП) И
//	               |	ТоварыНаСкладахОстатки.Серия.Наименование ПОДОБНО &Серия";   
//				   //|	ТоварыНаСкладахОстатки.Серия.Наименование =  &Серия";

//	СтрокаСерия = Лев(Ш,сим);
//	СтрокаСерия = СтрокаСерия+Строка("%"+Прав(Ш,11));
//	Запрос.УстановитьПараметр("Серия", СтрокаСерия); 
//	Запрос.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоНаименованию("ЦС Цех Снеки"));
//	Запрос.УстановитьПараметр("СкладГП", Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
//	Рез = Запрос.Выполнить().Выбрать(); 
//	Мас = Новый Массив;
//	

//	Если Рез.Количество()>0 Тогда
//		Пока Рез.Следующий() Цикл
//			СЗ = Новый Структура;
//			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
//			СЗ.Вставить("Серия",Рез.Серия); 
//			Мас.Добавить(СЗ);
//		КонецЦикла;		//Ном = Рез.Номенклатура; 
//	Иначе
//		Мас = Ложь;	
//	КонецЕсли;
//	
//	Возврат Мас;
//	
//КонецФункции 

&НаСервере
Функция ПоискQR(Ш,сим)
	Запрос = Новый Запрос;
	//|	РегистрСведений.Расш1_РегистрШтрихЭтикетка КАК ШтрихкодыНоменклатуры
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	               |	ЗаказНаПроизводство2_2Продукция.Расш1_Серия КАК Расш1_Серия
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |ГДЕ
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата >= &Дата
	               |	И ЗаказНаПроизводство2_2Продукция.Расш1_Серия.Наименование ПОДОБНО &Серия";   
				   //|	ТоварыНаСкладахОстатки.Серия.Наименование =  &Серия";

	СтрокаСерия = Лев(Ш,сим);
	СтрокаСерия = СтрокаСерия+Строка("%"+Прав(Ш,11));
	Запрос.УстановитьПараметр("Серия", СтрокаСерия);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата())-7*86400); 	
	Рез = Запрос.Выполнить().Выбрать(); 
	Мас = Новый Массив;
	

	Если Рез.Количество()>0 Тогда
		Пока Рез.Следующий() Цикл
			СЗ = Новый Структура;
			СЗ.Вставить("Номенклатура",Рез.Номенклатура);
			СЗ.Вставить("Серия",Рез.Расш1_Серия); 
			Мас.Добавить(СЗ);
		КонецЦикла;		//Ном = Рез.Номенклатура; 
	Иначе
		Мас = Ложь;	
	КонецЕсли;
	
	Возврат Мас;
	
КонецФункции 

&НаСервере
Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура Отмена(Команда)
	Элементы.ГруппаНоменклатура.Видимость = Ложь;
	Элементы.ГруппаДокумент.Видимость = Истина;
    ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Функция ДобавитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Расш1_ПоступлениеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Расш1_ПоступлениеСклад КАК Расш1_ПоступлениеСклад
	               |ГДЕ
	               |	Расш1_ПоступлениеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И Расш1_ПоступлениеСклад.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Расш1_ПоступлениеСклад.Проведен = &Проведен"; 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Серия = "" Тогда
		Ош = "Заполните серию";
	ИначеЕсли Количество = 0 Тогда
		Ош = "Заполните количество";
	Иначе
		
	
	
	
	Если Рез.Следующий() Тогда
		ТекДок = Рез.Ссылка.ПолучитьОбъект();
		НоваяСтрока = ТекДок.Товары.Добавить();
	    НоваяСтрока.Номенклатура = Номенклатура;
	    НоваяСтрока.Серия = Серия;
	    НоваяСтрока.Количество = Количество; 
		НоваяСтрока.Время = ТекущаяДата();
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ТекДок = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент(); 
		ТекДок.Дата =ТекущаяДата(); 
		ТекДок.Склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");
		НоваяСтрока = ТекДок.Товары.Добавить();
	    НоваяСтрока.Номенклатура = Номенклатура;
	    НоваяСтрока.Серия = Серия;
	    НоваяСтрока.Количество = Количество; 
		НоваяСтрока.Время = ТекущаяДата();
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	 Ош = Ложь;	
	КонецЕсли;
	Возврат Ош;

КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	Д = ДобавитьНаСервере();
	Если Д = Ложь Тогда 
		Элементы.ГруппаНоменклатура.Видимость = Ложь;
	    Элементы.ГруппаДокумент.Видимость = Истина;
	Иначе
		Сообщить(Д);
	КонецЕсли;
	ЗаполнитьТаблицу();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицу()
	ТЗ.Очистить();
	Для Каждого стр из ТекДокумент.Товары Цикл
		Т = ТЗ.Добавить();
		Т.НомерСтроки = стр.НомерСтроки;
		Т.Номенклатура = стр.Номенклатура;
		Т.Количество = стр.Количество; 
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Расш1_ПоступлениеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Расш1_ПоступлениеСклад КАК Расш1_ПоступлениеСклад
	               |ГДЕ
	               |	Расш1_ПоступлениеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И Расш1_ПоступлениеСклад.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Расш1_ПоступлениеСклад.Проведен = &Проведен"; 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Количество() = 0 Тогда
		ТекДок = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент(); 
		ТекДок.Дата =ТекущаяДата(); 
		ТекДок.Склад = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции");
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
		ТекДокумент = ТекДок.Ссылка;  
	Иначе  
		Пока Рез.Следующий() Цикл
			ТекДокумент = Рез.Ссылка;	
		КонецЦикла;
	КонецЕсли;  
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ТекДокументТоварыВыборНаСервере(ВыбраннаяСтрока)
	НомерСтроки =  ВыбраннаяСтрока-1;
	Строка = ТекДокумент.Товары[ВыбраннаяСтрока-1];
	Номенклатура = Строка.Номенклатура; 
	Количество = Строка.Количество; 
	Серия = Строка.Серия; 
	

КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(НомерСтроки) 
	Док = ТекДокумент.ПолучитьОбъект();
	Док.Товары.Удалить(НомерСтроки);
	Док.Записать(РежимЗаписиДокумента.Проведение);
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)     
	Элементы.ГруппаНоменклатура.Видимость = Ложь;
	Элементы.ГруппаДокумент.Видимость = Истина;
	УдалитьНаСервере(НомерСтроки);
КонецПроцедуры


&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Элементы.ГруппаНоменклатура.Видимость = Истина; 
	Элементы.ГруппаДокумент.Видимость = Ложь; 
	Элементы.Удалить.Видимость = Истина;  
	Элементы.Добавить.Видимость = Ложь;  
	
	ТекДокументТоварыВыборНаСервере(Элемент.ТекущиеДанные.НомерСтроки);

КонецПроцедуры


