
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Если СтруктураПараметров.Ссылка <> "" Тогда
		ДокСсылка = СтруктураПараметров.Ссылка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьФорму();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьФорму() 
	ЭтаФорма.Заголовок = Строка(ДокСсылка.Номер)+" / "+Строка(ДокСсылка.СкладПолучатель) ; 
	ТЧДок.Очистить();
	Для Каждого стр из ДокСсылка.Товары Цикл
		Т = ТЧДок.Добавить();
		Т.Номенклатура = стр.Номенклатура; 
		Т.Упаковка  = стр.Номенклатура.ВесЕдиницаИзмерения;
		Т.Количество = стр.Количество;
		Т.КоличествоУпаковок = стр.КоличествоУпаковок;
	КонецЦикла;
	
	//ЭтаФорма.Элементы.СкладПолучатель.Заголовок = ДокСсылка.СкладПолучатель;
	
КонецПроцедуры


&НаКлиенте
Процедура ТЧДокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ТЧДокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

