//&Вместо("КУказаниюСерийНаСервере")
//Процедура УказатьСериюНаСервере()
//	ВариантПолучениеДанныхИзРегистров = Обработки.ПодборСерийВДокументы.ВариантПолучениеДанныхИзРегистровПоПараметрамФормы(ПараметрыУказанияСерий, Распоряжение, ТекущийСклад, ТекущийВидНоменклатуры);
//	
//	Отбор = Новый Структура;
//	Отбор.Вставить("Номенклатура", ТекущаяНоменклатура);
//	Отбор.Вставить("Характеристика", ТекущаяХарактеристика);
//	Отбор.Вставить("Склад", ТекущийСклад);
//	Отбор.Вставить("ВариантОбеспечения", ТекущийВариантОбеспечения);
//	
//	Если ОстаткиСерий.НайтиСтроки(Отбор).Количество()=0 Тогда
//		ВыполнитьЗапросЗаполненияТаблицыОстатков();
//	КонецЕсли;
//	
//	ОстаткиСерийТекущие.Очистить();
//	
//	Отбор = Новый Структура;
//	Отбор.Вставить("Номенклатура", ТекущаяНоменклатура);
//	Отбор.Вставить("Характеристика", ТекущаяХарактеристика);
//	Отбор.Вставить("ВариантОбеспечения", ТекущийВариантОбеспечения);
//	Отбор.Вставить("Склад", ТекущийСклад);
//	Если РежимОтображенияСерий = "ТолькоОстатки" Тогда
//		Отбор.Вставить("РежимОтображенияСерий", РежимОтображенияСерий);
//	КонецЕсли;
//	
//	Колонки = ОстаткиСерий.Выгрузить().Колонки;
//	КолонкиДопРеквизитов = Новый Массив;
//	Для Каждого Колонка Из Колонки Цикл
//		Если СтрНайти(Колонка.Имя, "ДополнительныйРеквизитЗначение") <> 0 Тогда
//			КолонкиДопРеквизитов.Добавить(СтрЗаменить(Колонка.Имя,"ОстаткиСерий",""));
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для Каждого СтрокаСерий Из ОстаткиСерий.НайтиСтроки(Отбор) Цикл
//		НоваяСтрокаСерий = ОстаткиСерийТекущие.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрокаСерий, СтрокаСерий);
//		
//		Для Каждого Колонка Из КолонкиДопРеквизитов Цикл
//			НоваяСтрокаСерий["ОстаткиСерийТекущие"+Колонка] = СтрокаСерий["ОстаткиСерий"+Колонка]
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	Заголовки = Обработки.ПодборСерийВДокументы.ЗаголовкиПоВариантуПолучениеДанныхИзРегистров(ВариантПолучениеДанныхИзРегистров);
//	Элементы.РежимОтображенияСерий.СписокВыбора[0].Представление = Заголовки.ЗаголовокКнопки;
//	
//	НастройкиИспользованияСерий = Новый ФиксированнаяСтруктура(Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(
//																							ТекущийВидНоменклатуры,
//																							ПараметрыУказанияСерий,
//																							Новый Структура("Склад",ТекущийСклад)));
//																							
//	Для Каждого Стр из ОстаткиСерийТекущие Цикл
//		ДатаПроизводства = ДобавитьМесяц(Стр.ГоденДо,Стр.Номенклатура.СрокГодности*(-1));
//		КолВоДнейСрокагодности = Стр.ГоденДо - ДатаПроизводства;
//		ОстаточныйСрок = Стр.годенДо - ТекущаяДата();
//		Если ОстаточныйСрок < 0 Тогда
//			Стр.ОстаточныйСрокГодности = "Не годен";
//		Иначе
//			Если КолВоДнейСрокагодности = 0 Тогда
//				Процент = 0;
//			Иначе
//				Процент = окр(ОстаточныйСрок*100/КолВоДнейСрокагодности);
//			КонецЕСли;
//			Если Процент > 100 Тогда
//				Процент = 100;
//			КонецЕсли;
//			Стр.ОстаточныйСрокГодности = Строка(Процент);
//		КонецЕсли;
//	КонецЦикла;																						
//																								
//																							
//	Элементы.ОстаткиСерийТекущиеГоденДо.Видимость = НастройкиИспользованияСерий.ИспользоватьСрокГодностиСерии;
//	Элементы.ОстаткиСерийТекущиеНомер.Видимость = НастройкиИспользованияСерий.ИспользоватьНомерСерии;
//	Элементы.ОстаткиСерийЗаполнитьПоFEFO.Видимость = НастройкиИспользованияСерий.ИспользоватьСрокГодностиСерии;
//	
//	Элементы.СтраницыТоварыСерии.ТекущаяСтраница = Элементы.СтраницаСерии;
//	СтраницаСерии = Истина;
//	НастроитьВидимостьНаСервере();
//	
//КонецПроцедуры

&НаКлиенте
Процедура Расш1_СерииПодобраноПриИзмененииПосле(Элемент)
	ОчиститьСообщения();  
	//ОстаткиСерийТекущиеКоличествоПриИзмененииНаСервере(Элементы.ОстаткиСерийТекущие.ТекущаяСтрока);

КонецПроцедуры   

//&НаСервере
//Процедура ОстаткиСерийТекущиеКоличествоПриИзмененииНаСервере(ИдентификаторТекущейСтроки) 

//	ТекущиеДанные = Объект.Серии.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);

//	Отбор = Новый Структура();
//	Отбор.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
//	Отбор.Вставить("Характеристика",ТекущиеДанные.Характеристика);
//	Отбор.Вставить("Склад",ТекущиеДанные.Склад);
//	Отбор.Вставить("Серия",ТекущиеДанные.Серия);
//	Отбор.Вставить("ВариантОбеспечения",ТекущиеДанные.ВариантОбеспечения);	
//	

//КонецПроцедуры 



