
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Параметры.ЗначенияЗаполнения;
	
	Если СтруктураПараметров.Количество() >=1 Тогда  
		ВидНоменклатуры  = СтруктураПараметров.ВидНоменклатуры;
		Номенклатура  = СтруктураПараметров.Номенклатура;
	КонецЕсли;   
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидНоменклатуры",ВидНоменклатуры);
	Список.Параметры.УстановитьЗначениеПараметра("Номер","%"+Номенклатура.Артикул+"%");
КонецПроцедуры

&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("ВидНоменклатуры",ВидНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСерию(Команда)
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНоменклатуры,Номенклатура,"");
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора); 

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСоздатьСерии", ЭтаФорма);

	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСоздатьСерии(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("Номер","%"+Значение.Номер+"%");
	КонецЕсли;

КонецПроцедуры     



&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНоменклатуры,Номенклатура,Элемент.ТекущиеДанные.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СписокПараметров = Новый Структура;  
    СписокПараметров.Вставить("Номер", ЭтаФорма.Элементы.Список.ТекущиеДанные.Номер);  
    ОповеститьОВыборе(СписокПараметров); 

КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СброситьПоиск(Команда)
	Список.Параметры.УстановитьЗначениеПараметра("Номер","%%");
КонецПроцедуры




