
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("СХК_ПолныеСклад") Тогда
		Если РольДоступна("СХК_ПолныеСклад") И НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДата()) Тогда  
    	ЭтаФорма.Элементы.ТоварыВремя.ТолькоПросмотр = Истина;
    	ЭтаФорма.Элементы.ТоварыНоменклатура.ТолькоПросмотр = Истина;
    	ЭтаФорма.Элементы.ТоварыУпаковка.ТолькоПросмотр = Истина;
    	ЭтаФорма.Элементы.ТоварыСерия.ТолькоПросмотр = Истина;
    	ЭтаФорма.Элементы.ТоварыЯчейка.ТолькоПросмотр = Истина;
			
		//	ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Истина; 
		//    ЭтаФорма.Элементы.Товары.ТолькоПросмотр = Истина;
		//Иначе
		//	ЭтаФорма.Элементы.Дата.ТолькоПросмотр = Ложь; 
		КонецЕсли;
	Иначе
    	ЭтаФорма.Элементы.Товары.ТолькоПросмотр = Истина;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


