
&ИзменениеИКонтроль("РеализацияТоваровУслугПараметрыОткрытияФормы")
Функция Расш1_РеализацияТоваровУслугПараметрыОткрытияФормы(ПараметрКоманды)

	ПараметрыОснования = Новый Структура;
	ПараметрыОснования.Вставить("СкладОтгрузки", 			Неопределено);
	ПараметрыОснования.Вставить("ВариантОформленияПродажи", Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);

	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПараметрКоманды))
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРеализациюПоНесколькимЗаказам") Тогда

		Если ТипЗнч(ПараметрКоманды) = Тип("Массив")
			И ПараметрКоманды.Количество() > 0 Тогда

			ДокументОснование = ПараметрКоманды[0];

		Иначе
			ДокументОснование = ПараметрКоманды;
		КонецЕсли;

		ХозяйственнаяОперация = Неопределено;
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
			ХозяйственнаяОперацияРеализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ХозяйственнаяОперация");
			ХозяйственнаяОперация = ПродажиСервер.ПолучитьХозяйственнуюОперациюРеализацииПоВозврату(ХозяйственнаяОперацияРеализация);
		КонецЕсли;

		Если ОбщегоНазначенияУТ.ПроверитьОперациюРаспоряжения(ДокументОснование, "РеализацияТоваровУслуг", ХозяйственнаяОперация) Тогда
			ПараметрыОснования.Вставить("ДокументОснование", ДокументОснование);
		Иначе
			Возврат Неопределено;
		КонецЕсли;

	Иначе

		РеквизитыШапки = Новый Структура;
		ИмяДокумента   = "РеализацияТоваровУслуг";

		Если НЕ ПродажиВызовСервера.СформироватьДанныеЗаполненияРеализации(ПараметрКоманды, ИмяДокумента, РеквизитыШапки) Тогда
			Возврат Неопределено;
		КонецЕсли;

		ПараметрыОснования.Вставить("РеквизитыШапки",      РеквизитыШапки);
		ПараметрыОснования.Вставить("ДокументОснование",   ПараметрКоманды);

	КонецЕсли;
	#Вставка
	//++ plotnikov@syspod.ru #84483
	Контрагент = ПараметрыОснования.РеквизитыШапки.Контрагент;
	ПараметрыОснования.РеквизитыШапки.БанковскийСчет = __СпОбщийМодуль.ЗаполнитьБанковскийСчет(Контрагент);
	//-- plotnikov@syspod.ru #84483
	#КонецВставки

	Возврат Новый Структура("Основание", ПараметрыОснования);

КонецФункции
