

&НаСервере
Процедура Расш1_ПрисоединенныеФайлыСсылкаНажатиеПослеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура Расш1_ПрисоединенныеФайлыСсылкаНажатиеПосле(Элемент, СтандартнаяОбработка)
	Расш1_ПрисоединенныеФайлыСсылкаНажатиеПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Расш1_ПоказатьФайлыПосле(Команда)
	
	ПараметрыФильтра = Новый Структура;
	ПараметрыФильтра.Вставить("ВладелецФайла", ЭтаФорма.Элементы.Список.ТекущиеДанные.Ссылка);	
	ОткрытьФорму("Справочник.ЗаказКлиентаПрисоединенныеФайлы.ФормаСписка",ПараметрыФильтра);
	
КонецПроцедуры


&НаКлиенте
Процедура Расш1_СписокПриАктивизацииСтрокиПосле(Элемент)
	Ф = ПолучитьПрикрепленныеФайлы(Элемент.ТекущиеДанные.Ссылка);
	Если Ф > 0 Тогда
		ЭтаФорма.Элементы.ПоказатьФайлы.Заголовок = "Файлы("+Строка(Ф)+")" ;
	Иначе
		ЭтаФорма.Элементы.ПоказатьФайлы.Заголовок = "Файлы(0)" ;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьПрикрепленныеФайлы(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаПрисоединенныеФайлы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЗаказКлиентаПрисоединенныеФайлы КАК ЗаказКлиентаПрисоединенныеФайлы
	               |ГДЕ
	               |	ЗаказКлиентаПрисоединенныеФайлы.ПометкаУдаления = &ПометкаУдаления
	               |	И ЗаказКлиентаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("ВладелецФайла",Ссылка); 
	
	Рез = Запрос.Выполнить().Выбрать();
	Возврат Рез.Количество();
КонецФункции

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	ПроверитьДоступ(); 
	
КонецПроцедуры        

&НаСервере
Процедура ПроверитьДоступ() 
	ТекПользователь = Пользователи.АвторизованныйПользователь();
	ГрП = Справочники.ГруппыПользователей.НайтиПоНаименованию("Отдел логистики"); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь",ТекПользователь);
	Строка = ГрП.Состав.НайтиСтроки(Отбор);
	Если Строка.Количество()>=1 Тогда  
		ЭтаФорма.Элементы.Список.КоманднаяПанель.ПодчиненныеЭлементы[0].Доступность = Ложь;
		ЭтаФорма.Элементы.Список.КоманднаяПанель.ПодчиненныеЭлементы[1].Доступность = Ложь;  
		ЭтаФорма.Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы[0].Доступность = Ложь;
		ЭтаФорма.Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы[1].Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры



