
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СканШК;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьПоискПеремещения();
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоискПеремещения() Экспорт
	
	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	СканШК = "";
	ЭтаФорма.Элементы.ИнфоЯчейка.Заголовок = "";
	ЭтаФорма.Элементы.ИнфоСодержимое.Заголовок = "";
КонецПроцедуры


&НаСервере
Процедура СканШКИзменениеТекстаРедактированияНаСервере(ШК)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	               |	СХК_СкладЯчейки.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
	               |		ПО СХК_ТоварыНаСкладеОстатки.Ячейка = СХК_СкладЯчейки.Ссылка
	               |ГДЕ
	               |	СХК_СкладЯчейки.ШтрихКод = &ШтрихКод
	               |	И СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 1
	               |	И СХК_ТоварыНаСкладеОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ШтрихКод",ШК);   
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>=1 Тогда
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Ложь;
		
		ЭтаФорма.Элементы.ИнфоЯчейка.Заголовок = Рез[0].Наименование;
		
		Инфо = "";
		
		Для Каждого стр из Рез Цикл
			
			Инфо = Инфо + Строка(стр.Номенклатура) + Символы.ПС + 
			Строка(стр.Серия) + Символы.ПС +
			Строка(стр.ВНаличииОстаток) + Символы.ПС + "---------------";
			
		КонецЦикла;
		
		ЭтаФорма.Элементы.ИнфоСодержимое.Заголовок = Инфо;
		
	Иначе
		ЭтаФорма.Элементы.Ошибка.Видимость = Истина;
		ЭтаФорма.Элементы.ИнфоЯчейка.Заголовок = "";
		ЭтаФорма.Элементы.ИнфоСодержимое.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СканШКИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры

