
Функция ПолучитьСКУДМетодPOST(Запрос) 
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку(); 
	Чтение = Новый ЧтениеJSON; 
	Чтение.УстановитьСтроку(ТелоЗапроса);
	Данные = ПрочитатьJSON(Чтение, Ложь);

	Если ТипЗнч(Данные) = Тип("Массив") Тогда 
		РезультатМассив = СХК_СКУДСервер.ТабельСкудСервер(Данные[0].ДатаНачала,Данные[0].ДатаОкончания);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РезультатМассив);
 	
	СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200); 
 		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8"); 
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	//Ответ.УстановитьТелоИзСтроки();	
	Иначе
		Ответ = Новый HTTPСервисОтвет(404); 
 	КонецЕсли;	
	
	
	Возврат Ответ;
КонецФункции

