
&НаСервере
Функция Расш1_ПроверкаСтатуса()
 	Возврат Объект.Статус <> Перечисления.СтатусыПеремещенийТоваров.Принято	
КонецФункции

&НаКлиенте
Процедура Расш1_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если  Расш1_ПроверкаСтатуса() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Не забудьте установить статус Принято!",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт	
КонецПроцедуры
