
&НаКлиенте
Процедура Расш1_Остатки04НаСМПосле(Команда)
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ТекстСообщения = НСтр("ru = 'Выберите организацию.';
								|en = 'Select company.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.Организация",,);
		
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВариантЗаполнения","БалансировкаВРПо04");
	ЗаполнениеНачало(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
&Вместо("ВопросЗаполнитьЗавершение")
Процедура Расш1_ВопросЗаполнитьЗавершение(Результат, ДополнительныеПараметры)
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Формирование движений
		Если ДополнительныеПараметры.ВариантЗаполнения = "Сторно" Тогда
			СформироватьДвиженияСторноСервер();
		ИначеЕсли ДополнительныеПараметры.ВариантЗаполнения = "БалансировкаВРПоДоговорамАренды" Тогда
			ЗаполнитьБалансировкаВРПоДоговорамАрендыНаСервере();
		ИначеЕсли ДополнительныеПараметры.ВариантЗаполнения = "ОстаткиНУ" Тогда
			ЗаполнитьНУНаСервере();
		ИначеЕсли ДополнительныеПараметры.ВариантЗаполнения = "ОстаткиПриростаСтоимостиВНА" Тогда
			ЗаполнитьОстаткиПриростаСтоимостиВНАНаСервере();
		ИначеЕсли ДополнительныеПараметры.ВариантЗаполнения = "БалансировкаВРПо04" Тогда
			Заполнить04НаСервере("10.04");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Заполнить04НаСервере(Счет)
	
	ОчиститьДвижения();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
|	ХозрасчетныйОстатки.Счет КАК Счет,
|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
|	ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
|	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
|	ХозрасчетныйОстатки.Валюта КАК Валюта,
|	ХозрасчетныйОстатки.Подразделение КАК Подразделение,
|	ХозрасчетныйОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
|	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
|	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
|	ХозрасчетныйОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт,
|	ХозрасчетныйОстатки.КоличествоОстатокКт КАК КоличествоОстатокКт
|ИЗ
|	РегистрБухгалтерии.Хозрасчетный.Остатки(
|			&Период,
|			Счет.Код = ""10.04"",
|			,
|			Организация = &Организация
|				И Субконто2 = &Склад
|				И Подразделение = &Подразделение) КАК ХозрасчетныйОстатки";
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоНаименованию("СМ Склад сырья и материалов"));
	Запрос.УстановитьПараметр("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Объект.Содержание = "Ввод остатков НУ по данным БУ";
	Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Отдел складской логистики");	
	Пока Выборка.Следующий() Цикл
		
		Проводка = Объект.Движения.Хозрасчетный.Добавить();
		Проводка.Период = Объект.Дата;
		Проводка.Организация = Объект.Организация;
		Проводка.Активность = Ложь;
		Проводка.Содержание = Объект.Содержание;
		
		Постфикс = ?(Выборка.СуммаОстатокДт = 0, "Кт", "Дт");
		
		Проводка["Счет" + Постфикс] = Выборка.Счет;
		Проводка["Счет" + ?(Выборка.СуммаОстатокДт = 0, "Дт", "Кт")] = ПланыСчетов.Хозрасчетный.НайтиПоКоду(Счет);
		Проводка["Валюта" + Постфикс] = Выборка.Валюта;
		Проводка["Подразделение" + Постфикс] = Подразделение;
		Проводка["НаправлениеДеятельности" + Постфикс] = Выборка.НаправлениеДеятельности;
		Проводка["Сумма"] = Выборка["СуммаОстаток" + Постфикс];
		Проводка["СуммаНУДТ"] = Выборка["СуммаОстаток" + Постфикс];
		Проводка["СуммаНУКТ"] = Выборка["СуммаОстаток" + Постфикс];
		Проводка["КоличествоДТ"] = Выборка["КоличествоОстаток" + Постфикс];
		Проводка["КоличествоКТ"] = Выборка["КоличествоОстаток" + Постфикс];
		
		Проводка["СубконтоДТ1"] = Выборка.Субконто1;
		Проводка["СубконтоДТ2"] = Выборка.Субконто2;
		Проводка["СубконтоДТ3"] = Подразделение;

		Проводка["СубконтоКТ1"] = Выборка.Субконто1;
		Проводка["СубконтоКТ2"] = Выборка.Субконто2;
		Проводка["СубконтоКТ3"] = Подразделение;
		
	КонецЦикла;
	
	ОбновитьИтогиПоДокументу(ЭтотОбъект);
	УстановитьДоступностьСубконто();
	ОбновитьФорму();
	
КонецПроцедуры
