
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//+svinarenko@syspod.ru 86039	
	ТекстЗапрос=ЭтотОбъект.СписокПлатежей.ТекстЗапроса;
	
	ТекстЗапросаЕстьФайл=СтрЗаменить(ТекстЗапрос,	"	РеестрДокументов.ДатаДокументаИБ КАК Дата,",
		"	РеестрДокументов.ДатаДокументаИБ КАК Дата, ЕСТЬNULL (НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы,");
   ТекстЗапросаЕстьФайл=СтрЗаменить(ТекстЗапросаЕстьФайл,	"	ПО ДанныеПоступленияБезналичныхДС.Ссылка = РеестрДокументов.Ссылка",
		"			ПО ДанныеПоступленияБезналичныхДС.Ссылка = РеестрДокументов.Ссылка"
	+"	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов"+
	"	ПО РеестрДокументов.Ссылка = НаличиеФайлов.ОбъектСФайлами");

     ЭтотОбъект.СписокПлатежей.ТекстЗапроса=ТекстЗапросаЕстьФайл;
	
	
    НоваяКолонкаТаблицы = Элементы.Вставить("ЕстьФайлы",Тип("ПолеФормы"),Элементы.СписокПлатежей, Элементы.ГруппаПроведеноБанком);
  //  Элементы.ГруппаПроведеноБанком);   //Перед какой колонкой будет стоять
    НоваяКолонкаТаблицы.ПутьКДанным = "СписокПлатежей.ЕстьФайлы";     
    НоваяКолонкаТаблицы.Заголовок = "Есть Файл";
    НоваяКолонкаТаблицы.Вид = ВидПоляФормы.ПолеКартинки;  
	НоваяКолонкаТаблицы.КартинкаЗначений = БиблиотекаКартинок["Прикрепить"];	
    НоваяКолонкаТаблицы.КартинкаШапки=БиблиотекаКартинок["Прикрепить"]; 
    НоваяКолонкаТаблицы.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет; //оставляем только картинку
//svinarenko@syspod.ru 86039	
	
	
	
	
КонецПроцедуры
