
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаСписка = НачалоДня(ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаСписка - 3*86400);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ДатаСписка + 3*86400 );
	Список.Параметры.УстановитьЗначениеПараметра("СкладОтправитель",Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("06d33cab-5ab7-11e5-9f19-00155d000c02")));

КонецПроцедуры

&НаКлиенте
Процедура ДатаСпискаПриИзменении(Элемент)
	ДатаСпискаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаСпискаПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаСписка - 3*86400);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ДатаСписка + 3*86400 );
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",Элемент.ТекущиеДанные.Ссылка);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

