
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаСписка = НачалоДня(ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаСписка - 3*86400);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ДатаСписка + 3*86400 );
	Список.Параметры.УстановитьЗначениеПараметра("СкладОтправитель",Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("06d33cab-5ab7-11e5-9f19-00155d000c02")));

КонецПроцедуры

&НаКлиенте
Процедура ДатаСпискаПриИзменении(Элемент)
	ДатаСпискаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаСпискаПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаСписка - 3*86400);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ДатаСписка + 3*86400 );
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",Элемент.ТекущиеДанные.Ссылка);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура СканQRПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

//&НаКлиенте
//Процедура СканПОрдераСБИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) 
//	СтартТайминг() ;
//	СтатусПОрдераСБ = ПроверитьСтатусПОрдераСБ(Текст); 
//	Если СтатусПОрдераСБ = Истина Тогда 
//		Элементы.ГруппаКнопкиСБ.Видимость = Истина;
//	Иначе
//		ЭтаФорма.Элементы.ИнфоОрдераСБ.Заголовок =  СтатусПОрдераСБ;       
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Функция НайтиПеремещение(УИД) 
	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("СМ Склад сырья и материалов");
	СкладПолучатель = Справочники.Склады.НайтиПоНаименованию("ЦМ Цех Мюсли");
	Попытка
		Док = Документы.ЗаказНаПеремещение.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Исключение
		Док = Неопределено;
	КонецПопытки;
	
	Если Док = Неопределено ИЛИ Док.ПолучитьОбъект() = Неопределено Тогда 
		ош = "Отсканируйте правильный qr код";
	Иначе 
		Если Док.СкладОтправитель = СкладОтправитель И Док.СкладПолучатель = СкладПолучатель Тогда
			ош = Док.Ссылка; 
		Иначе
			ош = "Не верный склад";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ош;
			
		
КонецФункции

&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.Ошибка.Заголовок = "";
	ДокСсылка = НайтиПеремещение(Текст) ;    
	Если ТипЗНЧ(ДокСсылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ДокСсылка);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе 
		Элементы.Ошибка.Заголовок = ДокСсылка;
	КонецЕсли;
	
КонецПроцедуры
