
//&После("УстановкаПараметровСеанса")
//Процедура Расш1_УстановкаПараметровСеанса(ТребуемыеПараметры)
//	ТекПользователь = Пользователи.АвторизованныйПользователь();
//	ТСД = Справочники.ГруппыПользователей.НайтиПоНаименованию("ТСД"); 
//	Отбор = Новый Структура;
//	Отбор.Вставить("Пользователь",ТекПользователь);
//	Строка = ТСД.Состав.НайтиСтроки(Отбор);
//	Если Строка.Количество()>=1 Тогда 
//		Сообщить("");
//		//ПараметрыФормыОстатки = Новый Структура;
//		//АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
//		//_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
//		////ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
//		//ОткрытьФорму("Обработка.МобильныйСклад.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.Независимый);
//	КонецЕсли;

//КонецПроцедуры

