
&НаСервере
Процедура ОбработкаЗаписиНовогоНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОбработкаЗаписиНовогоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	Запись.Автор = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ПередЗаписьюНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
КонецПроцедуры




&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если НачалоДня(Запись.Период) < НачалоДня(ТекущаяДата()) ИЛИ Запись.Количество <> 0 Тогда
		ЭтаФорма.Доступность = Ложь;
		Если РольДоступна("СХК_КоординаторПланированияПроизводства") ИЛИ РольДоступна("ПолныеПрава") Тогда
			Если НачалоДня(ТекущаяДата())+ 86400 <=  НачалоДня(Запись.Период) Тогда
					ЭтаФорма.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Запись.Период = ТекущаяДата()+86400;	
	КонецЕслИ;
	
//	Если РольДоступна("ПолныеПрава") Тогда
//		ЭтаФорма.Доступность = Истина;
//	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	Если НачалоДня(Запись.Период)+86400 <= НачалоДня(ТекущаяДата())+86400 Тогда
		Запись.Период = ТекущаяДата()+86400;
	ИначеЕсли Запись.Период > НачалоДня(ТекущаяДата()) + 86400*45 Тогда
		Запись.Период = НачалоДня(ТекущаяДата()) + 86400*45;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриПовторномОткрытииНаСервере()

	ЭтаФорма.Доступность = Ложь;

	Если РольДоступна("СХК_ОператорПланированияПроизводства") Тогда
		Если НачалоДня(ТекущаяДата()) =  НачалоДня(Запись.Период)+ 86400 Тогда
				ЭтаФорма.Доступность = Истина;
		КонецЕсли;
	ИначеЕсли РольДоступна("СХК_КоординаторПланированияПроизводства") ИЛИ РольДоступна("ПолныеПрава") Тогда
		Если НачалоДня(ТекущаяДата()) <=  НачалоДня(Запись.Период) + 86400*45 И НачалоДня(Запись.Период) >= НачалоДня(ТекущаяДата()) + 86400 Тогда
				ЭтаФорма.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
								
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ПриПовторномОткрытииНаСервере();
КонецПроцедуры



