
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	ЭтаФорма.ДокументОрдер = Документы.РасходныйОрдерНаТовары.ПустаяСсылка();

	Если СтруктураПараметров.ДокументОрдер <> "" Тогда
		ДокументОрдер = СтруктураПараметров.ДокументОрдер;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТЧ();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	ЭтаФорма.ТЧЯчеек.Очистить();
	ЭтаФорма.ТЧЯчеек.Загрузить(СХК_ТСДСклад.ПоискОрдераЯчейки(ЭтаФорма.ДокументОрдер));
	
КонецПроцедуры

&НаКлиенте
Процедура СканЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ВыборЯчейки(Текст) = Истина Тогда

	Иначе
		ОткрытьФормуСообщения("Неверный штрихкод ячейки");	
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ВыборЯчейки(Текст) 

	Ош = Истина;
	
	Я = Справочники.СХК_СкладЯчейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(Текст));
	Если Я.Пустая() = Ложь Тогда 
        Т = ТЧЯчеек.Добавить();
		Т.Ячейка = Я;
		Ош = Истина;
	Иначе
		Ош = Ложь;
	КонецЕсли;
	
	Возврат Ош; 
	
КонецФункции


&НаКлиенте
Процедура ОткрытьФормуСообщения(Сообщение) 
	Отбор = Новый Структура;
	Отбор.Вставить("Ошибка",Строка(Сообщение));
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(Отбор,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСообщения", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСообщений", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСообщения(Значение, ДопПараметры) Экспорт 
						
КонецПроцедуры

&НаКлиенте
Процедура Разместить(Команда)
	РазместитьНаСервере();   
	ЭтаФорма.Закрыть();
КонецПроцедуры  

&НаСервере
Процедура РазместитьНаСервере()
	Таб = ЭтаФорма.ТЧЯчеек.Выгрузить();
	Таб.Свернуть("Ячейка");
	
	Для Каждого стр из Таб Цикл
		НоваяЗапись = РегистрыСведений.СХК_РазмещениеОрдер.СоздатьМенеджерЗаписи();
    	НоваяЗапись.Период = ТекущаяДата();
    	НоваяЗапись.ДокументОрдер = ДокументОрдер.Ссылка;
    	НоваяЗапись.Ячейка = стр.Ячейка;
	    НоваяЗапись.Записать(Истина);
	КонецЦикла;
	
	
КонецПроцедуры




