Функция ПолучитьМассивЗУП(СтрокаДляОтвета) Экспорт

	Соединение = Новый HTTPСоединение(
	    "192.168.88.151/zup/hs/exchange_erp/", 
	    //"192.168.0.10/zup_dev/hs/exchange_erp/", 
		,"smartbar","fqdl76zcP9",,60,);
		
		АдресРесурса = "/UploadData/";
		
		Заголовки = Новый Соответствие;
		
		Заголовки.Вставить("Content-Type", "text/plain;charset=UTF-8");
	
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);

	//СтрокаДляОтвета =  Интервал();
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтвета);

	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если Результат.КодСостояния = 200 Тогда
		РезультатМассив = ПростоеЧтениеJSON(Результат.ПолучитьТелоКакСтроку());
		Возврат РезультатМассив;	
	Иначе 
		Сообщить("Произошла ошибка");
	КонецЕсли;

КонецФункции


Процедура ОтправитьВСкуд(СтрокаДляОтвета) Экспорт
	Соединение = Новый HTTPСоединение(
	    "192.168.88.151/zup/hs/exchange_erp/", 
	    //"192.168.0.10/zup_dev/hs/exchange_erp/", 
		,"smartbar","fqdl76zcP9",,60,);
		
		АдресРесурса = "/UploadSkud/";
		
		Заголовки = Новый Соответствие;
		
		Заголовки.Вставить("Content-Type", "text/plain;charset=UTF-8");
	
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);


	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтвета);

	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	
КонецПроцедуры   

Функция ПростоеЧтениеJSON(Данные)
	
	//@skip-check bsl-legacy-check-type-environments
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Данные);  		
	//@skip-check undefined-function
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

