
&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка, МассивИменРасшифровки)
	Данные  = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();	
	Для Каждого ИмяРасшифровки Из МассивИменРасшифровки Цикл
		Поле = Поля.Найти(ИмяРасшифровки);
		Если Поле <> Неопределено Тогда 
			Возврат Поле.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	МассивИменРасшифровки = Новый Массив();
	МассивИменРасшифровки.Добавить("Номер");
	МассивИменРасшифровки.Добавить("ДатаЗаказа");
	НомерЗаказа = РезультатОбработкаРасшифровкиНаСервере(Расшифровка, МассивИменРасшифровки);
	Если НомерЗаказа <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДатаЗаказа =  РезультатОбработкаРасшифровкиНаСервере(Расшифровка+1,МассивИменРасшифровки);
		СсылкаЗаказ = ПолучитьЗаказПоНомеруИДате(НомерЗаказа, ДатаЗаказа);
		Если СсылкаЗаказ <> Неопределено Тогда
			ПараметрыФормы = Новый Структура("Ключ", СсылкаЗаказ);
			ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
&НаСервере
Функция ПолучитьЗаказПоНомеруИДате(НомерЗаказа, ДатаЗаказа) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Номер = &Номер
		|	И НАЧАЛОПЕРИОДА(ЗаказКлиента.Дата) = &Дата";
	
	Запрос.УстановитьПараметр("Дата", ДатаЗаказа);
	Запрос.УстановитьПараметр("Номер", НомерЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции	