&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если СтруктураПараметров.Номенклатура <> "" Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Владелец",СтруктураПараметров.Номенклатура);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	УстановитьУпаковку(Элемент.ТекущиеДанные.Ссылка);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура УстановитьУпаковку(Ссылка)
	ЭтаФорма.Упаковка = Ссылка;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Упаковка",ЭтаФорма.Упаковка);
	ОповеститьОВыборе(СтуктураВозврат); 
КонецПроцедуры
