
&НаСервере
&Вместо("ХозяйственнаяОперацияПриИзмененииСервер")
Процедура Расш1_ХозяйственнаяОперацияПриИзмененииСервер()
		ЭтоСборкаТоваров = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	ДоступныеОстаткиПараметрыВстраивания = Неопределено;
	ПараметрыВстраивания = Документы.ЗаказНаСборку.ДоступныеОстаткиПараметрыВстраивания(Объект);
	ОбеспечениеВДокументахСервер.ДоступныеОстаткиПриСозданииНаСервере(ЭтотОбъект, ПараметрыВстраивания);
	
	УстановитьСвойстваЭлементовФормыХозяйственнаяОперация();
	Объект.Назначение = Неопределено;
	Объект.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ПустаяСсылка();
	НаправлениеДеятельностиПриИзмененииСервер();
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказНаСборку));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.ТЧ);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий.Шапка);
	НастроитьЭлементыСерий();
	
	Если ЭтоСборкаТоваров Тогда
		
		СтруктураДействий = Новый Структура();
		ДобавитьДействияОбеспеченияНаСервере(СтруктураДействий, "ВариантОбеспечения");
		КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		СтрокиТаблицы = Объект.Товары.НайтиСтроки(
			Новый Структура("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.ПустаяСсылка()));
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			СтрокиТаблицы,
			СтруктураДействий,
			Объект.Товары,
			КэшированныеЗначения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Расш1_ЗаданиеЭтикеткиПосле(Команда)
	С = ПроверитьСтроку();
	Если С = Ложь Тогда
		Предупреждение("Не заполнена номенклатура или серия"); 
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Номенклатура",Объект.Номенклатура);
		ПараметрыФормы.Вставить("Серия",Объект.СХК_СерииНоменклатуры);
		ПараметрыФормы.Вставить("Ссылка",С);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормы,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("РегистрСведений.СХК_ЗаданиеНаПечатьЭтикеток.Форма.ФормаЗаписи", _Параметры,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьСтроку()
	Если Объект.Номенклатура.Пустая() = Истина ИЛИ Объект.СХК_СерииНоменклатуры.Пустая() Тогда
		Возврат Ложь;
	Иначе
		Возврат Объект.Ссылка; 
	КонецЕсли;
КонецФункции 



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерииИзСписка(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		Объект.СХК_СерииНоменклатуры = ПолучитьСериюПоНомеру(Значение.Номер);		
	КонецЕсли;
	
 	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры     

&НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Объект.Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции

&НаКлиенте
Процедура Расш1_СХК_СерииНоменклатурыНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Номенклатура = ПолучитьНоменклатуру();	
	ВидНоменклатуры = ПолучитьВидНоменклатуры(); 
	
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура", ВидНоменклатуры,Номенклатура );
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерииИзСписка", ЭтаФорма);
	
	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСписка", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция ПолучитьНоменклатуру()
	Возврат Объект.Номенклатура;
КонецФункции 

&НаСервере
Функция ПолучитьВидНоменклатуры()
	Возврат Объект.Номенклатура.ВидНоменклатуры;
КонецФункции 


