
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьПолеПоискШКQr();
КонецПроцедуры  

&НаКлиенте
Процедура АктивироватьПолеПоискШКQr() Экспорт
	
	ЭтаФорма.Элементы.ПоискШКQr.РедактированиеТекста = Истина;
	ОчиститьШКСервер(); 
	Элементы.ПоискШКQr.ОбновитьТекстРедактирования();
	Элементы.ПоискШКQr.Видимость = Ложь;
	Элементы.ПоискШКQr.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПоискШКQr; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ПоискШКQr = "";
КонецПроцедуры


&НаКлиенте
Процедура ПоискШКQrИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ПроверкаНаЧисло(Текст) = Истина Тогда
		ЭтаФорма.Элементы.ТекстО.Заголовок = "Отсканируйте qr код"; 
		АктивироватьПолеПоискШКQr();
	Иначе
		ЭтаФорма.Элементы.ГруппаНоменклатура.Видимость = Истина;
		Мас = Новый Массив;
		Если СтрНайти(Текст, ";") = 0 Тогда
			Если НайтиНоменклатуруПоСерии(Текст) = Истина Тогда
				ОткрытьФормуФормаСканШК(Текст);		
			Иначе
				ОткрытьФормуСообщения("Номенклатура не найдена"); 
				АктивироватьПолеПоискШКQr();
			КонецЕсли;
		Иначе
			Мас = Разложить(Текст,";");
			Если НайтиНоменклатуруПоСерии(Мас[0]) = Истина Тогда 
				Если ЗаполнитьСведенияУпаковка(Мас[1]) = Истина Тогда
					АктивироватьПолеОткуда();
				Иначе
					ОткрытьФормуСообщения("Упаковка не найдена"); 
				КонецЕсли;					
			Иначе
				ОткрытьФормуСообщения("Номенклатура не найдена"); 
				АктивироватьПолеПоискШКQr();
			КонецЕсли;
				
		КонецЕсли;
			
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуФормаСканШК(Штр) 
		Отбор = Новый Структура;
		Отбор.Вставить("Штрих",Штр);
		Отбор.Вставить("Серия",ЭтаФорма.Серия);
		Отбор.Вставить("Номенклатура",ЭтаФорма.Номенклатура);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(Отбор,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСообщенияСканШК", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСканШК", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСообщенияСканШК(Значение, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(Значение) Тогда
		Если Значение.Ош = Истина Тогда 
			Если ЗаполнитьСведенияУпаковка(Значение.Штр) = Истина Тогда
				АктивироватьПолеОткуда();
			Иначе
				ОткрытьФормуСообщения("Упаковка не найдена"); 
			КонецЕсли;					
		Иначе
			ОткрытьФормуСообщения(Строка(Значение.Ошибка));	
		КонецЕсли;
	Иначе
		ОткрытьФормуСообщения("Штрих код не найден");	
	КонецЕсли;
	
	
КонецПроцедуры  


&НаКлиенте
Процедура АктивироватьПолеОткуда() 
	ОчиститьАдресОткуда(); 
	Элементы.СканОткуда.ОбновитьТекстРедактирования();
	Элементы.СканОткуда.Видимость = Ложь;
	Элементы.СканОткуда.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканОткуда; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьАдресОткуда()
	СканОткуда = ""; 
	ЭтаФорма.ЯчейкаОтправитель =  Справочники.СХК_СкладЯчейки.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура АдресОткудаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) 
	ош = СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресОткуда(Текст);
	Если СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресОткуда(Текст) = Истина Тогда  
		АктивироватьПоискКуда();
	Иначе
		ОткрытьФормуСообщения(Строка(ош));	
	КонецЕсли;
КонецПроцедуры  


&НаСервере
Функция СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресОткуда(ШтрихКод)   
	спрЯчейка = Справочники.СХК_СкладЯчейки.НайтиПоРеквизиту("ШтрихКод",ШтрихКод); 
	Если спрЯчейка.Пустая() Тогда
		Возврат "Ячейка не найдена";
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СХК_СкладЯчейки.Ссылка КАК Ссылка
		               |ИЗ
		               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
		               |		ПО СХК_ТоварыНаСкладеОстатки.Ячейка = СХК_СкладЯчейки.Ссылка
		               |ГДЕ
		               |	СХК_ТоварыНаСкладеОстатки.Номенклатура = &Номенклатура
		               |	И СХК_СкладЯчейки.Ссылка = &Ссылка";   
		Запрос.УстановитьПараметр("Ссылка",спрЯчейка.Ссылка); 
		Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура); 
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЯчейкаОтправитель = Результат.Ссылка; 
			Возврат Истина;
		Иначе
			Возврат "Товара нет в ячейке";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура АктивироватьПоискКуда() 
	ОчиститьАдресКуда();
	Элементы.СканКуда.ОбновитьТекстРедактирования();
	Элементы.СканКуда.Видимость = Ложь;
	Элементы.СканКуда.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканКуда; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьАдресКуда()
	СканКуда = ""; 
	ЭтаФорма.ЯчейкаПолучатель =  Справочники.СХК_СкладЯчейки.ПустаяСсылка();
КонецПроцедуры


&НаКлиенте
Процедура СканЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) 
	
	НаполнениеЯчейки = СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресКуда(Текст);
	
	Если НаполнениеЯчейки = Истина Тогда  
		Элементы.Количество.Доступность = Истина;
		АктивироватьПолеКоличество();
	Иначе 
		Элементы.Количество.Доступность = Ложь;
		ОткрытьФормуСообщения(НаполнениеЯчейки);	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресКуда(ШтрихКод)   

	спрЯчейка = Справочники.СХК_СкладЯчейки.НайтиПоРеквизиту("ШтрихКод",ШтрихКод); 
	Если спрЯчейка.Пустая() Тогда
		Возврат "Ячейка не найдена";
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СХК_СкладЯчейки.Ссылка КАК Ссылка,
		               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		               |	ВЫБОР
		               |		КОГДА СХК_СкладЯчейки.Ссылка.ВМестимость = ЗНАЧЕНИЕ(Перечисление.СХК_ВМестимость.Палет)
		               |					И СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток <= 20000
		               |				ИЛИ СХК_СкладЯчейки.Ссылка.ВМестимость = ЗНАЧЕНИЕ(Перечисление.СХК_ВМестимость.Сборный)
		               |					И СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток <= 200000
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Разрешено
		               |ИЗ
		               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
		               |		ПО СХК_ТоварыНаСкладеОстатки.Ячейка = СХК_СкладЯчейки.Ссылка
		               |ГДЕ
		               |	СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";   
		Запрос.УстановитьПараметр("Ячейка",спрЯчейка); 
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда  
			Если Результат.Разрешено = Истина ИЛИ ШтрихКод = "0000003720000" Тогда
				ЭтаФорма.ЯчейкаПолучатель = Результат.Ссылка; 
				Возврат Истина;
			Иначе
				Возврат "Ячейка переполнена";
			КонецЕсли;
		Иначе
			Возврат "Ошибка по ячейке";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура АктивироватьПолеКоличество() 
	ОчиститьКоличество();
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьКоличество()
	Количество = 0; 
	ЭтаФорма.Количество =  0;
КонецПроцедуры

////////////////////////////////////////////////////////////////////// 
&НаКлиенте
Процедура ОткрытьФормуСообщения(Сообщение) 
	Отбор = Новый Структура;
	Отбор.Вставить("Ошибка",Строка(Сообщение));
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(Отбор,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСообщения", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСообщений", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСообщения(Значение, ДопПараметры) Экспорт 
						
КонецПроцедуры


&НаСервере
Функция НайтиНоменклатуруПоСерии(Сер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	               |	ДвиженияСерийТоваров.Серия КАК Серия
	               |ИЗ
	               |	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	               |ГДЕ
	               |	ДвиженияСерийТоваров.Серия.Наименование = &Наименование
	               |	И (ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства)
	               |			ИЛИ ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту)
	               |			ИЛИ ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаСобранныхКомплектов))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДвиженияСерийТоваров.Регистратор УБЫВ";

	Запрос.УстановитьПараметр("Наименование",Сер);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Серия = Рез[0].Серия;
		ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСведенияУпаковка(Штр) 

    ЭтаФорма.УпаковкаУп = СХК_ТСДСклад.ЗаполнитьУпаковкаУп(Штр,ЭтаФорма.Номенклатура); 
	Если ЭтаФорма.УпаковкаУп <> Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


//////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции 

Функция Разложить(Знач Стр, Разделитель = ";") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	Возврат Список;
	
КонецФункции 

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПереместитьНаСервере() 
	Ош = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СХК_Перемещение.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СХК_Перемещение КАК СХК_Перемещение
	               |ГДЕ
	               |	СХК_Перемещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И СХК_Перемещение.ПометкаУдаления = &ПометкаУдаления
	               |	И СХК_Перемещение.Проведен = &Проведен
	               |	И СХК_Перемещение.Автор = &Автор"; 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
	Запрос.УстановитьПараметр("Автор", Пользователи.АвторизованныйПользователь()); 

	Рез = Запрос.Выполнить().Выбрать();
	
	Если ЭтаФорма.Количество <=0 Тогда
		Сообщить("Заполните количество")

	Иначе
		Если Рез.Следующий() Тогда
			ТекДок = Рез.Ссылка.ПолучитьОбъект();
		Иначе
			ТекДок = Документы.СХК_Перемещение.СоздатьДокумент();
			ТекДок.Дата = ТекущаяДатаСеанса(); // Использование ТекущаяДатаСеанса() вместо ТекущаяДата()
		КонецЕсли;
		Если ЭтаФорма.ЯчейкаОтправитель <> Справочники.СХК_СкладЯчейки.ПустаяСсылка() И ЭтаФорма.ЯчейкаПолучатель <> Справочники.СХК_СкладЯчейки.ПустаяСсылка() Тогда
				Если ЭтаФорма.Количество>0 И 
							ЭтаФорма.Количество <= СХК_ТСДСклад.ОстатокЯчейкаНоменклатура(ЭтаФорма.ЯчейкаОтправитель,ЭтаФорма.Номенклатура,ЭтаФорма.Серия.Номер ,ТекДок.Дата ) Тогда
							 
						НоваяСтрока = ТекДок.ТЧТовары.Добавить();
						НоваяСтрока.Номенклатура = ЭтаФорма.Номенклатура;
						НоваяСтрока.Серия = ЭтаФорма.Серия;
						НоваяСтрока.ТекЯчейка = ЭтаФорма.ЯчейкаОтправитель;
						НоваяСтрока.НЯчейка = ЭтаФорма.ЯчейкаПолучатель;
						НоваяСтрока.Количество = ЭтаФорма.Количество;
						НоваяСтрока.Время = ТекущаяДата();
						Попытка
							ТекДок.Записать(РежимЗаписиДокумента.Проведение);
							Ош = Истина;
						Исключение
						    Ош = "Ошибка перемещения";
						КонецПопытки;
						
					Иначе
						Ош = "Не достаточно товара в ячейка";
					КонецЕсли; 
			Иначе
					Ош = "Отсканируйте ячейки еще раз!!!";
			КонецЕсли;
	КонецЕсли;

	Возврат Ош;
КонецФункции


&НаКлиенте
Процедура Переместить(Команда)
	Если ПроверитьВместимость() Тогда	
		ОшибкаВозврата = ПереместитьНаСервере();
		Если ОшибкаВозврата <> Истина Тогда 
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПереместить", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,Строка(ОшибкаВозврата),5,"ОШИБКА ПЕРЕМЕЩЕНИЯ");
		Иначе	
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПереместить", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Нет места в ячейка",5,"ОШИБКА ПЕРЕМЕЩЕНИЯ");
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеПереместить(Параметры) Экспорт  

КонецПроцедуры  


&НаСервере
Функция ПроверитьВместимость() 
	Если ЭтаФорма.ЯчейкаПолучатель.ШтрихКод = "0000003720000" Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВЫБОР
	|		КОГДА СХК_ТоварыНаСкладеОстатки.Ячейка.ВМестимость = ЗНАЧЕНИЕ(Перечисление.СХК_ВМестимость.Палет)
	|			ТОГДА 20000 - СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток
	|		ИНАЧЕ 200000 - СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК Лимит
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";   
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.ЯчейкаПолучатель); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Если Результат.Лимит >= ЭтаФорма.Количество Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции





