
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//zaitsev@syspod.ru 77894

	ТаблицаФормы = Элементы.Список;
			КолонкаВставки = ТаблицаФормы.ПодчиненныеЭлементы.Найти("СписокСуммаДокумента");	 
			НовыйЭлемент = Элементы.Вставить("ЕстьФайлыСкрепка", Тип("ПолеФормы"), ТаблицаФормы, КолонкаВставки);
			Список.ТекстЗапроса=СтрЗаменить(Список.ТекстЗапроса, "ДокументЗаказПоставщику.Дата КАК Дата,", "ДокументЗаказПоставщику.Дата КАК Дата,"+Символы.ПС+"НаличиеПрисоединенныхФайлов.ЕстьФайлы КАК ЕстьФайлыСкрепка,");
			////Список.ТекстЗапроса=СтрЗаменить(Список.ТекстЗапроса,"Документ.ЗаказПоставщику КАК ДокументЗаказПоставщику","Документ.ЗаказПоставщику КАК ДокументЗаказПоставщику"+Символы.ПС+"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеПрисоединенныхФайлов ПО ДокументЗаказПоставщику.Ссылка = НаличиеПрисоединенныхФайлов.ОбъектСФайлами}");
			Список.ТекстЗапроса=СтрЗаменить(Список.ТекстЗапроса,"ДокументЗаказПоставщику.Ссылка)}","ДокументЗаказПоставщику.Ссылка)}"+Символы.ПС+"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеПрисоединенныхФайлов ПО ДокументЗаказПоставщику.Ссылка = НаличиеПрисоединенныхФайлов.ОбъектСФайлами}");
			НовыйЭлемент.ПутьКДанным = "Список.ЕстьФайлыСкрепка";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;
			НовыйЭлемент.КартинкаЗначений=БиблиотекаКартинок.Скрепка;  
			НовыйЭлемент.КартинкаШапки=БиблиотекаКартинок.Скрепка; 
			НовыйЭлемент.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет; 
			
			Элементы.Список.УстановитьДействие("Выбор","Расш1_СписокВыборПосле");
       //zaitsev@syspod.ru 77894
КонецПроцедуры
//zaitsev@syspod.ru 77894
&НаКлиенте
Процедура Расш1_СписокВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЕстьФайлыСкрепка" Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаСписка = Элементы.Список.ТекущиеДанные;
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
			Новый Структура("ВладелецФайла", СтрокаСписка.Ссылка),
			ЭтаФорма);
	КонецЕсли;
	
	//Если Поле = Элементы.СостояниеЭДО Тогда
	//	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	//	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
	//	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	//КонецЕсли;
КонецПроцедуры
//zaitsev@syspod.ru 77894
