
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
   ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	
   Админ = Справочники.ГруппыПользователей.НайтиПоНаименованию("Администраторы"); 

	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь",ТекПользователь);
	Строка = Админ.Состав.НайтиСтроки(Отбор);                               
	Если Строка.Количество()>=1 Тогда
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = Истина;		
	КонецЕсли; 

КонецПроцедуры
