
&НаКлиенте
Процедура СписокЗаказПоставщикуВыборЗначения(Элемент, Значение, СтандартнаяОбработка)


КонецПроцедуры


&НаКлиенте
Процедура СписокЗаказПоставщикуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ВыбраннаяСтрока);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаЗаказа", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказПоставщикуОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаСервере
Процедура ДатаСпискаПриИзмененииНаСервере()
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаСписка - 3*86400);
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ДатаСписка + 3*86400 );
КонецПроцедуры

&НаКлиенте
Процедура ДатаСпискаПриИзменении(Элемент)
	ДатаСпискаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаСписка = НачалоДня(ТекущаяДата());
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаСписка - 3*86400);
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ДатаСписка + 3*86400 );
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("Склад",Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("06d33cab-5ab7-11e5-9f19-00155d000c02")));
	 
КонецПроцедуры
