
&НаКлиенте
Процедура СписокЗаказПоставщикуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ЭтаФорма.Закрыть();
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",Элемент.ТекущиеДанные.Ссылка);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	//@skip-check notify-description-to-server-procedure
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаЗаказа", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	//СписокЗаказПоставщикуНаСервере();	
КонецПроцедуры


&НаКлиенте
Процедура ДатаСпискаПриИзменении(Элемент)
	СписокЗаказПоставщикуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДатаСписка = НачалоДня(ТекущаяДата());
	СписокЗаказПоставщикуНаСервере(); 
КонецПроцедуры    

&НаСервере
Процедура СписокЗаказПоставщикуНаСервере()
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДатаСписка) - 31 * 86400);
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецДня(ДатаСписка) + 7* 86400 );
	СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("Склад",Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("06d33cab-5ab7-11e5-9f19-00155d000c02"))); 
	//СписокЗаказПоставщику.Параметры.УстановитьЗначениеПараметра("Подразделение",Справочники.ПодразделенияОрганизаций.НайтиПоКоду("00-000017"));
КонецПроцедуры    
