
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//zaitsev@syspod.ru 77896
			//Элементы.СписокДокументыПродажи.Обновить(); 
			//СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			//СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
			//ИсхТекстаЗапроса = СписокДокументыПродажи.ТекстЗапроса; 
			////СвойстваСписка.ТекстЗапроса = СтрЗаменить(ИсхТекстаЗапроса, "РеестрДокументов.НомерДокументаИБ КАК Номер,", "РеестрДокументов.НомерДокументаИБ КАК Номер,"+Символы.ПС+"ВЫБОР КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы ЕСТЬ NULL ТОГДА ИСТИНА КОГДА НаличиеПрисоединенныхФайлов.ЕстьФайлы ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ЕстьФайлыСкрепка,");
			////СвойстваСписка.ТекстЗапроса = СтрЗаменить(ИсхТекстаЗапроса, "РегистрСведений.РеестрДокументов КАК РеестрДокументов","РегистрСведений.РеестрДокументов КАК РеестрДокументов"+Символы.ПС+"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеПрисоединенныхФайлов ПО РеестрДокументов.Ссылка = НаличиеПрисоединенныхФайлов.ОбъектСФайлами}");
			//ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДокументыПродажи, СвойстваСписка);
			ТаблицаФормы = Элементы.Список;
			КолонкаВставки = ТаблицаФормы.ПодчиненныеЭлементы.Найти("Организация");	 
			НовыйЭлемент = Элементы.Вставить("ЕстьФайлыСкрепка", Тип("ПолеФормы"), ТаблицаФормы, КолонкаВставки);
			Список.ТекстЗапроса=СтрЗаменить(Список.ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ"+Символы.ПС+"НаличиеПрисоединенныхФайлов.ЕстьФайлы КАК ЕстьФайлыСкрепка,");
			Список.ТекстЗапроса=СтрЗаменить(Список.ТекстЗапроса,"Документ.АктОРасхожденияхПослеОтгрузки КАК АктОРасхожденияхПослеОтгрузки","Документ.АктОРасхожденияхПослеОтгрузки КАК АктОРасхожденияхПослеОтгрузки"+Символы.ПС+"{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеПрисоединенныхФайлов ПО АктОРасхожденияхПослеОтгрузки.Ссылка = НаличиеПрисоединенныхФайлов.ОбъектСФайлами}");
			НовыйЭлемент.ПутьКДанным = "Список.ЕстьФайлыСкрепка";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;
			НовыйЭлемент.КартинкаЗначений=БиблиотекаКартинок.Скрепка;  
			НовыйЭлемент.КартинкаШапки=БиблиотекаКартинок.Скрепка; 
			НовыйЭлемент.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
       	Элементы.Список.УстановитьДействие("Выбор","Расш1_СписокВыборПосле");
       //zaitsev@syspod.ru 77894
КонецПроцедуры
//zaitsev@syspod.ru 77896
&НаКлиенте
Процедура Расш1_СписокВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЕстьФайлыСкрепка" Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаСписка = Элементы.Список.ТекущиеДанные;
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
			Новый Структура("ВладелецФайла", СтрокаСписка.Ссылка),
			ЭтаФорма);
	КонецЕсли;
	
	//Если Поле = Элементы.СостояниеЭДО Тогда
	//	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	//	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
	//	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	//КонецЕсли;
КонецПроцедуры
//zaitsev@syspod.ru 77896