
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Попытка
		СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Исключение
		СтруктураПараметров = Неопределено;
	КонецПопытки;
	
	Если СтруктураПараметров <> Неопределено Тогда
	
	    Запись.ЗаказНаПроизводств = СтруктураПараметров.Ссылка;
	    Запись.Номенклатура = СтруктураПараметров.Номенклатура;
	    Запись.Серия = СтруктураПараметров.Серия;
		Запись.Пользователь = Пользователи.АвторизованныйПользователь(); 
        //Запись.Вложение = СтруктураПараметров.Серия.СХК_Упаковка;
		Запись.ДатаПечати = ТекущаяДата();
		
		
		Если СтруктураПараметров.Серия.СХК_Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда 
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(СтруктураПараметров.Серия.СХК_Упаковка) + " вложение по (" +Строка(СтруктураПараметров.Серия.СХК_Упаковка.Родитель)+")";
		
			ЭтаФорма.СЗУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		
			Список = Новый СписокЗначений; 
			Список.Очистить();
			Список.Добавить(СтруктураПараметров.Серия.СХК_Упаковка);		
			Список.Добавить(СтруктураПараметров.Серия.СХК_Упаковка.Родитель);		
			ЭтаФорма.Элементы.СЗУпаковки.СписокВыбора.ЗагрузитьЗначения(Список.ВыгрузитьЗначения()); 
			
		Иначе
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(СтруктураПараметров.Серия.СХК_Упаковка);
			Запись.Вложение = СтруктураПараметров.Серия.СХК_Упаковка;
		КонецЕсли;
		
		
	Иначе 
		
		ЭтаФорма.ТолькоПросмотр = Истина; 
		ЭтаФорма.Элементы.СЗУпаковки.Видимость = Ложь;
		Если Запись.Серия.СХК_Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда 
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(Запись.Серия.СХК_Упаковка) + " вложение по (" +Строка(Запись.Серия.СХК_Упаковка.Родитель)+")";
		Иначе
			ЭтаФорма.Элементы.Информация.Заголовок = "Информация для печати: " + Строка(Запись.Серия.СХК_Упаковка);	    	
		КонецЕсли;
			
   КонецЕсли;
//
КонецПроцедуры

&НаКлиенте
Процедура СЗУпаковкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СЗУпаковкиПриИзмененииНаСервере(ВыбранноеЗначение);
КонецПроцедуры  

&НаСервере
Процедура СЗУпаковкиПриИзмененииНаСервере(Эл)  
	Запись.Вложение = Эл;

КонецПроцедуры


&НаКлиенте
Процедура Старт(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Статус = "" Тогда
		ТекущийОбъект.Статус = "Создан";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ППриИзмененииНаСервере()
	Если П = Истина Тогда
		ЭтаФорма.Элементы.ФормаЗаписатьИЗакрыть.Доступность = Истина;
	Иначе
		ЭтаФорма.Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ППриИзменении(Элемент)
	ППриИзмененииНаСервере();
КонецПроцедуры



