
&НаКлиенте
Процедура Расш1_НазначитьВсемПосле(Команда)
   Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНазначитьВсем",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Выполнить действие?",
        РежимДиалогаВопрос.ДаНет,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Заполнить географию продукта" // (необ.) заголовок
    );    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаНазначитьВсем(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьГеографиюПоВсем();
    КонецЕсли;	
 
КонецПроцедуры   

&НаСервере
Функция ЗаполнитьГеографиюПоВсем()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	               |ГДЕ
	               |	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
	               |	И НоменклатураКонтрагентов.ПометкаУдаления = &ПометкаУдаления"; 
		
		Запрос.УстановитьПараметр("ВладелецНоменклатуры",Объект.ВладелецНоменклатуры);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			спр = 	Рез.Ссылка.ПолучитьОбъект();
			спр.СХК_Представленность.Очистить();
			Для Каждого стр из Объект.СХК_Представленность Цикл
				Т = спр.СХК_Представленность.Добавить();
				Т.Направление = стр.Направление;
				Т.Область = стр.Область;
				Т.Город = стр.Город;
				Т.КолТТ = стр.КолТТ;
				Т.ТипТТ = стр.ТипТТ; 
			КонецЦикла;
			Попытка 
				спр.Записать();
			Исключение
				Сообщить("Не удалось записать " + Строка(Рез.Ссылка));
			КонецПопытки;
			
		КонецЦикла;
		
		
	Возврат "Выполнено";

КонецФункции

