Функция ОстатокЯчейкаНоменклатура(Ячейка,Номенклатура,Серия,ДатаЗапроса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаЗапроса,Ячейка = &Ячейка И 
	|																Номенклатура = &Номенклатура И
	|																Серия = &Серия	) КАК СХК_ТоварыНаСкладеОстатки";
	
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ВНаличииОстаток;
	Иначе
		Возврат 0 ;
	КонецЕсли;
	
КонецФункции

Функция ПоискОрдераЯчейки(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_РазмещениеОрдер.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.СХК_РазмещениеОрдер КАК СХК_РазмещениеОрдер
	|ГДЕ
	|	СХК_РазмещениеОрдер.ДокументОрдер = &ДокументОрдер";
	Запрос.УстановитьПараметр("ДокументОрдер",ДокументСсылка );
	
	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
		
КонецФункции 


Функция ПоискСХКСписание(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	СХК_СписаниеЯчейки.Ссылка КАК Ссылка,
	               |	СХК_СписаниеЯчейки.Собран КАК Собран
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки КАК СХК_СписаниеЯчейки
	               |ГДЕ
	               |	СХК_СписаниеЯчейки.ДокОснования = &ДокОснования
	               |	И СХК_СписаниеЯчейки.ПометкаУдаления = &ПометкаУдаления
	               |	И СХК_СписаниеЯчейки.Проведен = &Проведен";
	Запрос.УстановитьПараметр("ДокОснования",ДокументСсылка); 
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);   
	Запрос.УстановитьПараметр("Проведен",Истина);   
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Собран;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Функция ПоискЯчейкиШК(ШтрихКод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	СХК_СкладЯчейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
	               |ГДЕ
	               |	СХК_СкладЯчейки.ШтрихКод = &ШтрихКод";   
	Запрос.УстановитьПараметр("ШтрихКод",ШтрихКод); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;		
КонецФункции

Функция СодержимоеЯчейки(Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 1
	               |	И СХК_ТоварыНаСкладеОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |	И СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка",Ячейка);   
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции	


Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции   


Функция Разложить(Знач Стр, Разделитель = ";") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	Возврат Список;
	
КонецФункции



Функция ЗаполнитьУпаковкаУп(ШтрихКод,Номенклатура) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Штрихкод",ШтрихКод);
	//4630205928135
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		Возврат Рез.Упаковка; 
	Иначе
		ЗапросСпаек = Новый Запрос;
		ЗапросСпаек.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СХК_Спайки.ОснНоменклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ОсновнаяНоменклатура
		|ИЗ
		|	РегистрСведений.СХК_Спайки КАК СХК_Спайки
		|ГДЕ
		|	(СХК_Спайки.ДопНомеклатура = &Номенклатура
		|			ИЛИ СХК_Спайки.ОснНоменклатура = &Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновнаяНоменклатура КАК ВТ_ОсновнаяНоменклатура
		|		ПО (ШтрихкодыНоменклатуры.Номенклатура = ВТ_ОсновнаяНоменклатура.Номенклатура)
		|			И (ШтрихкодыНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка))
		|			
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
		ЗапросСпаек.УстановитьПараметр("Номенклатура",Номенклатура);
		ЗапросСпаек.УстановитьПараметр("Штрихкод",ШтрихКод);
		РезСпаек = ЗапросСпаек.Выполнить().Выбрать();
		Если РезСпаек.Следующий() Тогда 
			Возврат РезСпаек.Упаковка; 
		КонецЕсли;		
	КонецЕсли;

КонецФункции

Функция СписаниеСклад(ДокументОснования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СХК_СписаниеЯчейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки КАК СХК_СписаниеЯчейки
	               |ГДЕ
	               |	СХК_СписаниеЯчейки.ДокОснования = &ДокОснования
	               |	И СХК_СписаниеЯчейки.Проведен = ИСТИНА
	               |	И СХК_СписаниеЯчейки.ПометкаУдаления = ЛОЖЬ
	               |	И СХК_СписаниеЯчейки.Собран = ИСТИНА";
	Запрос.УстановитьПараметр("ДокОснования",ДокументОснования);
	Рез =  Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
