
&НаКлиенте
Процедура СформироватьП1(Команда)
	СформироватьПриложение1();
КонецПроцедуры

&НаСервере
Процедура СформироватьПриложение1() 
	
	ОтчетП1.Очистить();
	
	ДанныеРасшифровки = Неопределено;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	Обработка =  РеквизитФормыВЗначение("Объект");
	МакетДокумента = Обработка.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 	
	
	КомпоновщикНоменклатура = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНоменклатура.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(МакетДокумента));
	КомпоновщикНоменклатура.ЗагрузитьНастройки(МакетДокумента.НастройкиПоУмолчанию);

	КомпоновщикНоменклатура.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
	КомпоновщикНоменклатура.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ставка", Ставка);
	
	//
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетДокумента, КомпоновщикНоменклатура.ПолучитьНастройки(), ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ТабПродаж = НаборПродаж();
	
	ВнешниеНаборыДанных = Новый Структура("ТабПродаж", ТабПродаж);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ОтчетП1);			// Выбор выходного табличного документа.
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ОтчетП1.ПоказатьУровеньГруппировокСтрок(0);

	
КонецПроцедуры    

&НаСервере
Функция НаборПродаж()
	Таб = Новый ТаблицаЗначений;
	Таб.Очистить();
	
	ЗапросКом = Новый Запрос;
	ЗапросКом.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                  |	ОтчетКомиссионераТовары.Номенклатура КАК Номенклатура,
	                  |	СРЕДНЕЕ((ВЫРАЗИТЬ(ОтчетКомиссионераТовары.ЦенаПродажи / ОтчетКомиссионераТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(ОтчетКомиссионераТовары.Цена / ОтчетКомиссионераТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК ЧИСЛО(15, 2))) * ОтчетКомиссионераТовары.СтавкаНДС.Ставка / 100) КАК Цена,
	                  |	ОтчетКомиссионераТовары.Ссылка.Партнер КАК Контрагент
	                  |ИЗ
	                  |	Документ.ОтчетКомиссионера.Товары КАК ОтчетКомиссионераТовары
	                  |ГДЕ
	                  |	ОтчетКомиссионераТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                  |	И ОтчетКомиссионераТовары.Ссылка.Проведен = ИСТИНА
	                  |	И ОтчетКомиссионераТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ОтчетКомиссионераТовары.Номенклатура,
	                  |	ОтчетКомиссионераТовары.Ссылка.Партнер";
	ЗапросКом.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));  
	ЗапросКом.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));  
	
	ТабКом = ЗапросКом.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	""                                                                      "" КАК Персонаж,
	              |	ДвиженияСерийТоваров.Регистратор КАК Регистратор,
	              |	ДвиженияСерийТоваров.Серия КАК Серия,
	              |	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	              |	ДвиженияСерийТоваров.Получатель КАК Контрагент,
	              |	СУММА(ДвиженияСерийТоваров.Количество) КАК Количество,
	              |	""СМФ"" КАК Артикул
	              |ПОМЕСТИТЬ ВТЗ
	              |ИЗ
	              |	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	              |ГДЕ
	              |	ДвиженияСерийТоваров.Серия.СХК_Префикс = &СХК_Префикс
	              |	И ДвиженияСерийТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	              |	И ДвиженияСерийТоваров.ЭтоСкладскоеДвижение = &ЭтоСкладскоеДвижение
	              |	И ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ДвиженияСерийТоваров.Регистратор,
	              |	ДвиженияСерийТоваров.Серия,
	              |	ДвиженияСерийТоваров.Номенклатура,
	              |	ДвиженияСерийТоваров.Получатель
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СУММА(РеализацияТоваровУслугТовары.СуммаСНДС - РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаВыручкиБезНДС,
	              |	ВЫРАЗИТЬ((РеализацияТоваровУслугТовары.СуммаСНДС - РеализацияТоваровУслугТовары.СуммаНДС) / ВТЗ.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
	              |	ВТЗ.Артикул КАК Артикул,
	              |	СУММА(ВТЗ.Количество) КАК Количество,
	              |	ВТЗ.Контрагент КАК Контрагент,
	              |	ВТЗ.Номенклатура КАК Номенклатура,
	              |	ВТЗ.Персонаж КАК Персонаж,
	              |	РеализацияТоваровУслугТовары.Ссылка КАК Документ
	              |ИЗ
	              |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗ КАК ВТЗ
	              |		ПО РеализацияТоваровУслугТовары.Ссылка = ВТЗ.Регистратор
	              |			И РеализацияТоваровУслугТовары.Серия = ВТЗ.Серия
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВТЗ.Артикул,
	              |	ВТЗ.Контрагент,
	              |	ВТЗ.Номенклатура,
	              |	ВТЗ.Персонаж,
	              |	ВЫРАЗИТЬ((РеализацияТоваровУслугТовары.СуммаСНДС - РеализацияТоваровУслугТовары.СуммаНДС) / ВТЗ.Количество КАК ЧИСЛО(15, 2)),
	              |	РеализацияТоваровУслугТовары.Ссылка";  
	
	Запрос.УстановитьПараметр("ЭтоСкладскоеДвижение",Ложь);
	Запрос.УстановитьПараметр("СХК_Префикс","СМФ");  
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));  
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));  
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	Таб = Результат.Выгрузить(СпособОбхода);   
	
	Для Каждого стр из Таб Цикл 
		ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ПерсонажиПленки"); // Получение дополнительного реквизита 
		Значение = УправлениеСвойствами.ЗначениеСвойства(стр.Номенклатура.Ссылка, ДопСвойство);
		Если ЗначениеЗаполнено(Значение) Тогда
			стр.Персонаж = Значение.Наименование;	
		Иначе                                       
			стр.Персонаж = "";
		КонецЕсли; 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура );
		Отбор.Вставить("Контрагент",стр.Контрагент);
		Строки = ТабКом.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда
			стр.Цена = Окр(Строки[0].Цена,2);
			стр.СуммаВыручкиБезНДС =стр.Количество * Окр(Строки[0].Цена ,2) ;
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	//Таб.Свернуть("Персонаж,Артикул,Серия,Номенклатура,Контрагент","Количество,СуммаВыручкиБезНДС");
	
	Возврат Таб;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	Ставка = 5; 
	ДатаОтчета = ТекущаяДата();
	//Организация = "СмартБар Групп ООО";//Справочники.Организации.НайтиПоНаименованию("СмартБар Групп ООО");
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВыбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ОрганизацияОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры 

&НаСервере
Процедура ОрганизацияОбработкаВыбораНаСервере(ВыбранноеЗначение) 
	Если ВыбранноеЗначение = "1" Тогда
		Организация = "Собинский Хлебокомбинат АО";
	ИначеЕсли ВыбранноеЗначение = "2" Тогда 
		Организация = "СмартБар Групп ООО";
	КонецЕсли;			
КонецПроцедуры

&НаКлиенте
Процедура ВаловаяПрибыль(Команда) 
 ВнешнийОтчетСсылка = ПолучитьСсылкуНаВнешнийОтчетПоИмениНаСервере("Продажи");

   Если Не ЗначениеЗаполнено(ВнешнийОтчетСсылка) Тогда
       ПоказатьПредупреждение(, "Отчет не найден!");
       Возврат;
   КонецЕсли;

   Попытка
       ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВнешнийОтчетСсылка);

       ПараметрыФормы = Новый Структура;
       ПараметрыФормы.Вставить("КлючВарианта", "Валовая прибыль по номенклатуре_пересчет из спаек в штуки");
       ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

       ОткрытьФорму("ВнешнийОтчет." + ИмяОбработки + ".Форма", ПараметрыФормы, ЭтаФорма);
   Исключение
       ПоказатьПредупреждение(, "Ошибка при открытии отчета: " + ОписаниеОшибки());
   КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаВнешнийОтчетПоИмениНаСервере(ИмяОтчета)

 Запрос = Новый Запрос;
   Запрос.Текст =
   "ВЫБРАТЬ
   |	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
   |ИЗ
   |	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
   |ГДЕ
   |	ДополнительныеОтчетыИОбработки.Наименование = &ИмяОтчета
   |	И ДополнительныеОтчетыИОбработки.Родитель.Наименование = &Наименование
   |	И ДополнительныеОтчетыИОбработки.ЭтоГруппа = Ложь
   |";

   Запрос.УстановитьПараметр("ИмяОтчета", ИмяОтчета);
   Запрос.УстановитьПараметр("Наименование", "Отчеты");
   Результат = Запрос.Выполнить().Выгрузить();


   Возврат Результат[0].Ссылка;

КонецФункции

&НаКлиенте
Процедура СформироватьП2(Команда)
		ТаблДокум = ПечатьНаСервереПриложение2();
		ТаблДокум.Показать("Приложение 2");

	КонецПроцедуры    
	
	&НаСервере
	Функция ПечатьНаСервереПриложение2()  
		
		ТаблДок = Новый ТабличныйДокумент;
		ТаблДок.Очистить();
		
				ТипМакет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Приложение2");	
		ОбластьШапка = ТипМакет.ПолучитьОбласть("Шапка"); 
		ОбластьШапка.Параметры.НомерОтчета =  "Отчет № " + Строка(ЭтаФорма.НомерОтчета);
		ОбластьШапка.Параметры.ПериодОтчета =  "Период отчета: 	Начало	" + Строка(Формат(ЭтаФорма.Период.ДатаНачала,"ДЛФ=Д"))+"	Окончание " + Строка(Формат(ЭтаФорма.Период.ДатаОкончания,"ДЛФ=Д")) ;
		ОбластьШапка.Параметры.ДатаОтчета =  "Дата отчета : " + Строка(Формат(ЭтаФорма.ДатаОтчета,"ДЛФ=Д"));
		ТаблДок.Вывести(ОбластьШапка); 
		
		ШапкаСтрока = ТипМакет.ПолучитьОбласть("ШапкаСтрока");
		ТаблДок.Вывести(ШапкаСтрока); 

		Строка = ТипМакет.ПолучитьОбласть("Строка"); 
		
		ТабП = НаборПродаж(); 
		Таб	=ТабП.Скопировать();
		Таб.Свернуть("Персонаж,Номенклатура","Количество,СуммаВыручкиБезНДС");
		ПП = 1;
		ИтСуммаРоялти = 0;
		Для Каждого стр из Таб Цикл
			Строка.Параметры.ПП =ПП;	
			Строка.Параметры.Произведение	 =стр.Персонаж;	
			Строка.Параметры.Номенклатура =стр.Номенклатура;	
			Строка.Параметры.Артикул ="СМФ";	
			Строка.Параметры.КолТовара =стр.Количество;	
			Строка.Параметры.Цена =Окр(стр.СуммаВыручкиБезНДС/стр.Количество,2);	
			Строка.Параметры.СуммаРеализации =стр.СуммаВыручкиБезНДС;	
			Строка.Параметры.СтавкаРоялти =Строка(ЭтаФорма.Ставка) + " %";
			СуммаРоялти = Окр(стр.СуммаВыручкиБезНДС *ЭтаФорма.Ставка / 100,2);  
			Строка.Параметры.СуммаРоялти = СуммаРоялти; 
			ИтСуммаРоялти = ИтСуммаРоялти + СуммаРоялти;
			ПП = ПП+1;
			ТаблДок.Вывести(Строка); 

		КонецЦикла;
		СтрокаПодвал = ТипМакет.ПолучитьОбласть("СтрокаПодвал"); 
		СтрокаПодвал.Параметры.ИтКол = Таб.Итог("Количество") ;
		СтрокаПодвал.Параметры.ИтСумма = Таб.Итог("СуммаВыручкиБезНДС");
		СтрокаПодвал.Параметры.ИтРоялти = ИтСуммаРоялти;
		ТаблДок.Вывести(СтрокаПодвал);

		Подвал = ТипМакет.ПолучитьОбласть("Подвал");
		Подвал.Параметры.ИтРоялти = ИтСуммаРоялти;
		Подвал.Параметры.МинимальныйОстаток = ЭтаФорма.МинимальныйОстаток;
		Подвал.Параметры.СуммаКВыплате = ?((ИтСуммаРоялти-ЭтаФорма.МинимальныйОстаток)>0,ИтСуммаРоялти-ЭтаФорма.МинимальныйОстаток,"0.00");
		Подвал.Параметры.СуммаОстатка = ?((ЭтаФорма.МинимальныйОстаток-ИтСуммаРоялти)>0,ЭтаФорма.МинимальныйОстаток-ИтСуммаРоялти,"0.00");
		
		ТаблДок.Вывести(Подвал);

		Примечание = ТипМакет.ПолучитьОбласть("Примечание");
		ТаблДок.Вывести(Примечание);

		КАШапка = ТипМакет.ПолучитьОбласть("КАШапка");
		ТаблДок.Вывести(КАШапка);

		
		
		КАСтрока = ТипМакет.ПолучитьОбласть("КАСтрока"); 

		//ТабК = ПродажиКонтрагенты();
		ТабК	=ТабП.Скопировать();
        ТабК.Свернуть("Контрагент","Количество,СуммаВыручкиБезНДС");
		ПП = 1;
		ИтСуммаРоялти = 0;
		Для Каждого стрК из ТабК Цикл 
			КАСтрока.Параметры.ПП =ПП;	
			КАСтрока.Параметры.Контрагент		 =стрК.Контрагент;	
			КАСтрока.Параметры.КолТовара =стрК.Количество;	
			КАСтрока.Параметры.СуммаРеализации =стрК.СуммаВыручкиБезНДС;	
			
			ПП = ПП+1;
			ТаблДок.Вывести(КАСтрока); 

		КонецЦикла;
		
		КАПодвал = ТипМакет.ПолучитьОбласть("КАПодвал"); 
		КАПодвал.Параметры.ИтКол = ТабК.Итог("Количество") ;
		КАПодвал.Параметры.ИтСумма = ТабК.Итог("СуммаВыручкиБезНДС");
		
		ТаблДок.Вывести(КАПодвал);

		Подписи = ТипМакет.ПолучитьОбласть("Подписи");
		ТаблДок.Вывести(Подписи);
		
		Возврат ТаблДок;
	КонецФункции

	&НаСервере
Функция ПродажиКонтрагенты()
	Таб = Новый ТаблицаЗначений;
	Таб.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
|	ДвиженияСерийТоваров.Серия КАК Серия,
|	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
|	СУММА(ДвиженияСерийТоваров.Количество) КАК Количество,
|	ДвиженияСерийТоваров.Регистратор КАК Регистратор,
|	ДвиженияСерийТоваров.Получатель КАК Получатель
|ПОМЕСТИТЬ ВТЗ
|ИЗ
|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
|ГДЕ
|	ДвиженияСерийТоваров.Серия.СХК_Префикс = &СХК_Префикс
|	И ДвиженияСерийТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
|	И ДвиженияСерийТоваров.ЭтоСкладскоеДвижение = &ЭтоСкладскоеДвижение
|	И ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту)
|
|СГРУППИРОВАТЬ ПО
|	ДвиженияСерийТоваров.Серия,
|	ДвиженияСерийТоваров.Номенклатура,
|	ДвиженияСерийТоваров.Регистратор,
|	ДвиженияСерийТоваров.Получатель
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СУММА(РеализацияТоваровУслугТовары.СуммаСНДС - РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаВыручкиБезНДС,
|	СУММА(ВТЗ.Количество) КАК Количество,
|	ВТЗ.Номенклатура КАК Номенклатура,
|	""                                                                      "" КАК Персонаж,
|	""СМФ"" КАК Артикул,
|	ВТЗ.Получатель КАК Получатель
|ПОМЕСТИТЬ ВТЗНоменклатура
|ИЗ
|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗ КАК ВТЗ
|		ПО (РеализацияТоваровУслугТовары.Серия = ВТЗ.Серия)
|			И (РеализацияТоваровУслугТовары.Ссылка = ВТЗ.Регистратор)
|
|СГРУППИРОВАТЬ ПО
|	ВТЗ.Номенклатура,
|	ВТЗ.Получатель
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТЗНоменклатура.Количество КАК Количество,
|	ВТЗНоменклатура.СуммаВыручкиБезНДС КАК СуммаВыручкиБезНДС,
|	ВТЗНоменклатура.Получатель КАК Получатель
|ИЗ
|	ВТЗНоменклатура КАК ВТЗНоменклатура"; 				  
	
	Запрос.УстановитьПараметр("ЭтоСкладскоеДвижение",Ложь);
	Запрос.УстановитьПараметр("СХК_Префикс","СМФ");  
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));  
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));  
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	Таб = Результат.Выгрузить(СпособОбхода);   
	
	
	Возврат Таб;	
	
КонецФункции






&НаСервере
Функция ПродажиНоменклатуры()
	Таб = Новый ТаблицаЗначений;
	Таб.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
|	ДвиженияСерийТоваров.Серия КАК Серия,
|	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
|	СУММА(ДвиженияСерийТоваров.Количество) КАК Количество,
|	ДвиженияСерийТоваров.Регистратор КАК Регистратор
|ПОМЕСТИТЬ ВТЗ
|ИЗ
|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
|ГДЕ
|	ДвиженияСерийТоваров.Серия.СХК_Префикс = &СХК_Префикс
|	И ДвиженияСерийТоваров.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
|	И ДвиженияСерийТоваров.ЭтоСкладскоеДвижение = &ЭтоСкладскоеДвижение
|	И ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту)
|
|СГРУППИРОВАТЬ ПО
|	ДвиженияСерийТоваров.Серия,
|	ДвиженияСерийТоваров.Номенклатура,
|	ДвиженияСерийТоваров.Регистратор
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СУММА(РеализацияТоваровУслугТовары.СуммаСНДС - РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаВыручкиБезНДС,
|	СУММА(ВТЗ.Количество) КАК Количество,
|	ВТЗ.Номенклатура КАК Номенклатура,
|	""                                                                      "" КАК Персонаж,
|	""СМФ"" КАК Артикул
|ПОМЕСТИТЬ ВТЗНоменклатура
|ИЗ
|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗ КАК ВТЗ
|		ПО РеализацияТоваровУслугТовары.Серия = ВТЗ.Серия
|			И РеализацияТоваровУслугТовары.Ссылка = ВТЗ.Регистратор
|
|СГРУППИРОВАТЬ ПО
|	ВТЗ.Номенклатура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТЗНоменклатура.Номенклатура КАК Номенклатура,
|	ВТЗНоменклатура.Артикул КАК Артикул,
|	ВТЗНоменклатура.Персонаж КАК Персонаж,
|	ВТЗНоменклатура.Количество КАК Количество,
|	ВТЗНоменклатура.СуммаВыручкиБезНДС КАК СуммаВыручкиБезНДС
|ИЗ
|	ВТЗНоменклатура КАК ВТЗНоменклатура"; 				  
	
	Запрос.УстановитьПараметр("ЭтоСкладскоеДвижение",Ложь);
	Запрос.УстановитьПараметр("СХК_Префикс","СМФ");  
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));  
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));  
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	Таб = Результат.Выгрузить(СпособОбхода);   
	
	Для Каждого стр из Таб Цикл 
		ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ПерсонажиПленки"); // Получение дополнительного реквизита 
		Значение = УправлениеСвойствами.ЗначениеСвойства(стр.Номенклатура.Ссылка, ДопСвойство);
		Если ЗначениеЗаполнено(Значение) Тогда
			стр.Персонаж = Значение.Наименование;	
		Иначе                                       
			стр.Персонаж = "";
		КонецЕсли;
	КонецЦикла;
	
	
	//Таб.Свернуть("Персонаж,Артикул,Серия,Номенклатура,Контрагент","Количество,СуммаВыручкиБезНДС");
	
	Возврат Таб;	
	
КонецФункции

&НаКлиенте
Процедура ОтчетОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры




