Функция ПроверитьСменитьСтатусОрдера(ТабОрдеров) Экспорт
	Мас = Новый Массив;
	Для Каждого Строка из ТабОрдеров Цикл
		ДокОрдер = Строка.Отгрузка.ПолучитьОбъект();
		Отбор = Новый Структура;
		Отбор.Вставить("Действие",Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать);
		Строки = ДокОрдер.ОтгружаемыеТовары.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда
			СЗ = Новый Структура;
			СЗ.Вставить("Ордер",ДокОрдер.Ссылка);					
			СЗ.Вставить("Причина","Не все строки отгружены");					
			Мас.Добавить(СЗ);
		Иначе
			ДокОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
			Попытка
				ДокОрдер.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				СЗ = Новый Структура;
				СЗ.Вставить("Ордер",ДокОрдер.Ссылка);					
				СЗ.Вставить("Причина","Не удалось изменить статус ордера");					
				Мас.Добавить(СЗ);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Возврат Мас;
КонецФункции
