Функция ПроверитьСменитьСтатусОрдера(ТабОрдеров) Экспорт
	Мас = Новый Массив;
	Для Каждого Строка из ТабОрдеров Цикл
		ДокОрдер = Строка.Отгрузка.ПолучитьОбъект();
		Отбор = Новый Структура;
		Отбор.Вставить("Действие",Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать);
		Строки = ДокОрдер.ОтгружаемыеТовары.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда
			СЗ = Новый Структура;
			СЗ.Вставить("Ордер",ДокОрдер.Ссылка);					
			СЗ.Вставить("Причина","Не все строки отгружены");					
			Мас.Добавить(СЗ);
		Иначе
			Если ДокОрдер.Статус <> Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда 
				УстановитьПривилегированныйРежим(Истина);
				ДокОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
				Попытка
					ДокОрдер.Записать(РежимЗаписиДокумента.Проведение); 
					УстановитьПривилегированныйРежим(Ложь);
				Исключение
					СЗ = Новый Структура;
					СЗ.Вставить("Ордер",ДокОрдер.Ссылка);					
					СЗ.Вставить("Причина","Не удалось изменить статус ордера");					
					Мас.Добавить(СЗ);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Мас;
КонецФункции

Функция ПроверитьКоличествоОрдеров(ТабЗаказКлиента) Экспорт
	Мас = Новый Массив;
	
	Для Каждого стр из ТабЗаказКлиента Цикл   
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|    СвязанныеДокументы.Ссылка
		|ИЗ
		|    КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы";
		
		
		Запрос.УстановитьПараметр("Ссылка",стр.ЗаказКлиента.Ссылка);
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда
			Мас.Добавить(Рез.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции

