
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.Расш1_СтатусОтгрузкаФакт.Отгружен Тогда
		ТабОрдеров = Документы.Расш1_ОтгрузкаФакт.ПроверитьСменитьСтатусОрдера(ТЧОтгрузка.Выгрузить());;
		Если ТабОрдеров.Количество() >=1 Тогда
			ОшОрдер = "";
			Для счетчика=0 По ТабОрдеров.Количество()-1 Цикл
				ОшОрдер = ОшОрдер + Строка(ТабОрдеров[счетчика].Ордер) +" Причина " + Строка(ТабОрдеров[счетчика].Причина) + Символы.ПС;
			КонецЦикла;
			Сообщить("Ордера содержат ошибки "+ Символы.ПС + ОшОрдер);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 

		
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

    ПроверитьДубликатыСтрокТЧОрдер(Отказ);
    ОтправитьУведомлениеПриЗаписи();

КонецПроцедуры

Процедура ПроверитьДубликатыСтрокТЧОрдер(Отказ)
    ТабличнаяЧасть = ТЧОрдер.Выгрузить();
    Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
        Отбор = Новый Структура;
        Для каждого Колонка Из ТабличнаяЧасть.Колонки Цикл
            Если Колонка.Имя <> "НомерСтроки" Тогда
                Отбор.Вставить(Колонка.Имя, СтрокаТЧ[Колонка.Имя]);
            КонецЕсли;
        КонецЦикла;

        НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Отбор);
        Если НайденныеСтроки.Количество() > 1 Тогда
            Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
                Если НайденныеСтроки.Индекс(НайденнаяСтрока) > 0 Тогда
                    СтрокаСообщения = "Строка № " + НайденныеСтроки[0].НомерСтроки + " совпадает со строкой № " + НайденнаяСтрока.НомерСтроки;
                    Сообщить("Уберите задвоения строк!" + СтрокаСообщения);
                    Отказ = Истина;
                КонецЕсли;
            КонецЦикла;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

Процедура ОтправитьУведомлениеПриЗаписи()
    Отбор = Новый Структура("Возврат", Истина);
    НайденныеСтроки = ТЧОрдер.НайтиСтроки(Отбор);
    МассивЗаказов = Новый Массив;

    Для каждого СтрокаТЧ Из НайденныеСтроки Цикл
        МассивЗаказов.Добавить(Строка(СтрокаТЧ.ЗаказКлиента.Номер));
    КонецЦикла;

    Если МассивЗаказов.Количество() > 0 Тогда
        ОтправитьУведомление(МассивЗаказов, ЭтотОбъект.Номер);
    КонецЕсли;
КонецПроцедуры



 
 Процедура ОтправитьУведомление(Мас,Номер)
	Почта = Новый ИнтернетПочта; 
	Письмо = Новый ИнтернетПочтовоеСообщение;
	ТекстПисьма = "Добрый день!"+Символы.ПС;
	ТекстПисьма = ТекстПисьма + "По документу отгрузка факт номер " + Строка(Номер) +Символы.ПС;
	ТекстПисьма = ТекстПисьма +" Возвраты по заказам :" +Символы.ПС;
	Для стр=0 по Мас.Количество()-1 Цикл
		ТекстПисьма = ТекстПисьма + "№ " + Мас[стр] + Символы.ПС; 
	КонецЦикла; 
	Текст = Письмо.Тексты.Добавить(ТекстПисьма); 
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.Тема = Строка(Строка("Возврат на склада готовой продукции") );
	Письмо.Отправитель = "1c@smartbar.ru"; 
	Письмо.ИмяОтправителя = "Отгрузка";
	//emailto = "igor.potemkin33@yandex.ru";
	emailto = "logist@smartbar.ru";
	//emailto = емаил;
	Письмо.Получатели.Добавить(emailto);
	Попытка 
		Почта.Подключиться(ПолучитьПрофильПочты()); 
		Почта.Послать(Письмо); 		
	Исключение 
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	Почта.Отключиться(); 
	Письмо.Вложения.Очистить();
	
КонецПроцедуры

 Функция ПолучитьПрофильПочты()
	 
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = "smtp.mail.ru";
	Профиль.АдресСервераPOP3 = "pop.mail.ru";
	Профиль.ПортPOP3 = 995;
	Профиль.ПортSMTP = 465; 
	Профиль.Пользователь = "1c@smartbar.ru"; 
	Профиль.Пароль = "GrKV5YLckkiM5AsF8Byt"; 
	Профиль.ПользовательSMTP =  "1c@smartbar.ru"; 
	Профиль.ПарольSMTP = "GrKV5YLckkiM5AsF8Byt"; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.ИспользоватьSSLSMTP = Истина;  

	Возврат Профиль;
КонецФункции 

 Процедура ПриКопировании(ОбъектКопирования)
	 Отправленно = Ложь;
	 Статус = Неопределено; 
	 ТчОрдер.Очистить();
 КонецПроцедуры
