
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 

		
КонецПроцедуры 

 Процедура ПоискДублейСтрокВТабЧасти(ТЧ, Отказ) Экспорт

 КонецПроцедуры

 Процедура ПриЗаписи(Отказ)
	 
	 ТаблЗнач = ТЧОрдер.Выгрузить();
	 Отбор = Новый Структура();
	 
	 Для каждого Стр Из ТаблЗнач Цикл
		 Отбор.Очистить();
		 Для каждого Колонки Из ТаблЗнач.Колонки Цикл
			 Если Колонки.Имя <> "НомерСтроки" Тогда
				 Отбор.Вставить(Колонки.Имя, Стр[Колонки.Имя]);
			 КонецЕсли;
		 КонецЦикла;
		 
		 Строки = ТаблЗнач.НайтиСтроки(Отбор);
		 Если Строки.Количество() > 1 Тогда
			 Для каждого НайденныеСтроки Из Строки Цикл
				 Если Строки.Найти(НайденныеСтроки) > 0 Тогда
					 СтрокаСообщения = "Строка № " + Строки[0].НомерСтроки + " совпадает со строкой № " + НайденныеСтроки.НомерСтроки;
					 Сообщить("Уберите задвоения строк!" + Строка(СтрокаСообщения)); 
					 Отказ = Истина;
					 
				 КонецЕсли;
			 КонецЦикла;
		 КонецЕсли;
	 КонецЦикла;
	 
	 ОтборП = Новый Структура; 
	 ОтборП.Вставить("Возврат",Истина);
	 СтрокиЗ = ТЧОрдер.НайтиСтроки(ОтборП);
	 М = Новый Массив;
	 М.Очистить();
	 Если СтрокиЗ.Количество() >= 1 Тогда
		 
		 Для сч=0 по СтрокиЗ.Количество()-1 Цикл
			 М.Добавить(Строка(СтрокиЗ[сч].ЗаказКлиента.Номер));
		 КонецЦикла;
	 КонецЕсли; 
	 
	 Если М.Количество() > 0 Тогда
		 ОтправитьУведомление(М,ЭтотОбъект.Номер);
	 КонецЕсли;
	 
 
 КонецПроцедуры 
 
 Процедура ОтправитьУведомление(Мас,Номер)
	Почта = Новый ИнтернетПочта; 
	Письмо = Новый ИнтернетПочтовоеСообщение;
	ТекстПисьма = "Добрый день!"+Символы.ПС;
	ТекстПисьма = ТекстПисьма + "По документу отгрузка факт номер " + Строка(Номер) +Символы.ПС;
	ТекстПисьма = ТекстПисьма +" Возвраты по заказам :" +Символы.ПС;
	Для стр=0 по Мас.Количество()-1 Цикл
		ТекстПисьма = ТекстПисьма + "№ " + Мас[стр] + Символы.ПС; 
	КонецЦикла; 
	Текст = Письмо.Тексты.Добавить(ТекстПисьма); 
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.Тема = Строка(Строка("Возврат на склада готовой продукции") );
	Письмо.Отправитель = "1c@smartbar.ru"; 
	Письмо.ИмяОтправителя = "Отгрузка";
	//emailto = "igor.potemkin33@yandex.ru";
	emailto = "logist@smartbar.ru";
	//emailto = емаил;
	Письмо.Получатели.Добавить(emailto);
	Попытка 
		Почта.Подключиться(ПолучитьПрофильПочты()); 
		Почта.Послать(Письмо); 		
	Исключение 
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	Почта.Отключиться(); 
	Письмо.Вложения.Очистить();
	
КонецПроцедуры

 Функция ПолучитьПрофильПочты()
	 
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = "smtp.mail.ru";
	Профиль.АдресСервераPOP3 = "pop.mail.ru";
	Профиль.ПортPOP3 = 995;
	Профиль.ПортSMTP = 465; 
	Профиль.Пользователь = "1c@smartbar.ru"; 
	Профиль.Пароль = "GrKV5YLckkiM5AsF8Byt"; 
	Профиль.ПользовательSMTP =  "1c@smartbar.ru"; 
	Профиль.ПарольSMTP = "GrKV5YLckkiM5AsF8Byt"; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.ИспользоватьSSLSMTP = Истина;  

	Возврат Профиль;
КонецФункции 

 Процедура ПриКопировании(ОбъектКопирования)
	 Отправленно = Ложь;
	 Статус = Неопределено; 
	 ТчОрдер.Очистить();
 КонецПроцедуры
