
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Ош",ЭтаФорма.Ош);
	СтуктураВозврат.Вставить("Ошибка",ЭтаФорма.Ошибка);
	СтуктураВозврат.Вставить("Серия",ЭтаФорма.Серия);
	СтуктураВозврат.Вставить("Штр",ЭтаФорма.СканШК);
	//СтуктураВозврат.Вставить("СерияНоменклатуры",ЭтаФорма.СерияНоменклатуры);
	//СтуктураВозврат.Вставить("Количество",ЭтаФорма.Количество);
	//СтуктураВозврат.Вставить("ТипНоменклатуры",ЭтаФорма.ТипНоменклатуры);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	инфШк = НайтиШКСервер(Текст);
	Если инфШк = 1 Тогда
		ЭтаФорма.СканШК = Текст; 
		ЭтаФорма.Ош = Истина;
	Иначе
		ЭтаФорма.Ош = Ложь;
		ЭтаФорма.Ошибка = инфШк; 
	КонецЕсли;

	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция НайтиШКСервер(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	               |	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
 	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Штрихкод",ШК);

	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		Ош = 1;
	Иначе  
		
		НоменклатураСпаек = СХК_ТСДСклад.ЗаполнитьУпаковкаУп(ШК,ЭтаФорма.Номенклатура); 
		
		Если НоменклатураСпаек = Неопределено Тогда
			Ош = "Код не найден";	
		Иначе  
			Ош = 1;
		КонецЕсли;  
		
	КонецЕсли;
	
	Возврат Ош;
	
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	//ЗаполнитьИнформацию(СтруктураПараметров.Штрих,СтруктураПараметров.Серия,СтруктураПараметров.Номенклатура,СтруктураПараметров.Ячейка);
	Если СтруктураПараметров.Серия <> "" Тогда
		ЭтаФорма.Серия = СтруктураПараметров.Серия;
		ЭтаФорма.Номенклатура = СтруктураПараметров.Номенклатура;
	КонецЕсли;
	
	//Если СтруктураПараметров.Ссылка <> "" Тогда
	//	ЗаполнитьИнформацию(СтруктураПараметров.НомерСтроки,СтруктураПараметров.Ссылка);
	//Иначе
	//	Сообщить("Не удалось создать документ отгрузки");	
	//КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры 

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры   

&НаСервере
Процедура ОчиститьШКСервер()
	СканШК = "";
КонецПроцедуры




