
&Вместо("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры);

	УстановитьРеквизитыЦенообразования = Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИспользуетсяЦенообразование25", УстановитьРеквизитыЦенообразования) Тогда
		УстановитьРеквизитыЦенообразования =	ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;
	
	Для Каждого Реквизит Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл
		Если Не Реквизит.Использование Тогда
			ЭтотОбъект[Реквизит.ИмяРеквизита] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Номер = СокрЛП(Номер);
	
	Если НастройкиИспользованияСерий.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ГоденДо = НачалоЧаса(ГоденДо);
	ИначеЕсли НастройкиИспользованияСерий.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоМесяцев Тогда
		ГоденДо = НачалоМесяца(ГоденДо);
	Иначе
		ГоденДо = НачалоДня(ГоденДо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиИспользованияСерий.ШаблонРабочегоНаименованияСерии) Тогда
		Наименование = НоменклатураСервер.НаименованиеПоШаблону(НастройкиИспользованияСерий.ШаблонРабочегоНаименованияСерии, ЭтотОбъект);
	Иначе
		
		Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Готовая продукция: Батончики") Тогда
			
		Иначе
			Наименование = НоменклатураКлиентСервер.ПредставлениеСерииБезРасчетаПоШаблонуНаименования(НастройкиИспользованияСерий, ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиКлючаЦен = НастройкиИспользованияСерий.НастройкиКлючаЦенПоСерии;
	Если УстановитьРеквизитыЦенообразования 
		И ЗначениеЗаполнено(НастройкиКлючаЦен)
		И НастройкиКлючаЦен <> Перечисления.ВариантОтбораДляКлючаЦен.НеИспользовать Тогда
			
		ОбновлениеНастроекЦенообразованияВидыНоменклатуры = Ложь;
		Если Не ДополнительныеСвойства.Свойство("ОбновлениеНастроекЦенообразованияВидыНоменклатуры", ОбновлениеНастроекЦенообразованияВидыНоменклатуры) Тогда
			ОбновлениеНастроекЦенообразованияВидыНоменклатуры = Ложь;
		КонецЕсли;
		
		ПроизвестиПоискХСО = ОбновлениеНастроекЦенообразованияВидыНоменклатуры;
		Если Не ОбновлениеНастроекЦенообразованияВидыНоменклатуры Тогда
			Если НастройкиКлючаЦен = Перечисления.ВариантОтбораДляКлючаЦен.ИспользоватьПоРеквизитам Тогда
				ПроизвестиПоискХСО = Истина;
			ИначеЕсли НастройкиКлючаЦен = Перечисления.ВариантОтбораДляКлючаЦен.Использовать Тогда
				ПроизвестиПоискХСО = Ложь;
			КонецЕсли;
		КонецЕсли;

		РеквизитыДляПоиска = ПолучитьРеквизитыДляПоиска(ВидНоменклатуры, НастройкиИспользованияСерий, ПроизвестиПоискХСО);
		СерияНоменклатурыДляЦенообразования = Справочники.СерииНоменклатурыДляЦенообразования.ПолучитьСериюНоменклатурыДляЦенообразования(РеквизитыДляПоиска);
		
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ПодготовитьДанныеДляСинхронизацииКлючей(ЭтотОбъект, ПараметрыСинхронизацииКлючей());

КонецПроцедуры
