&НаСервере
Процедура УстановитьУсловноеОформлениеАктуальностьЦен(Объект, УсловноеОформление, Элементы) Экспорт 
//++ plotnikov@syspod.ru #85606	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();  
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["Товары"].Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаСогласована");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.Использование = Истина;
	
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);

//-- plotnikov@syspod.ru #85606	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкуПравильнаяЦена(Объект) Экспорт
	//++ plotnikov@syspod.ru #85606
	ТаблицаТовары = Объект.Товары;
	Для Каждого Строка Из ТаблицаТовары Цикл
		
		ПравильнаяЦена = ПолучитьПравильнуюЦену(Объект, Строка.Номенклатура, Строка.ВидЦены);
		
		Строка.ЦенаИзСоглашения = ПравильнаяЦена;
		
		Если Строка.ЦенаИзСоглашения = Строка.Цена Тогда
			//или Строка.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка() Тогда
				Строка.ЦенаСогласована = Истина;
		КонецЕсли;
		
	КонецЦикла;
	//-- plotnikov@syspod.ru #85606
КонецПроцедуры

&НаСервере
Функция ПолучитьПравильнуюЦену(Объект, Номенклатура, ВидЦены)
	//++ plotnikov@syspod.ru #85606
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ВРЕМЕННЫЙ.Ссылка КАК СсылкаСоглашения,
	               |	ВРЕМЕННЫЙ.ВидЦен КАК ВидЦен,
	               |	Цены.Номенклатура КАК Номенклатура,
	               |	Цены.Цена КАК Цена,
	               |	Цены.Период КАК Период
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СК.Ссылка КАК Ссылка,
	               |		СК.ВидЦен КАК ВидЦен
	               |	ИЗ
	               |		Справочник.СоглашенияСКлиентами КАК СК
	               |	ГДЕ
	               |		СК.Ссылка = &Соглашение) КАК ВРЕМЕННЫЙ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЦН.ВидЦены КАК ВидЦен,
	               |			ЦН.Номенклатура КАК Номенклатура,
	               |			ЦН.Цена КАК Цена,
	               |			ЦН.Период КАК Период
	               |		ИЗ
	               |			РегистрСведений.ЦеныНоменклатуры КАК ЦН
	               |		ГДЕ
	               |			ЦН.Номенклатура = &Номенклатура
	               |			И НАЧАЛОПЕРИОДА(ЦН.Период, ДЕНЬ) <= &ДатаДокумента
	               |			И НАЧАЛОПЕРИОДА(ЦН.Период, ДЕНЬ) В
	               |					(ВЫБРАТЬ
	               |						МАКСИМУМ(НАЧАЛОПЕРИОДА(ЦН2.Период, ДЕНЬ))
	               |					ИЗ
	               |						РегистрСведений.ЦеныНоменклатуры КАК ЦН2
	               |					ГДЕ
	               |						ЦН2.Номенклатура = ЦН.Номенклатура
	               |						И ЦН2.ВидЦены = ЦН.ВидЦены
	               |						И НАЧАЛОПЕРИОДА(ЦН2.Период, ДЕНЬ) <= &ДатаДокумента)) КАК Цены
	               |		ПО ВРЕМЕННЫЙ.ВидЦен = Цены.ВидЦен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВРЕМЕННЫЙ.Ссылка,
	               |	ВРЕМЕННЫЙ.ВидЦен,
	               |	Цены.Номенклатура,
	               |	Цены.Цена,
	               |	Цены.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
	
	Результат =  Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Если Результат[0].Цена = NULL Тогда
			Результат[0].Цена = 0;	
		КонецЕсли;
		
		Возврат Результат[0].Цена;
	Иначе
		Возврат 0;
		
	КонецЕсли;
	
//-- plotnikov@syspod.ru #85606	
КонецФункции

&НаСервере
Процедура ПроверитьУстановкуЦен(Объект, РежимЗаписи, Отказ)
	//++ plotnikov@syspod.ru #85606
	Товары = Объект.Товары;
	НеСогласованые = Новый Массив;
	
	Для Каждого Строка Из Товары Цикл
		
		Если Строка.ЦенаСогласована = Ложь Тогда
			
			СтрНеСогласованые = Новый Структура("Номенклатура, Цена, ЦенаИзСоглашения");
			СтрНеСогласованые.Номенклатура = Строка.Номенклатура;
			СтрНеСогласованые.Цена = Строка.Цена;
			СтрНеСогласованые.ЦенаИзСоглашения = Строка.ЦенаИзСоглашения;
			
			НеСогласованые.Добавить(СтрНеСогласованые);

		КонецЕсли;
		
	КонецЦикла;
	
	Если НеСогласованые.Количество() > 0 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Сообщить("Нужно согласовать следующие позации номенклатуры: ");
			Для Каждого Позиция Из НеСогласованые Цикл
				Сообщить(Строка(Позиция.Номенклатура) + "; Цена: " + Строка(Позиция.Цена) + "; Цена из соглашения: " + Строка(Позиция.ЦенаИзСоглашения));	
			КонецЦикла;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//-- plotnikov@syspod.ru #85606
	
КонецПроцедуры

&НаСервере
Процедура __УстановкаПравильнойЦеныВЗаказКлиентаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//++ plotnikov@syspod.ru #85606
	Если СтрНайти(Источник.Комментарий, "Контур-EDI") > 0 Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Запись
			Или РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			ЗаполнитьКолонкуПравильнаяЦена(Источник);
			
			ПроверитьУстановкуЦен(Источник, РежимЗаписи, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	//-- plotnikov@syspod.ru #85606	
КонецПроцедуры
