&НаСервере
Процедура УстановитьУсловноеОформлениеАктуальностьЦен(Объект, УсловноеОформление, Элементы) Экспорт 
//++ plotnikov@syspod.ru #85606	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();  
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["Товары"].Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаСогласована");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.Использование = Истина;
	
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);

//-- plotnikov@syspod.ru #85606	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкуПравильнаяЦена(Объект) Экспорт
	//++ plotnikov@syspod.ru #85606
	ТаблицаТовары = Объект.Товары;
	Для Каждого Строка Из ТаблицаТовары Цикл
		
		ПравильнаяЦена = ПолучитьПравильнуюЦену(Объект, Строка.Номенклатура);
		
		Строка.ЦенаИзСоглашения = ПравильнаяЦена;
		
		Если Строка.ЦенаИзСоглашения = Строка.Цена Тогда
			//или Строка.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка() Тогда
				Строка.ЦенаСогласована = Истина;
		КонецЕсли;
		
	КонецЦикла;
	//-- plotnikov@syspod.ru #85606
КонецПроцедуры

&НаСервере
Функция ПолучитьПравильнуюЦену(Объект, Номенклатура)
	//++ plotnikov@syspod.ru #85606
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВРЕМЕННЫЙ.Ссылка КАК Ссылка,
	|	ВРЕМЕННЫЙ.ВидЦен КАК ВидЦен,
	|	Цены.Цена КАК Цена
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоглашенияСКлиентами.Ссылка КАК Ссылка,
	|		СоглашенияСКлиентами.ВидЦен КАК ВидЦен
	|	ИЗ
	|		Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|	ГДЕ
	|		СоглашенияСКлиентами.Ссылка = &Ссылка) КАК ВРЕМЕННЫЙ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
	|			ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|			МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ДатаПоследнейЦены,
	|			ЦеныНоменклатуры.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ГДЕ
	|			ЦеныНоменклатуры.Номенклатура = &Номенклатура
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЦеныНоменклатуры.ВидЦены,
	|			ЦеныНоменклатуры.Номенклатура,
	|			ЦеныНоменклатуры.Цена) КАК Цены
	|		ПО ВРЕМЕННЫЙ.ВидЦен = Цены.ВидЦены";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Объект.Соглашение);
	
	Результат =  Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Если Результат[0].Цена = NULL Тогда
			Результат[0].Цена = 0;	
		КонецЕсли;
		
		Возврат Результат[0].Цена;
	Иначе
		Возврат 0;
		
	КонецЕсли;
	
//-- plotnikov@syspod.ru #85606	
КонецФункции

&НаСервере
Процедура ПроверитьУстановкуЦен(Объект, РежимЗаписи, Отказ)
	//++ plotnikov@syspod.ru #85606
	Товары = Объект.Товары;
	НеСогласованые = Новый Массив;
	
	Для Каждого Строка Из Товары Цикл
		
		Если Строка.ЦенаСогласована = Ложь Тогда
			
			СтрНеСогласованые = Новый Структура("Номенклатура, Цена, ЦенаИзСоглашения");
			СтрНеСогласованые.Номенклатура = Строка.Номенклатура;
			СтрНеСогласованые.Цена = Строка.Цена;
			СтрНеСогласованые.ЦенаИзСоглашения = Строка.ЦенаИзСоглашения;
			
			НеСогласованые.Добавить(СтрНеСогласованые);

		КонецЕсли;
		
	КонецЦикла;
	
	Если НеСогласованые.Количество() > 0 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Сообщить("Нужно согласовать следующие позации номенклатуры: ");
			Для Каждого Позиция Из НеСогласованые Цикл
				Сообщить(Строка(Позиция.Номенклатура) + "; Цена: " + Строка(Позиция.Цена) + "; Цена из соглашения: " + Строка(Позиция.ЦенаИзСоглашения));	
			КонецЦикла;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//-- plotnikov@syspod.ru #85606
	
КонецПроцедуры

&НаСервере
Процедура __УстановкаПравильнойЦеныВЗаказКлиентаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
//++ plotnikov@syspod.ru #85606	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись
		Или РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
	ЗаполнитьКолонкуПравильнаяЦена(Источник);
	
	ПроверитьУстановкуЦен(Источник, РежимЗаписи, Отказ);
	
	КонецЕсли;
//-- plotnikov@syspod.ru #85606	
КонецПроцедуры
