
&После("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят И
			ТипЗнч(ЭтотОбъект.Распоряжение) = ТИП("ДокументСсылка.ЗаказНаПеремещение") Тогда
			ДокРаспоряжения = ЭтотОбъект.Распоряжение.ПолучитьОбъект(); 
			ДокРаспоряжения.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
			ДокРаспоряжения.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;			
КонецПроцедуры


&После("ЗаполнитьТоварыПоТоварамКПоступлению")
Процедура Расш1_ЗаполнитьТоварыПоТоварамКПоступлению(ВидЗаполнения, ДатаПоступления)
	Если ТипЗнч(ЭтотОбъект.Распоряжение) = ТИП("ДокументСсылка.ЗаказНаСборку") И Товары.Количество() = 1 Тогда
		Попытка
			Товары[0].Серия = ЭтотОбъект.Распоряжение.СХК_СерииНоменклатуры	;
			Товары[0].СтатусУказанияСерий = 4;  
			Товары[0].КоличествоУпаковок = ЭтотОбъект.Распоряжение.КоличествоУпаковок;  
			Товары[0].Упаковка = ЭтотОбъект.Распоряжение.Упаковка;
			Товары[0].Количество =  ЭтотОбъект.Распоряжение.Упаковка.Числитель * ЭтотОбъект.Распоряжение.КоличествоУпаковок;
		Исключение
			Сообщить("Не удалось вставить серию: " +Строка(ЭтотОбъект.Распоряжение.СХК_СерииНоменклатуры));
		КонецПопытки;
	КонецЕслИ;
КонецПроцедуры
