
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ДатаТЗ = Дата("28.12.2023 00:00:00");
	//ЭтаФорма.ДатаТЗ = ТекущаяДата();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТЗ();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗ()
	СПолучатель = Новый Массив; 
	Если ЭтаФорма.Склад = "" Тогда
		СПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("Лаборатория"));
		СПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ЦК Цех Комплектации"));
		СПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ЦМ Цех Мюсли"));
	Иначе
		СПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию(ЭтаФорма.Склад));
	КонецЕсли;
	ТЗЗаказНаПеремещение.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаПеремещение.СкладПолучатель КАК СкладПолучатель,
	               |	ЗаказНаПеремещение.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	               |ГДЕ
	               |	ЗаказНаПеремещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ЗаказНаПеремещение.Проведен = &Проведен
	               |	И ЗаказНаПеремещение.ПометкаУдаления = &ПометкаУдаления
				   |	И ЗаказНаПеремещение.СкладПолучатель В (&СкладПолучатель)"; 
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ЭтаФорма.ДатаТЗ));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ЭтаФорма.ДатаТЗ));
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("СкладПолучатель",СПолучатель);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Количество() >=1 Тогда
		Пока Рез.Следующий() Цикл
			Т = ТЗЗаказНаПеремещение.Добавить();
			Т.СсылкаДок = Рез.Ссылка;
			Т.СкладПолучатель = Рез.СкладПолучатель; 
		КонецЦикла;
	Иначе
		Сообщить("Нет документов");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьТЗ();
КонецПроцедуры


&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ЗаполнитьТЗ();
КонецПроцедуры


&НаКлиенте
Процедура ПоискИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	//561c0b06-a33e-11ee-a604-ac1f6befbf1f   
	Рез = ПоискОрдерПриИзмененииНаСервере(Текст);
	Если Рез <> Ложь Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);	
 
   		 ПоказатьВопрос(Оповещение,
        	"Начать отгрузку",
        	РежимДиалогаВопрос.ДаНет,
        	0, // таймаут в секундах
        	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        	"Создать ордер" // (необ.) заголовок
    	);    		
	Иначе
		Сообщить("Не нашел");
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция  ПоискОрдерПриИзмененииНаСервере(Т) 
	//Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("3accfd60-3247-4862-ab79-e9aced2515"))); 
	Попытка
		СсылкаДок = Документы.ЗаказНаПеремещение.ПолучитьСсылку(Новый УникальныйИдентификатор(Т));	
		Возврат Документы.ЗаказНаПеремещение.ПолучитьСсылку(Новый УникальныйИдентификатор(Т));
	Исключение
		Возврат Ложь;	
	КонецПопытки;
	
КонецФункции  

 &НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	
КонецПроцедуры


&НаСервере
Функция  ПолучитьДокумент(Док) 
	Возврат Док.Ссылка;	
КонецФункции 


&НаКлиенте
Процедура ТЗЗаказНаПеремещениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СсылкаДок = ПолучитьДокумент(Элемент.ТекущиеДанные.СсылкаДок);
	Если СсылкаДок <> Ложь Тогда   
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);	
 
   		 ПоказатьВопрос(Оповещение,
        	"Начать отгрузку",
        	РежимДиалогаВопрос.ДаНет,
        	0, // таймаут в секундах
        	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        	"Создать ордер" // (необ.) заголовок
    	);    		
	Иначе
		Сообщить("Не нашел");
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
       	ПараметрыФормыЗаказа = Новый Структура;
		ПараметрыФормыЗаказа.Вставить("Ссылка",СсылкаДок);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыЗаказа,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_ТСДСырье.Форма.ФормаОрдер", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
    КонецЕсли;	
 
КонецПроцедуры


&НаКлиенте
Процедура ТЗЗаказНаПеремещениеПриАктивизацииСтроки(Элемент)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

