Функция ПолучитьПрофильПочты() Экспорт
	//Создаем профиль либо считываем из справочника 
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = "smtp.mail.ru";//Отправитель.АдресСервераSMTP; //"smtp.mail.ru"; 
	Профиль.АдресСервераPOP3 = "pop.mail.ru"; //Отправитель.АдресСервераPOP3; //"pop.mail.ru"; 
	Профиль.ПортPOP3 = 995;//Отправитель.ПортPOP3; //110;
	Профиль.ПортSMTP = 465;//Отправитель.ПортSMTP; //587; 
	Профиль.Пользователь = "1c@smartbar.ru";// 
	Профиль.Пароль = "GrKV5YLckkiM5AsF8Byt";
	Профиль.ПользовательSMTP =  "1c@smartbar.ru";//Отправитель.Email; //"test@mail.ru"; 
	Профиль.ПарольSMTP = "GrKV5YLckkiM5AsF8Byt";//Отправитель.Пароль; //"123456789"; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.ИспользоватьSSLSMTP = Истина;  
	//Создаем письмо 
	Возврат Профиль;
КонецФункции