
&Перед("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика. 
	Для Каждого стр из ЭтотОбъект.Товары Цикл 
		Если стр.Цена = 0 Тогда
			ОписаниеОшибки = "По номенклатуре " + Строка(стр.Номенклатура) + " не заполнена цена";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ОписаниеОшибки,
				ЭтотОбъект,
				, // Поле
				, // ПутьКДанным
				Отказ);

		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

&После("ПриЗаписи")
Процедура Расш1_ПриЗаписи(Отказ)
	Почта = Новый ИнтернетПочта; 
	Письмо = Новый ИнтернетПочтовоеСообщение;
	ТекстПисьма = "Изменен документ № " + Строка(Номер) + " по контрагенту " + Строка(Партнер) ;
	
	Текст = Письмо.Тексты.Добавить(ТекстПисьма); 
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;	
	
	Письмо.Тема = Строка("Уведомление о проведении документа план продаж "); 
	Письмо.Отправитель = "1c@smartbar.ru"; 
	Письмо.ИмяОтправителя = "Уведомление о проведении документа план продаж";
	
	emailto = "i.emelyanova@smartbar.ru";	
	emailto1 = "zamprod@smartbar.ru";	
	//emailto2 = "logist@smartbar.ru";	
	//emailto3 = "operator@smartbar.ru";	
	emailto7 = "t.budaeva@smartbar.ru";
	
	//emailto = "igor.potemkin33@yandex.ru"; 
	Письмо.Получатели.Добавить(emailto);
	//Письмо.Получатели.Добавить(emailto1);
	//Письмо.Получатели.Добавить(emailto2);
	//Письмо.Получатели.Добавить(emailto3);
	//Письмо.Получатели.Добавить(emailto4);
	//Письмо.Получатели.Добавить(emailto5);
	Письмо.Получатели.Добавить(emailto7);
	Попытка
		Почта.Подключиться(Расш_ПрофильПочты.ПолучитьПрофильПочты()); 
		Почта.Послать(Письмо); 
	Исключение 
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Почта.Отключиться(); 
КонецПроцедуры
