
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	//zaitsev@syspod.ru #77986
	//Список.Параметры.УстановитьЗначениеПараметра("Статус","Выполнено");
	//Список.Параметры.УстановитьЗначениеПараметра("Пользователь",Пользователи.АвторизованныйПользователь()); 
	//zaitsev@syspod.ru #77986
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.Статус = "Выполнен" Тогда
		Отказ = Истина;
		Предупреждение("Записи в статусе выполнено удалять НЕЛЬЗЯ");
	КонецЕсли;
		
КонецПроцедуры
